{"[PAD]": 0, "[CLS]": 1, "[SEP]": 2, "[MASK]": 3, "[UNK]": 4, "#": 5, "(": 6, ")": 7, "+": 8, "-": 9, "1": 10, "2": 11, "3": 12, "4": 13, "5": 14, "6": 15, "7": 16, "=": 17, "A": 18, "B": 19, "C": 20, "F": 21, "H": 22, "I": 23, "N": 24, "O": 25, "P": 26, "S": 27, "[": 28, "]": 29, "c": 30, "e": 31, "i": 32, "l": 33, "n": 34, "o": 35, "r": 36, "s": 37, "cc": 38, "CC": 39, "c1": 40, "(=": 41, "c1cc": 42, "c2": 43, "Cl": 44, "OC": 45, "CCC": 46, "c1cccc": 47, "NC": 48, "c2cc": 49, "c1ccc": 50, "cc1": 51, "c1ccccc1": 52, "C1": 53, "nc": 54, "CCCC": 55, ")(": 56, ")=": 57, "CO": 58, "n1": 59, "c3": 60, "c2cccc": 61, "CC1": 62, "CN": 63, "CCN": 64, "c2ccccc2": 65, ")(=": 66, "cc2": 67, "C2": 68, "ccc": 69, "OCC": 70, "(-": 71, "n2": 72, "c2ccc": 73, "c1c": 74, "N1": 75, "CCCCC": 76, "c2c": 77, "COC": 78, "cccc": 79, "CC2": 80, "nc2": 81, "CCO": 82, "Cc1ccc": 83, "C3": 84, "Br": 85, "nc1": 86, "Cc1ccccc1": 87, "n3": 88, "N2": 89, "NC1": 90, "Nc1ccc": 91, "c1nc": 92, "ncc": 93, "Nc3": 94, "CCOC": 95, "CS": 96, "COc1ccc": 97, "CCC1": 98, "CNC": 99, "NS": 100, "CN1": 101, "ccccc3": 102, "c4": 103, "COc1cc": 104, "NCC": 105, "Cc1cc": 106, "nn": 107, "CCCCC1": 108, "n1cc": 109, "cc3": 110, "nc3": 111, "ccc1": 112, "cc1Cl": 113, "CCC2": 114, "ccc2": 115, "NN": 116, "c3ccccc3": 117, "OC2": 118, "CC4": 119, "OC1": 120, "Cc1cccc": 121, "c1n": 122, "c5": 123, "Oc1ccc": 124, "Nc1ccccc1": 125, "CCCCCCCC": 126, "C1C": 127, "Nc1cc": 128, "c1C": 129, "CCC4": 130, "Nc3ccc": 131, "c12": 132, "SC": 133, "CCN1": 134, "CCOCC": 135, "4c": 136, "Cc1c": 137, "CC3": 138, "COc1ccccc1": 139, "s1": 140, "Nc1cccc": 141, "Nc2ccc": 142, "c2ccccc21": 143, "Nc1nc": 144, "O1": 145, "cc1C": 146, "C1O": 147, "O2": 148, "n4": 149, "COc1cccc": 150, "o1": 151, "C4": 152, "c1Cl": 153, "nc12": 154, "C2C": 155, "Clc1ccc": 156, "Clc1cc": 157, "n4n3": 158, "Oc1ccccc1": 159, "CCCC1": 160, "n1c": 161, "c3c": 162, "OCCOCC": 163, "Cc2c": 164, "Nc4": 165, "n2cc": 166, "OCCN": 167, "c1ccc2c": 168, "Nc3nc": 169, "CCNC": 170, "NNC": 171, "CCS": 172, "n2c": 173, "c2nc": 174, "CCCCC2": 175, "CN1CCN": 176, "ccccc": 177, "c3ccc": 178, "sc": 179, "ncc2": 180, "c1OC": 181, "nc2N": 182, "CC1CC": 183, "Nc3nc4c": 184, "c1cncc": 185, "Oc1cccc": 186, "Cc2cnc": 187, "cccn4n3": 188, "cc4": 189, "C1CCC": 190, "2c": 191, "c1ncc": 192, "COC1": 193, "N3": 194, "Nc2": 195, "CCl": 196, "CCCC2": 197, "C3CCC4": 198, "ccc3": 199, "nn1": 200, "C1CC": 201, "C1OC": 202, "CCOCC2": 203, "c2Cl": 204, "CCCN": 205, "C5": 206, "nc23": 207, "CCC1n1cc": 208, "Nc4ccc": 209, "c1O": 210, "n2nc": 211, "CCC3": 212, "n3nc": 213, "c1cccnc1": 214, "N1C": 215, "2cccc": 216, "CC1CCCCC1": 217, "cc2Cl": 218, "N4": 219, "Oc1cc": 220, "c2cccn3nc": 221, "CCOP": 222, "Nc1c": 223, "ncn1": 224, "cn1": 225, "N2C": 226, "1C": 227, "OC3": 228, "c3cc": 229, "CCCl": 230, "CC12": 231, "c2ccccc2n1": 232, "OCC1": 233, "nH": 234, "N1CC1": 235, "Cc2ccccc2": 236, "cc1OC": 237, "c1cccn2nc": 238, "c1cn": 239, "ON": 240, "OCCC": 241, "oc": 242, "CC5": 243, "CCCCCC": 244, "cc2C": 245, "N1CC": 246, "NC2": 247, "NCc1ccccc1": 248, "C3C": 249, "c1nnc": 250, "ccccc4": 251, "Nc2cc": 252, "Oc2ccccc2": 253, "c2ncc": 254, "C2O": 255, "CCOc1ccc": 256, "ccc21": 257, "CCCCCCC": 258, "c5ccc": 259, "C1CCC2": 260, "c1cnc": 261, "nc2c1nc": 262, "N2CC2": 263, "Cc1": 264, "ncc1": 265, "C12": 266, "n1nn": 267, "Nc2ccccc2": 268, "c2cc3": 269, "CON": 270, "COP": 271, "N2CCOCC2": 272, "Oc2ccc": 273, "cccc1": 274, "nc2c1": 275, "c2c1": 276, "c1ccccn1": 277, "CC21C": 278, "O3": 279, "cccc2": 280, "c2ccccc12": 281, "CN1C": 282, "CN2": 283, "CC2C3CCC4": 284, "NCCN": 285, "N1CCN": 286, "CCOCC1": 287, "CCC5": 288, "OC2C": 289, "CC1CCCCC1n1cc": 290, "nc2c1ncn2": 291, "C1CC1": 292, "cc2c1": 293, ")-": 294, "NCCC": 295, "cc5": 296, "c1ccccc1C": 297, "n1n": 298, "c2ccccc2c1": 299, "Cn1c": 300, "2ccccc12": 301, "s2": 302, "ccn1": 303, "c2ccncc2": 304, "CCCCN": 305, "cc21": 306, "n1ccnc1": 307, "ccc2c1": 308, "n2cnc3": 309, "CCc1ccc": 310, "c1cccc2": 311, "CCCC3": 312, "C2CCC": 313, "NO": 314, "NCCN1": 315, "c2n1": 316, "C2OC": 317, "ccccc5": 318, "c1ccncc1": 319, "cc12": 320, "c1ccccc1Cl": 321, "C2CC": 322, "Si": 323, "nn2": 324, "COc1c": 325, "N1CCCC1": 326, "NC1CCC": 327, "c5ccccc5": 328, "sc1": 329, "CCCO": 330, "n1nnc2ccccc21": 331, "FC": 332, "](": 333, "CCc1ccccc1": 334, "nc21": 335, "OCc1ccccc1": 336, "C1CN": 337, "n1nc2ccccc2n1": 338, "Oc1c": 339, "SN": 340, "CCCNC": 341, "C1NC": 342, "CCOc1cc": 343, "N4CCN": 344, "cccc1C": 345, "CCCOC": 346, "Nc3ccc4c": 347, "nc2c1ncn2C1OC": 348, "NOCC": 349, "c1NC1": 350, "Clc1cccc": 351, "COCC": 352, "CCCCC3": 353, "nc3ccccc3": 354, "cn2": 355, "ncn2": 356, "n2ccc": 357, "CCOc1ccccc1": 358, "CSC": 359, "Oc2c": 360, "OC4": 361, "OCOC": 362, "C2CC2": 363, "ncc3": 364, "ccc1O": 365, "Oc2cc": 366, "S1": 367, "c2cc1": 368, "C1c2ccccc2": 369, "CCCCOC": 370, "N2CCN": 371, "OC1CC": 372, "Nc1ccn": 373, "Cc1cnc": 374, "Nc1n": 375, "cc1O": 376, "OCCN1": 377, "oc1": 378, "c1cc2c": 379, "c1ccccc1O": 380, "OCCN2": 381, "OCC1OC": 382, "CC1C": 383, "N1CCC": 384, "n2ccnc2": 385, "Nc2nn": 386, "nc4": 387, "c3cccc": 388, "CCNc1nc": 389, "c2ccccc2C1": 390, "NC1C": 391, "OC2CC": 392, "Oc1ccccc1C": 393, "OCCOCCOCCOCC": 394, "Cc2ccc": 395, "NOC": 396, "cccc1Cl": 397, "c2n": 398, "n1C": 399, "OC3C": 400, "Cn2c": 401, "c1cc2": 402, "OCc2ccccc2": 403, "c1ccco1": 404, "cc1N1CC": 405, "CCCCNC": 406, "C3CC": 407, "NC12": 408, "OC2OC": 409, "c5cccc": 410, "ncc2C1": 411, "c1cnccc1NC1": 412, "CC12CCC": 413, "cc1N1CCc2nc": 414, "CCc1cccc": 415, "CCC6": 416, "n1ccc": 417, "n3n2": 418, "N3CCN": 419, "CBr": 420, "OCCCC": 421, "c1NC": 422, "c2nn": 423, "CCCCCC1": 424, "OCC2": 425, "C3CCCCC3": 426, "n3cc": 427, ")[": 428, "Cc1nc": 429, "Nc2c": 430, "OP": 431, "c2ccnc": 432, "ccc4": 433, "N1CCCCC1": 434, "nc2n1": 435, "nc1C": 436, "CN1CC": 437, "COc1ccc2c": 438, "Nc1ccccc1C": 439, "Cc1n": 440, "NCCO": 441, "SC1": 442, "cc1F": 443, "C1CCC1": 444, "c2cccc3": 445, "cc2F": 446, "Nc2nc3": 447, "N5": 448, "c1nn": 449, "ClC": 450, "OCc1ccc": 451, "CCCCCCCCC": 452, "c2ccccn2": 453, "c1cnc2": 454, "N2CCCC2": 455, "c4ccc": 456, "Cc1ccc2c": 457, "ccc1Cl": 458, "ccc2N1": 459, "COc1ccccc1C": 460, "C5CCN": 461, "Cn2cncn2": 462, "Cc1ncc": 463, "NCCCCC": 464, "c2C": 465, "CCCC4": 466, "c2ccccc2Cl": 467, "N2CCCCC2": 468, "Nc3cccc": 469, "NS2": 470, "CN1CCC": 471, "c4ccccc4": 472, "CCC2C": 473, "c1cnccn1": 474, "NCCN2": 475, "nn23": 476, "Cn1ccnc1": 477, "NCCCC": 478, "nc2cc": 479, "nn3": 480, "CCCc1ccccc1": 481, "ncnc21": 482, "c32": 483, "c1csc": 484, "CCOc1c": 485, "Cc1ccccc1C": 486, "CN1CCCCC1": 487, "nc32": 488, "CCC2C3CCC4": 489, "CCCCCCCCCCCC": 490, "2C": 491, "c1cccs1": 492, "cc1OCC": 493, "CC1CCC": 494, "COc1ccc2cc": 495, "ccc1C": 496, "n2cnc3c": 497, "-]": 498, "4ccc": 499, "O4": 500, "c1N": 501, "c21": 502, "c2nc3": 503, "ncnc32": 504, "n1N": 505, "cc2S": 506, "C2CCCCC2": 507, "C2SC1": 508, "OCCOC": 509, "cc32": 510, "ccc12": 511, "OC1C": 512, "CCN1C": 513, "CCOCC3": 514, "CC3CC": 515, "COc1cccc2": 516, "ncn1C": 517, "c1cnn2ccc": 518, "N3CCNCC3": 519, "NP": 520, "nc2c": 521, "oc3c": 522, "ClC1": 523, "C1S": 524, "cccnc12": 525, "NC1CCCCC1": 526, "CCOC1": 527, "c3ccccc3C2": 528, "c2cc3c": 529, "C3CCCCC3C": 530, "CCc1cc": 531, "c1s": 532, "c1sc": 533, "c1ccccc1OC": 534, "C1C2": 535, "CCCCCCC1": 536, "CO1": 537, "COc2ccccc2": 538, "COc1nc": 539, "N1c1ccc": 540, "cccc3": 541, "CCOc1cccc": 542, "Nc3ncc": 543, "CCN1CC": 544, "CCOCC4": 545, "COc1ccccc1N1CCN": 546, "Nc1ncnc2c1ncn2C1OC": 547, "C1c2ccccc2C": 548, "C7": 549, "Oc2cccc": 550, "S2": 551, "cnn": 552, "ccncc3": 553, "c1F": 554, "c23": 555, "c1ccccc1N": 556, "C1Cl": 557, "C1CC2": 558, "CC1OC": 559, "CNCC": 560, "CNc1nc": 561, "OCCO2": 562, "N1CCOCC1": 563, "nc2c3c": 564, "Cc1cc2c": 565, "Cc1cncn1C": 566, "Oc1cccc2": 567, "nn12": 568, "Cc1o": 569, "cccc1F": 570, "N1CCCC1C": 571, "c5ccccc5N": 572, "5O": 573, "Cn1cc": 574, "Nc2cccc": 575, "NNc1ccc": 576, "Nc1ncc": 577, "cn": 578, "cn3": 579, "c2oc": 580, "OCO2": 581, "CCCc1ccc": 582, "c2ccc3": 583, "c1ccccc12": 584, "CC1CN": 585, "CCN2": 586, "CCNCC4": 587, "cc2N1": 588, "cccn1": 589, "C3CCC": 590, "c3ccccc3c2": 591, "Clc1cc2c": 592, "COC1C": 593, "N3CCCC3": 594, "c1cncnc1": 595, "OCCN2CCCCC2": 596, "CCc1c": 597, "CCn1cc": 598, "CCSC": 599, "c1cc2cccc": 600, "c2c3": 601, "c2o1": 602, "OC5": 603, "CCCN1": 604, "C1CCCCC1": 605, "CC1CC2C3CCC4": 606, "c2cnc3": 607, "N2C1C": 608, "Nc3ccccc3": 609, "CCC1OC": 610, "CCC1C2": 611, "ccc2Cl": 612, "OC2CCC3": 613, "CC3C": 614, "OCCN4": 615, "N4CCOCC4": 616, "CN2CCCCC2": 617, "c1cccc2nc": 618, "OC4CCC5": 619, "CCC6C5": 620, "Nc2nc3c": 621, "c1nnnn1": 622, "2nc": 623, "3O": 624, "C6": 625, "Fc1ccc": 626, "o2": 627, "c1C2": 628, "OC7": 629, "CCCS": 630, "CCCN2": 631, "cc1N": 632, "cc1Br": 633, "c1ccccc1C2": 634, "C1SC": 635, "CCCCc1ccc": 636, "COc2ccc": 637, "CC1O": 638, "C21": 639, "cccn3n2": 640, "COc1cc2c": 641, "OC1OC": 642, "n2cnc3ccncc3": 643, "n2cnc3ccncc32": 644, "Nc1nnnn1": 645, "no1": 646, "oc2": 647, "c1I": 648, "c1ccnc": 649, "C1OC2": 650, "CNc1cccn2nc": 651, "CCNCC": 652, "c2ccccc2F": 653, "OCCO": 654, "n2n1": 655, "CCO2": 656, "Brc1cc": 657, "n3C": 658, "n3c": 659, "NC1CC": 660, "Cc1cc2": 661, "CCOCC5": 662, "NCCNCC": 663, "c2cccc3nc": 664, "OCCN4CCCC4": 665, "Cc3ccccc3": 666, "SCC": 667, "nnc1": 668, "oc3": 669, "cccc2Cl": 670, "c1CC": 671, "c2nc3ccccc3": 672, "OC6": 673, "OCc1cccc": 674, "OCc2cccc": 675, "C1NCCN1": 676, "CCCC5": 677, "n1nc": 678, "cc2C1": 679, "C2C1": 680, "n2C": 681, "c2csc": 682, "NNc1cc": 683, "OC2C1O": 684, "OC1CCCCC1": 685, "c1ncccn1": 686, "Nc1ccc2nn": 687, "n1cncn1": 688, "Nc4cccc": 689, "CCS1": 690, "N3CCOCC3": 691, "Cc1nc2c3c": 692, "OCCN2CCOCC2": 693, "N5CCN": 694, "COc1cccc2c1C": 695, "N3CCCC3c3cc": 696, "4O": 697, "Oc3ccccc3": 698, "Sc2ccc": 699, "SC2C": 700, "oc2cc": 701, "sc3ccccc3c2": 702, "c1Br": 703, "c1ccc2cc3": 704, "c2c1C": 705, "Clc1ccccc1": 706, "n2sc3ccccc3c2": 707, "CC21": 708, "CCO1": 709, "Cc1ccco1": 710, "C3CCCC3": 711, "Cc1ccccc1O": 712, "CN1CCCC1": 713, "c4cccc": 714, "ccc1F": 715, "c1nc2ccccc2": 716, "CCCCCCCCCC": 717, "CCC4C3": 718, "Cc1cncc": 719, "CC3OC1CC": 720, "Nc1cccc2": 721, "Oc1ccccc1NC": 722, "n1cnc2c": 723, "COC1CC": 724, "Nc2sc": 725, "c2ncccc2c1": 726, "Cn1cncn1": 727, "nc3ccccc3n2": 728, "OCCN1CCCCC1": 729, "Nc3ncc4ccc": 730, "2ncnc": 731, "C1OC2COP": 732, "+]": 733, "CF": 734, "Cc1nnc": 735, "CNC12": 736, "Sc1ccccc1": 737, "SCS": 738, "onc1": 739, "s3": 740, "sc1C": 741, "sc12": 742, "c1ccc2ccccc2c1": 743, "c1ccsc1": 744, "c1ccoc1": 745, "CCCOc1ccc": 746, "NCc1ccc": 747, "c1ccccc1F": 748, "CCCCCCOC": 749, "COc1ncc": 750, "CC1CCCC": 751, "c2ccccc2c": 752, "cc2O": 753, "C2NCCN2": 754, "N2CCC2": 755, "NC1CC2": 756, "Nc3cc": 757, "CCOCc2cccc": 758, "CSCCC": 759, "CCC1C": 760, "c4c": 761, "Cc1ccc2cc": 762, "c3ccccc3S": 763, "C1CCCN1": 764, "n1nnnc1": 765, "cn2c1C": 766, "CCC65O": 767, "OCC2CN": 768, "3C": 769, "4cccc": 770, "Cn1": 771, "Nc2ccccc21": 772, "Nc1nnc": 773, "Oc2nc": 774, "oc12": 775, "ss1": 776, "ssc1": 777, "Clc1c": 778, "Clc1cnc2": 779, "OCc3ccccc3": 780, "OCN1C": 781, "CCCc1nc": 782, "NC3": 783, "NC4": 784, "C1N": 785, "C1CCCC": 786, "C1CCN": 787, "CCCCCCN": 788, "CCCCOc1ccc": 789, "n1Nc1ccc": 790, "CC1CC2": 791, "CNP": 792, "c2ccccc2N1": 793, "cc2CC1": 794, "C2CCCC": 795, "N1O": 796, "CCCCCNC": 797, "Cc1cccnc1": 798, "C3O": 799, "N2CC": 800, "CSC1": 801, "CCC12": 802, "c4cc": 803, "ccc1S": 804, "ccc1OC": 805, "CC4CC": 806, "Cc1cccc2": 807, "C4CC": 808, "C4CCN": 809, "C2Cc3c": 810, "C2Cc3cc": 811, "n1cnc": 812, "Nc3nc4cccc": 813, "CCSC1": 814, "c2ncn": 815, "ccc3N": 816, "CCC3C": 817, "ccccc43": 818, "cccc2n1": 819, "CN2CCN": 820, "NCCN1CCOCC1": 821, "c2nnc": 822, "C1CCC1C2C": 823, "NCCCCCN": 824, "Oc1cccc2c1OC": 825, "Clc1cnc2nc1": 826, "+](": 827, "23": 828, "5CCCC5": 829, "Cn2ccnc2": 830, "OS": 831, "SCc1ccccc1": 832, "nc2ccccc12": 833, "oc2c1": 834, "onc1C": 835, "CC6": 836, "c1c2c": 837, "c1ccc2n1": 838, "c2N1": 839, "c1cccc2ccccc12": 840, "nc5": 841, "CCCCO": 842, "CCCCOc1cccc": 843, "c3nn": 844, "CC1C2": 845, "CNc2cccn3nc": 846, "cc2c": 847, "ccc5": 848, "CCCCCOC": 849, "CCO3": 850, "C3CCC1": 851, "CSc1ccc": 852, "c1ccc2cnc": 853, "COC1OC": 854, "Nc2ccnc": 855, "c2ncccc12": 856, "N2CCNCC2": 857, "c2nccc": 858, "c1cnccc1NC1CCCCCC1": 859, "c1cnccc1NC1CCCCCCC1": 860, "c1cnc2n": 861, "-])": 862, "C1SCCS1": 863, "c2c34": 864, "+]([": 865, "23OCCN": 866, "c1ccc2n1CCC2C": 867, "C3CCC12C": 868, "4C": 869, "Cc2cc": 870, "Fc1cccc": 871, "NCC2": 872, "Nc5ccc": 873, "cs1": 874, "sc2c1": 875, "CCc2ccccc2": 876, "CCc1nc": 877, "c1O2": 878, "c1ccncn1": 879, "c2o": 880, "ClCC1": 881, "c1ccccc1I": 882, "c1ccccc1Br": 883, "C1c1cccc2": 884, "CCCCCCNC": 885, "CCCCON": 886, "COc1cnc": 887, "c3n2": 888, "CC1CCC2": 889, "CN5": 890, "c2ccccc2C": 891, "cc2OC1": 892, "C23": 893, "C2CCC1": 894, "OCCCCC": 895, "n2c1": 896, "c2cccnc2": 897, "c2cccs2": 898, "N1CCCC": 899, "COC2": 900, "COCc1ccccc1": 901, "N2C1SC": 902, "CSc1nnc": 903, "CSC12": 904, "NCCn1c": 905, "nc3cc": 906, "ccc2S": 907, "c5cc": 908, "Nc1ccc2c": 909, "CCN1CCCCC1": 910, "CCN1CCCC1": 911, "Cc1cn": 912, "Nc1ncnc2c1ncn2": 913, "Nc4ccccc4": 914, "ncc2c": 915, "ncc2Cl": 916, "Nc2ncc": 917, "ccc3n2": 918, "ccc3cccc": 919, "c3ccncc3": 920, "C12C": 921, "cccc12": 922, "CN2CCOCC2": 923, "c1cccc2cccnc12": 924, "CCOc1ccccc1NC": 925, "OCCN1CCN": 926, "c1cc2cc": 927, "NC12CC3CC": 928, "Nc2nc3cccc": 929, "C5CCNCC5": 930, "c1cc2ccccc2o1": 931, "CCC6C5CC": 932, "c1nc2ccccc2s1": 933, "5c": 934, "CP": 935, "Cc3ccc": 936, "NN1CC": 937, "Nc5ccccc5": 938, "Oc2nn": 939, "c6": 940, "nnc": 941, "oc2ccccc12": 942, "occ1O": 943, "CCn1c": 944, "CCn1ccc": 945, "c1o": 946, "c1OCC": 947, "c2ccc3c": 948, "cc1Nc1ccc": 949, "CO2": 950, "COCCN": 951, "COCCOCC": 952, "CNc1cc": 953, "CNc2nc": 954, "OCCc1ccccc1": 955, "n2nn": 956, "CCON": 957, "Cc1cccs1": 958, "Cc1ccccc1Cl": 959, "CS2": 960, "CN1c1ccc": 961, "CN1CCOCC1": 962, "cc3c": 963, "CCC21C": 964, "OC1CCC": 965, "Nc1ncnc2c1nc": 966, "C4C": 967, "OCCNCC": 968, "c1OCO2": 969, "c1cnccc1": 970, "Oc1cccc2ccccc12": 971, "COC12C": 972, "Nc4ccc5c": 973, "c2nccs2": 974, "Cc1s": 975, "Cc1nn": 976, "CCOc1ccccc1OCC": 977, "c2cc1Cl": 978, "c2cc1OC": 979, "c3cccc4": 980, "Nc2cn": 981, "N5CCOCC5": 982, "CCCN1c2ccccc2": 983, "CCC4C3CCC3": 984, "c3ccccc3Sc3ccc": 985, "cc2OC1c1ccc": 986, "NN1": 987, "Nc2nc": 988, "NCCCN": 989, "co1": 990, "nccc": 991, "ccc3c": 992, "c1c2ccccc2": 993, "c1ccnnc1": 994, "ClC1C": 995, "OCn1": 996, "NCc5ccc": 997, "c2cc2ccccc12": 998, "cc1NC": 999, "c1ccccc1S2": 1000, "C1N1CC1": 1001, "C1OC1OC": 1002, "COc1cncc": 1003, "c3ncc": 1004, "c2ccccc2cc2ccccc12": 1005, "CC1F": 1006, "CN4": 1007, "CCNCC2": 1008, "cc2OC": 1009, "C2CN": 1010, "C2CCC2": 1011, "C24O": 1012, "ccc4c": 1013, "cccn2n1": 1014, "OCCOc1ccc": 1015, "n2C1OC2COP": 1016, "c2cccnc2c1": 1017, "c2ccco2": 1018, "N1N": 1019, "N1c1ccccc1": 1020, "CCCCCc1cc": 1021, "CCCCCON": 1022, "c2cnc3ccccc3n2": 1023, "CC2C": 1024, "nc2nc": 1025, "Brc1ccc": 1026, "nc1Cl": 1027, "N2CC3": 1028, "CSc1nc": 1029, "NCCCl": 1030, "NCCc1ccccc1": 1031, "nc3c2": 1032, "ccc1OCCOC": 1033, "OC2OC3": 1034, "OC1Cc2c": 1035, "c1nc2c": 1036, "Nc1ccccc1Cl": 1037, "CCCCCCCCCCC": 1038, "CCCCCCCCCCCCC": 1039, "Nc1ccncc1": 1040, "COc1ccccc1NC": 1041, "COc1cccc2ccccc12": 1042, "C4CCC3": 1043, "C4CCC5": 1044, "Clc1ccc2c": 1045, "n2cccc12": 1046, "OCCN5CCCC5": 1047, "N3C": 1048, "ccc3c2": 1049, "C1CCc2c": 1050, "CC12C": 1051, "c2cc3ccccc3": 1052, "cccc2C1": 1053, "cccc2C1C": 1054, "CN2CCCC2": 1055, "Nc1nc2c": 1056, "OCCN1CCOCC1": 1057, "OCCOCCOCCOCCOCCOCC": 1058, "N2CCCC2C": 1059, "c1ssc": 1060, "cnn2cccc12": 1061, "CCC6C5CCC5": 1062, "CCCN2CCC": 1063, "n3cnc": 1064, "CNC12CCCCC1": 1065, "nc5N": 1066, "C1c1cccc2c1OCO2": 1067, "C24OO3": 1068, "3ccc4": 1069, "3CCOCC3": 1070, "43": 1071, "6c": 1072, "CNC1": 1073, "CNC1CCC": 1074, "Cn1nnnc1": 1075, "Oc1ccc2c": 1076, "Sc2ccccc21": 1077, "nnc4": 1078, "sc2": 1079, "sc3": 1080, "ccn2": 1081, "ccc2ccccc12": 1082, "CCF": 1083, "c1ccc2cc": 1084, "c1ccc2ncccc2c1": 1085, "c2s": 1086, "c2c1cc": 1087, "c2oc3c": 1088, "CCCc2ccccc2": 1089, "CCCc1c": 1090, "CCCNc1nc": 1091, "CCCOc1cc": 1092, "CCCN1CCC": 1093, "NCc1cccc": 1094, "NCc5ccccc5": 1095, "c1ccccc1S": 1096, "C1c1ccc": 1097, "C1c1ccccc1": 1098, "C1CCCC1": 1099, "ncn3C": 1100, "CCCCCC2": 1101, "COc2ccccc21": 1102, "CNc1ccc": 1103, "CCNCC5": 1104, "cc2s1": 1105, "cc2o1": 1106, "cc2COCC": 1107, "C2Cl": 1108, "OCC3": 1109, "OCCOc1ccccc1": 1110, "n2ncc": 1111, "N1c1cccc": 1112, "CCCCCN": 1113, "c2cnn3": 1114, "ccccn3": 1115, "ccccc23": 1116, "CC2CCC": 1117, "C32": 1118, "nc1N": 1119, "n3nnc4": 1120, "NC1c1ccccc1": 1121, "NC1COc2ccc": 1122, "CCOCc1cccc": 1123, "CS1": 1124, "COc1cc2ncnc": 1125, "n1cccc1": 1126, "cc3C": 1127, "ccc1N": 1128, "ccc2C": 1129, "ccc2c1OC": 1130, "NNc1cccc": 1131, "NNc1ccccc1": 1132, "c3ccccc32": 1133, "OC2CC3": 1134, "Cc1ccccn1": 1135, "Cc1cccc2ccccc12": 1136, "Nc1ccccc1F": 1137, "Nc1ccnc": 1138, "CCC43C": 1139, "CCN1CCC": 1140, "CCN1CCN": 1141, "Cc1co": 1142, "Cc1csc": 1143, "C4CCC": 1144, "Clc1cc2": 1145, "c3cnc4": 1146, "c2ncnc3": 1147, "C1CCCN1C": 1148, "c1nccnc1C": 1149, "Nc2ncc3": 1150, "ccc3F": 1151, "CC12CCC3C": 1152, "OCC1CCC": 1153, "c1cnc2ccccc2n1": 1154, "NC2CC2": 1155, "NC2CCCCC2": 1156, "C1CCC2C3C": 1157, "Nc2ccccc2C": 1158, "c2cc3oc": 1159, "cccc1Br": 1160, "cccc21": 1161, "cccc23": 1162, "ccn1CCCOC": 1163, "C2CCCN2": 1164, "NC1CCCNC1c1ccccc1": 1165, "CCOc1cc2ncnc": 1166, "N4CCNCC4": 1167, "c2cc1OCC": 1168, "c2cc1COCC": 1169, "c1cc2n": 1170, "OCc2ccccc2CCCN2CCC": 1171, "c1cnccc1NC1CCCCC1": 1172, "CN1CCc2ccc": 1173, "Cc1nc2ccccc2c": 1174, "nn3cccc23": 1175, "CCOC1OC2OC3": 1176, "OC1CCCCC1CN": 1177, "Cn1cccc": 1178, "ccc5OCC": 1179, "CCN1CCCC1CNC": 1180, "c6ccc": 1181, "n2nnnc2N": 1182, "c2cnn3ccc": 1183, "n3nnc4ccccc43": 1184, "4ccccc4": 1185, "Cc2cccc": 1186, "Cn2cnc3": 1187, "Cn1ccc": 1188, "O6": 1189, "OCCCCCC": 1190, "Oc2ncc": 1191, "Se": 1192, "SCc1ccc": 1193, "cnc1": 1194, "cn4n3": 1195, "nc2ccccc21": 1196, "nc2ccccc2c1": 1197, "nnc3ccccc3": 1198, "on1": 1199, "snc2": 1200, "CCn2": 1201, "c1c2ccccc2cc2ccccc12": 1202, "c1ccc2nc": 1203, "c1ccc2ccccc2n1": 1204, "c2CC1": 1205, "c2sc": 1206, "OCc1cc": 1207, "OCOc1ccccc1C": 1208, "CCCOc1cccc": 1209, "CCCN1C": 1210, "c1ccccc1NC": 1211, "C13": 1212, "C1OC1CC": 1213, "CCCCS": 1214, "CCCCN1C": 1215, "CCCCCCOc1ccc": 1216, "COCCOC": 1217, "COc3ccccc3": 1218, "COCCOc1ccccc1": 1219, "n1CC": 1220, "c3nc": 1221, "c3nc2c1": 1222, "c3c2C": 1223, "CNS": 1224, "cc2c1C": 1225, "cc2c3c": 1226, "OCCCl": 1227, "OCCO1": 1228, "c1cnn": 1229, "CCCCC4": 1230, "c2cncc": 1231, "COCN4": 1232, "nc2n": 1233, "nc2c2c1": 1234, "C3OC": 1235, "C3C1": 1236, "C3CCC21C": 1237, "Brc1cccc": 1238, "Cc1ccccc1OCC": 1239, "NC1CC1": 1240, "CSCC": 1241, "CSc1cccc": 1242, "CCC1COC": 1243, "ccccc32": 1244, "nc34": 1245, "ccc1Br": 1246, "ccc1c2c34": 1247, "CCC23": 1248, "OC23": 1249, "OC2C1C": 1250, "CC4C": 1251, "OC1CCN": 1252, "c1nn2c": 1253, "c1nonc1C": 1254, "CCCCCCCCOC": 1255, "CCC4C": 1256, "COc1ccccc1Cl": 1257, "COc1ccccc1OCC": 1258, "COc1ccccc1CNc1cccn2nc": 1259, "cc1CNC1CCCNC1c1ccccc1": 1260, "n4nc": 1261, "C4CC4": 1262, "Nc4cc": 1263, "Nc4cnn": 1264, "CCSCC1": 1265, "c3cccnc3": 1266, "c3cccn4nc": 1267, "c1nccs1": 1268, "ccc3c2n1": 1269, "CCC34": 1270, "cn12": 1271, "c3cc4c": 1272, "N1CC1NC12": 1273, "c1cnc2ccccc2c1": 1274, "NC2CCC": 1275, "ccccc4c3": 1276, "Nc2ccc3nn": 1277, "c2nccnc2c1": 1278, "C1CCC2C3CCC4": 1279, "C12CC3CC": 1280, "c2cc3ccccn3": 1281, "NCCCNC": 1282, "n1nnc": 1283, "ccn1C1CC": 1284, "NOS": 1285, "CCCOP": 1286, "CCCOc2cccc": 1287, "Oc2cnc3cc": 1288, "CCNc1ncnc2c1ncn2C1OC": 1289, "OCCOCCOCCOCCOCCO2": 1290, "C3CCc4cc": 1291, "Cc1nonc1": 1292, "C1CCC1C2CCC2": 1293, "c2nc3c": 1294, "c2nc3oc": 1295, "COc1ncnc2c1ncn2C1OC": 1296, "cccc3N": 1297, "Cc1onc": 1298, "c2ccc3cc2COCC": 1299, "CCN2CCCCC2": 1300, "CCCN2c3ccccc3Sc3ccc": 1301, "oc3c2c1C": 1302, "NC1CC2CC1": 1303, "C1CCCCN1": 1304, "n3cncn3": 1305, "4ccccc4n3": 1306, "Cn2cnc3ccccc32": 1307, "nnc3ccccc32": 1308, "snc2s1": 1309, "c2cc3ccccn3c2": 1310, "1CCC": 1311, "2cc1Nc1ccc": 1312, "4Cl": 1313, "6c5": 1314, "Cc3c": 1315, "Cc5ccccc5N": 1316, "Cn3cncn3": 1317, "NO3": 1318, "NN1CCC": 1319, "NN1CCCCC1": 1320, "Oc1nc": 1321, "OCC1CC": 1322, "OO4": 1323, "SCCC": 1324, "SCC1": 1325, "Sc2ccccc2": 1326, "SCCO": 1327, "SCCS": 1328, "cnc": 1329, "cs2": 1330, "cnc2n1": 1331, "oc32": 1332, "s4": 1333, "sc2ccccc12": 1334, "sccc12": 1335, "cc6": 1336, "cccc2C": 1337, "CCBr": 1338, "CCc1ccc2c": 1339, "CCn3nc": 1340, "CCc1cnc": 1341, "CCc1ssc": 1342, "c1OC1C": 1343, "c1ccc2cc3c": 1344, "c2O": 1345, "ClCC": 1346, "OCO4": 1347, "CCCc1cc": 1348, "CCCn1ccc": 1349, "NCc1cc": 1350, "NCc2ccccc2": 1351, "NCc5ccccc5N": 1352, "c2ccoc2": 1353, "c1cccnn1": 1354, "cc1S": 1355, "c1ccccc1OCC": 1356, "c1ccccc1CNc1cccn2nc": 1357, "C1CO": 1358, "C1C2CC": 1359, "C1CO1": 1360, "ncnc2n1": 1361, "CCCCOCC": 1362, "COCCO": 1363, "COc1n": 1364, "COCCCc1ccccc1": 1365, "c3c2": 1366, "c3c2c1": 1367, "c2cccccc1": 1368, "CC1NC": 1369, "CC1n1cc": 1370, "CC1CCC2C": 1371, "CC1c2nc3ccccc3": 1372, "c2ccccc2oc1": 1373, "c2ccccc2Sc2ccccc21": 1374, "cc2cccc": 1375, "c1cn2ccc": 1376, "CCCCCO": 1377, "CCCCCc1ccc": 1378, "c2cnn": 1379, "COC3": 1380, "COCc1ccc": 1381, "COCN1C": 1382, "CC2CN": 1383, "C3OC4": 1384, "Cc1ccccc1OC": 1385, "Cc1ccccc1Nc1c": 1386, "N2CCC": 1387, "NC1c2ccccc2": 1388, "NC1C2CCC1": 1389, "NC1COc2ccccc21": 1390, "CCC1C32": 1391, "c4cnn": 1392, "NCCSC": 1393, "Cc1cc2cccc": 1394, "Cc1ccc2ccccc2c1": 1395, "CCCCC1OC": 1396, "ccc1NC": 1397, "CCC21": 1398, "c3ccccc3nc": 1399, "CC43": 1400, "CC43O": 1401, "OC1CC2": 1402, "c1noc": 1403, "Nc1ccccc1S": 1404, "CCCCCCCCCCCCCC": 1405, "CCC43O": 1406, "SCc2ccccc2": 1407, "CC3C1": 1408, "CC3CN": 1409, "C4CCCC4": 1410, "C4CCNCC4": 1411, "Oc1ccccc1Cl": 1412, "Oc1ccccc1O2": 1413, "CCCC1Nc1c": 1414, "CCS2": 1415, "CCSC12": 1416, "cc4ccccc4": 1417, "ccc3Cl": 1418, "nn1C": 1419, "CCC3CC": 1420, "OC3OC": 1421, "OC3CCC4": 1422, "OCCCc1cccc": 1423, "Nc2ccc3c": 1424, "Oc2ccccc2Cl": 1425, "CCCCCCCOC": 1426, "C1CCC21CCC": 1427, "n1nnc2ccccc2c1": 1428, "cccc1CC": 1429, "CCC54O": 1430, "NCCCO": 1431, "nn2C": 1432, "cn2c1": 1433, "Nc1nc2cccc": 1434, "Nc1ncc2": 1435, "c1cc2ccc3cccc": 1436, "ccc4c32": 1437, "ccc4ccccc43": 1438, "NCCOc2ccc3cc2COCC": 1439, "nn34": 1440, "nn3C": 1441, "c2nc3cc": 1442, "c1ssc2c1": 1443, "c2c3c1OC1C": 1444, "CCC1C23O": 1445, "CCCSP": 1446, "c2nc3ccccc3s2": 1447, "c1ccc2cc3cc": 1448, "oc2c1CN": 1449, "c2ncccn2": 1450, "CC1CCC2CC": 1451, "CN5CCS": 1452, "CN5CCOCC5": 1453, "Cc3cccs3": 1454, "Oc2nnn": 1455, "c2ccc3cnc": 1456, "c1cnccc1Nc1cccc": 1457, "Cc1ssc": 1458, "c3cccc4ccc1c2c34": 1459, "OCn1ncc2c": 1460, "NCc5cccnc5N": 1461, "Nc1ccncc1S": 1462, "c2ncnc3c2cc": 1463, "Nc2ncc3c": 1464, "Nc4ccnc": 1465, "CCC341": 1466, "NOS3": 1467, "CCn3nc4ccccc4n3": 1468, "CC1c2nc3ccccc3c": 1469, "c1cn2cccnc2n1": 1470, "CCC1C32OO4": 1471, "CCC1C23OO4": 1472, "Cc2ccccc21": 1473, "Cn1nnc2ccccc21": 1474, "Cn1nc2ccccc2n1": 1475, "Fc1ccccc1": 1476, "Nc1cncc": 1477, "Nc2ccccn2": 1478, "OOC": 1479, "OCCCCCCCC": 1480, "OOC23": 1481, "P1": 1482, "SC2": 1483, "SCC2": 1484, "SCCCO": 1485, "SCCO1": 1486, "cnc3": 1487, "cnc2nc": 1488, "nc2cccc": 1489, "nc2ccc": 1490, "o3": 1491, "occ": 1492, "occc3c2": 1493, "sc2ccc": 1494, "ccc1cc": 1495, "ccncc": 1496, "CCc2ccccc21": 1497, "CCc1ncc": 1498, "CCc1cccnc1": 1499, "CCn1nnc2ccccc21": 1500, "CCn1nc2ccccc2n1": 1501, "CCc1csc": 1502, "CCn1nnc": 1503, "c13": 1504, "c1S": 1505, "c1nc2": 1506, "c1ccc2n": 1507, "c1ccc2oc": 1508, "c1ccn2ncc": 1509, "c2C1": 1510, "c2c3ccccc3": 1511, "c2nn1": 1512, "Clc1nc": 1513, "Clc1cccc2": 1514, "OCc1c": 1515, "OCO3": 1516, "OCc1c2c": 1517, "CCCBr": 1518, "CCCON": 1519, "CCCN1CCN": 1520, "CCCn1nnc2ccccc21": 1521, "CCCNc1ncnc2c1ncn2C1OC": 1522, "NCc5cccc": 1523, "NCN1CCOCC1": 1524, "NCc2cnc3": 1525, "c1cccn1C": 1526, "cc1I": 1527, "cc1Cc1cnc": 1528, "cc1CNc1cccn2nc": 1529, "cc1C1CCCN1": 1530, "C1c1cccc": 1531, "C1CNC": 1532, "C1NCC": 1533, "ncn": 1534, "CCCCc1ccccc1": 1535, "CCCCc1c": 1536, "CCCCOCCOCC": 1537, "CCCCn1nnc2ccccc21": 1538, "CCCCn1nc2ccccc2n1": 1539, "CCCCCCN1CC": 1540, "COc1": 1541, "COCCc1ccccc1": 1542, "n12": 1543, "n1cccc": 1544, "c34": 1545, "c3cc2c1C": 1546, "c3cc4ccccc4": 1547, "CC1CO": 1548, "CC1CC1": 1549, "CC1COC": 1550, "CC1CCCC1": 1551, "CC1COc2ccccc2": 1552, "CNc1ccccc1": 1553, "CNc1ccccc1C": 1554, "CN3CCOCC3": 1555, "CCNP": 1556, "CCNc1ccc": 1557, "c2ccccc2Br": 1558, "c2ccccc2o1": 1559, "cc2n1": 1560, "C2CCN": 1561, "C2C3": 1562, "C2CCCC2": 1563, "C2CCNCC2": 1564, "n21": 1565, "n2CN1": 1566, "c2cccnc12": 1567, "c1cn2c": 1568, "N12": 1569, "N1S": 1570, "CCCCCn1nnc2ccccc21": 1571, "CCCCCn1nc2ccccc2n1": 1572, "c2cnc": 1573, "c2coc": 1574, "CC2OC": 1575, "CC2CCCCC2": 1576, "CC2CCCC2": 1577, "CCOS": 1578, "CCOc1nc": 1579, "CCOc1cncc": 1580, "CCOc1ccccc1C": 1581, "C3COC": 1582, "C3CC3": 1583, "C3SC2": 1584, "BrC": 1585, "Cc1ccccc12": 1586, "Cc1ccccc1F": 1587, "Cc1ccccc1S": 1588, "Cc1ccccc1NC": 1589, "Cc1ccccc1C1": 1590, "n3c1C": 1591, "NC1CCN": 1592, "Nc1cccnc1": 1593, "nccnc12": 1594, "ncccc12": 1595, "Nc3nn": 1596, "Nc3cnn": 1597, "CCOC2": 1598, "CSP": 1599, "CSc1ccccc1": 1600, "CSc2ccccc2": 1601, "CSCCNC": 1602, "CSc3nn": 1603, "CNC2": 1604, "CN1CCOC": 1605, "CN1c2ccccc2Sc2ccccc21": 1606, "c4c5ccc": 1607, "c4OC2C": 1608, "Cc1ccnc": 1609, "Cc1ccc2ccccc2n1": 1610, "Cc1ccncc1": 1611, "Cc1ccsc1": 1612, "Cc1ccoc1": 1613, "nnn2": 1614, "CCCCC1C": 1615, "cc3F": 1616, "ccc1OCc1ccccc1": 1617, "CCC2C1": 1618, "ccc2Br": 1619, "ccc2O1": 1620, "ccc2o1": 1621, "ccc2N1CC": 1622, "NNc1ccccc1Cl": 1623, "c3ccccc3N": 1624, "OC12": 1625, "c1nc2cc": 1626, "c1nc2cccc": 1627, "c1nc2ccc": 1628, "c5cnn": 1629, "Nc1ccccc1I": 1630, "Nc1ccccc1O": 1631, "Nc1ccccc1Br": 1632, "CCCCCCCC1": 1633, "CCCCCCCCCCCCN": 1634, "C1C5": 1635, "Nc1ccc2cc3": 1636, "CCC4CC": 1637, "SCn1nnc2ccccc2c1": 1638, "CCOCCOCC": 1639, "CC3OC": 1640, "CC3OCC3": 1641, "C1O4": 1642, "Oc1ccccc1Br": 1643, "CCCC1CC": 1644, "OCCNc1ccc": 1645, "c2ncnn3cccc23": 1646, "ncc2S": 1647, "c1ncccc1CNc1cccn2nc": 1648, "N3C2": 1649, "N3CCCCC3": 1650, "Nc2nccc": 1651, "CCCC2C": 1652, "ccc3C": 1653, "ccc3c21": 1654, "N4CCC4": 1655, "N4CCCC4": 1656, "Oc1ccc2ccccc2c1": 1657, "Nc1cnc": 1658, "OC3OC4": 1659, "CC12CCC3": 1660, "Cc2ccccc2O": 1661, "OCCCOC": 1662, "OCCCc1ccccc1": 1663, "OCCCc1cccnc1": 1664, "OCCCn2ccc": 1665, "OCCCNc1ncnc2c1ncn2C1OC": 1666, "CCCCCCc1ccc": 1667, "NC2C": 1668, "Nc2ccncc2S": 1669, "CCCCCCCOc1ccccc1NC": 1670, "C1CCC2O": 1671, "C12CCC": 1672, "N2CCOCC2C": 1673, "cccc2F": 1674, "CN1Cc2ccc": 1675, "N1CCNCC1": 1676, "NCCCn1c": 1677, "NCCCn1nc": 1678, "ccn1C": 1679, "n1ccnc1CN": 1680, "CCc1cccs1": 1681, "c1cccc2c1C": 1682, "CCCOn3nnc4ccccc43": 1683, "C1CNCCN1": 1684, "nc3ccccc3c2": 1685, "n2cccn2": 1686, "Nc1nonc1": 1687, "nc4ccncc": 1688, "c3ccccn3": 1689, "c5cccc6c5": 1690, "OCC2CC2": 1691, "n3ccnc3": 1692, "ccc4C3C": 1693, "Cc1noc": 1694, "c2cccc3ccccc23": 1695, "NCCCCn1nc": 1696, "cccc3C": 1697, "Oc1cccc2cccnc12": 1698, "Cc1oc2nc3oc": 1699, "CCN2CCCC2": 1700, "CCCN1CCOC2": 1701, "CCC1C2CCC2": 1702, "CCNCC6": 1703, "n3cnc4ccncc": 1704, "NC1CCc2c": 1705, "nnc1NCCN1CCOCC1": 1706, "c2cscn2": 1707, "Nc1cccc2cccnc12": 1708, "COc1ncccc1": 1709, "Nc3ccnc": 1710, "NC4CC4": 1711, "CC1CC2C3CC": 1712, "Clc1cnc2nc1NCc1cccc": 1713, "CC65O": 1714, "C23CC4CC": 1715, "Nc1ncnc2c1ncn2C1CC": 1716, "CCCN1c2ccccc2Sc2ccc": 1717, "cc1NCc1ccco1": 1718, "C2CNCCO2": 1719, "Cn1nnnc1SCC1": 1720, "sc2s1": 1721, "Clc1cc2oc3c": 1722, "nc2c2c1CCC": 1723, "CCC23c4c5ccc": 1724, "NC1CC2CC1c1ccccc12": 1725, "ncnc2n1C1OC2COP": 1726, "c1cc2ccc3cccc4ccc": 1727, "OOC23C1O4": 1728, "NCc2cnc3nc": 1729, "cc1C1CCCN1c1ccn2ncc": 1730, "C1NCCSCc1ccc": 1731, "CSc3nnnn3C": 1732, "c5cccc6c5OC": 1733, "n3cnc4ccncc43": 1734, "([": 1735, "2cc": 1736, "3c": 1737, "3cc2": 1738, "3ccccc3": 1739, "3CCCC3": 1740, "3nc4": 1741, "3CC4CC": 1742, "4CC5": 1743, "5OC": 1744, "6CC": 1745, "6C5": 1746, "CI": 1747, "Cn": 1748, "Cn1n": 1749, "CNC1CC2": 1750, "Cn2cccn2": 1751, "NCCCCCCCC": 1752, "Nn2c": 1753, "NOCOC": 1754, "NCC1CCC": 1755, "O5": 1756, "Oc2ccccc21": 1757, "Oc3ccc": 1758, "PH": 1759, "SCCCC": 1760, "SCCN": 1761, "SSC": 1762, "SCCCCO": 1763, "][": 1764, "](=": 1765, "cnn2": 1766, "cnn3cccc23": 1767, "nc2ccccc2n1": 1768, "o4": 1769, "oc2ccc": 1770, "oc1c": 1771, "oc3cc": 1772, "se": 1773, "ss2": 1774, "ccn": 1775, "ccc2cc": 1776, "ccn4": 1777, "CCc2cc": 1778, "CCc1nnc": 1779, "CCc1ccccn1": 1780, "CCc1ccccc1C": 1781, "CCNC1CCC": 1782, "CCn1nnnc1": 1783, "CCn3nnc4ccccc43": 1784, "c1Cc1ccccc1": 1785, "c1oc": 1786, "c1cc3": 1787, "c1ccc2o": 1788, "c1ccc2cccccc1": 1789, "c2Br": 1790, "Clc1cnc": 1791, "OCc2ccc": 1792, "OCc5ccccc5": 1793, "CCCc2ccccc21": 1794, "CCCn1nc2ccccc2n1": 1795, "CCCOc1ccccc1NC": 1796, "NCc1c": 1797, "NCN2": 1798, "NCc1nc": 1799, "NCc3ccccc3": 1800, "NCc3ccc": 1801, "NCc4ccc": 1802, "NCNS2": 1803, "NCc4ccccc4": 1804, "c2ccn3": 1805, "c2ccncn2": 1806, "cc1CC": 1807, "cc1c2": 1808, "cc1NC1": 1809, "cc1OC2": 1810, "cc1ccc3cccc": 1811, "c1ccccc1CS": 1812, "c1ccccc1Nc1cccc": 1813, "c1ccccc1NCCO": 1814, "C1c1cc": 1815, "C1COC": 1816, "C1CS": 1817, "C1Nc2ccc": 1818, "C1CCCCCCC": 1819, "C1Nc2ccccc2": 1820, "C1CSC": 1821, "C1COCCOCC": 1822, "CCCCl": 1823, "CCCCCl": 1824, "CCCCSC": 1825, "CCCCNc1nc": 1826, "CCCCOc1cc": 1827, "CCCCCCOc1cc": 1828, "CCCCn1ccc": 1829, "CCCCOP": 1830, "CCCCc1csc": 1831, "CCCCOc1ccccc1NC": 1832, "CCCCCCOc1ccccc1NC": 1833, "CO3": 1834, "COc2cc": 1835, "COc2cccc": 1836, "COCCNC": 1837, "COc1nnc": 1838, "n1ncc2c": 1839, "c3Cl": 1840, "c3oc": 1841, "c3s2": 1842, "c3cc12": 1843, "c3nc21": 1844, "c3c2cc1Cl": 1845, "CC1N": 1846, "CC1CCN": 1847, "CC1CN1": 1848, "CC1CO1": 1849, "CC1CCC1C2CCC2": 1850, "CNN": 1851, "CNCCC": 1852, "CNc1cccc": 1853, "CNc2ccccc2": 1854, "CNc1ncc": 1855, "CNS2": 1856, "CNc1ccc2cc3": 1857, "CCNNC": 1858, "CCN5CCCC5": 1859, "CCN4CC5": 1860, "c2ccccc2c1OC": 1861, "c2ccccc2S1": 1862, "cc2NC": 1863, "cc2Br": 1864, "cc2S1": 1865, "C2C3C": 1866, "C2CO1": 1867, "C2c3ccccc3Sc3ccc": 1868, "C2c3cc4c": 1869, "OCCF": 1870, "OCCc1cccc": 1871, "OCCc2ccccc2": 1872, "OCCBr": 1873, "n2CCC3C": 1874, "n2nnc3ccccc32": 1875, "c1cn2cc": 1876, "c1cncn1C": 1877, "N1SC": 1878, "N1CCCCCC1": 1879, "CCCCC5": 1880, "CCCCCF": 1881, "CCCCCOc1ccc": 1882, "CCCCCNc1nc": 1883, "CCCCCOc1cccc": 1884, "CCCCCN1C": 1885, "CCCCCOc1cc": 1886, "CCCCCOc1ccccc1NC": 1887, "CCCCC4C": 1888, "c2c43": 1889, "COCc1c": 1890, "COCc2c1cc": 1891, "cccc4Cl": 1892, "CC2F": 1893, "CC2CC": 1894, "CC2NC": 1895, "CC2CCC1C2": 1896, "CC2C3CCc4cc": 1897, "nc2sccc12": 1898, "CCOc1cnc": 1899, "C3C2": 1900, "C3CC12": 1901, "C3C4CCC": 1902, "nc1O": 1903, "nc1CC": 1904, "nc1OC": 1905, "nc1Nc1cccc": 1906, "Cc1ccccc1N": 1907, "Cc1ccccc1Nc1ccncc1S": 1908, "N2C1": 1909, "NC1O": 1910, "NC1CS": 1911, "NC1CCCC1": 1912, "NC1CCCCCC1": 1913, "Nc1cccn2nc": 1914, "nccc3": 1915, "nccc2c1": 1916, "Nc3cn": 1917, "CCOC6CC": 1918, "CSCc1ccccc1": 1919, "CSc1ccc2c": 1920, "CSC21": 1921, "c4c32": 1922, "NCCc1cccc": 1923, "NCCS2": 1924, "Cc1ccnc2c": 1925, "Cc1ccc2oc": 1926, "cc3OC": 1927, "cc3cc2c1": 1928, "cc3o2": 1929, "nc3nc": 1930, "nc3sc": 1931, "ccc1OCC": 1932, "CCC2O": 1933, "CCC2C3CCc4cc": 1934, "ccc2F": 1935, "ccc2n1": 1936, "ccc2n1C": 1937, "NNP": 1938, "c3ccccc3C": 1939, "OC2C1": 1940, "OC2C1CCC": 1941, "c1nonc1": 1942, "c5c4": 1943, "Oc1cccnc1": 1944, "Nc1ccccc1N": 1945, "Nc1ccccc1OC": 1946, "Nc1ccccc1NC": 1947, "CCCCCCCCCCC1": 1948, "CCCCCCCCCCCCCCCC": 1949, "Nc1cc2cccc": 1950, "Nc1ccc2ccccc2c1": 1951, "Nc1ccc2cc3ccccc3": 1952, "CCC4C3CC": 1953, "CCOCCO": 1954, "CCOCCOC": 1955, "CCOCCOCCOCC": 1956, "Cc1cnc2n": 1957, "CC3CCC": 1958, "COc1ccccc1N": 1959, "COc1ccccc1OC": 1960, "COc1ccccc1NCC": 1961, "COc1ccccc1Nc1nc2c": 1962, "Nc1ccccn1": 1963, "Nc1cccc2ccccc12": 1964, "C4CCCCC4": 1965, "C4CCCCC4C": 1966, "Oc1ccccc1F": 1967, "Oc1ccccc1I": 1968, "Oc1ccccc1OC": 1969, "Oc1ccccc1OCCOCC": 1970, "OCCOCCOCCOC": 1971, "Cc2cnc3nc": 1972, "CCNC2": 1973, "CCSP": 1974, "CCCCC2C1": 1975, "c1OCc1ccccc1": 1976, "cc4CCC3": 1977, "COC1CCN": 1978, "COC1CC2": 1979, "COC1CCCc2ccccc21": 1980, "ccc3cc12": 1981, "C1CCc2cc": 1982, "C5O": 1983, "N4CCS": 1984, "Oc1ccc2c3c1OC1C": 1985, "Nc1cnn": 1986, "Nc1cnc2ccccc2n1": 1987, "cn1C": 1988, "CC12CC3CC": 1989, "OCC1CN": 1990, "N1CC1C2": 1991, "cc1OCc1ccccc1": 1992, "c1cnc2c": 1993, "N1CCc2ccc": 1994, "NC2COC2": 1995, "NC23CC4CC": 1996, "ccccc4n": 1997, "Nc2cc3nc4": 1998, "Oc2ccccc2C": 1999, "<start>": 0, "<end>": 1, "<pad>": 2}