{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 5,
      "content": "C1OC1",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 6,
      "content": "C2OC2",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 7,
      "content": "C3OC3",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 8,
      "content": "C4OC4",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 9,
      "content": "C5OC5",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10,
      "content": "NC",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 11,
      "content": "CCS",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 12,
      "content": "C=C(C=O)",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 13,
      "content": "c1ccccc1",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 14,
      "content": "c1cccnc1",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 15,
      "content": "c1ccc[nH]cc1",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 16,
      "content": "c2ccccc2",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 17,
      "content": "c2cccnc2",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 18,
      "content": "c2ccc[nH]cc2",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 19,
      "content": "c3ccccc3",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 20,
      "content": "c3cccnc3",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 21,
      "content": "c3ccc[nH]cc3",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 22,
      "content": "c4ccccc4",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 23,
      "content": "c4cccnc4",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 24,
      "content": "c4ccc[nH]cc4",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Sequence",
    "pretokenizers": [
      {
        "type": "Split",
        "pattern": {
          "String": "(\\[|\\]|Br|Cl|OH|NH|[CNOPSFIHBr]|[0-9]|=|#|-|\\(|\\)|\\+|\\\\|\\/|@|\\.|:|c1|n1|o1|s1)"
        },
        "behavior": "Isolated",
        "invert": false
      },
      {
        "type": "Whitespace"
      }
    ]
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "WordPiece",
    "unk_token": "[UNK]",
    "continuing_subword_prefix": "",
    "max_input_chars_per_word": 100,
    "vocab": {
      "[PAD]": 0,
      "[CLS]": 1,
      "[SEP]": 2,
      "[MASK]": 3,
      "[UNK]": 4,
      "C1OC1": 5,
      "C2OC2": 6,
      "C3OC3": 7,
      "C4OC4": 8,
      "C5OC5": 9,
      "NC": 10,
      "CCS": 11,
      "C=C(C=O)": 12,
      "c1ccccc1": 13,
      "c1cccnc1": 14,
      "c1ccc[nH]cc1": 15,
      "c2ccccc2": 16,
      "c2cccnc2": 17,
      "c2ccc[nH]cc2": 18,
      "c3ccccc3": 19,
      "c3cccnc3": 20,
      "c3ccc[nH]cc3": 21,
      "c4ccccc4": 22,
      "c4cccnc4": 23,
      "c4ccc[nH]cc4": 24,
      "#": 25,
      "%": 26,
      "(": 27,
      ")": 28,
      "+": 29,
      "-": 30,
      "/": 31,
      "0": 32,
      "1": 33,
      "2": 34,
      "3": 35,
      "4": 36,
      "5": 37,
      "6": 38,
      "7": 39,
      "8": 40,
      "9": 41,
      "=": 42,
      "@": 43,
      "A": 44,
      "B": 45,
      "C": 46,
      "F": 47,
      "H": 48,
      "I": 49,
      "N": 50,
      "O": 51,
      "P": 52,
      "S": 53,
      "[": 54,
      "\\": 55,
      "]": 56,
      "c": 57,
      "e": 58,
      "i": 59,
      "l": 60,
      "n": 61,
      "o": 62,
      "r": 63,
      "s": 64,
      "cc": 65,
      "CC": 66,
      "(=": 67,
      "ccc": 68,
      "c1": 69,
      "c2": 70,
      "ccccc": 71,
      "c3": 72,
      "CCC": 73,
      "@@": 74,
      "](": 75,
      "OC": 76,
      "Cl": 77,
      "c1ccc": 78,
      "c4": 79,
      "CCN": 80,
      "cc1": 81,
      "nc": 82,
      "cccc": 83,
      ")[": 84,
      "CO": 85,
      "CCCC": 86,
      "CN": 87,
      ")(": 88,
      ")(=": 89,
      "cc2": 90,
      "c2ccc": 91,
      "C1": 92,
      "ccccc1": 93,
      "n1": 94,
      "c3ccc": 95,
      "ccccc2": 96,
      "CC1": 97,
      "c5": 98,
      "CC2": 99,
      "C2": 100,
      "cc3": 101,
      "ccccc3": 102,
      "n2": 103,
      "c1cc": 104,
      "CCO": 105,
      "c1cccc": 106,
      "N2": 107,
      "ccccc4": 108,
      "CC3": 109,
      "CCCCC": 110,
      "c4ccc": 111,
      ")=": 112,
      "C3": 113,
      "cn": 114,
      "N1": 115,
      "nc2": 116,
      "cc4": 117,
      "CC4": 118,
      "n3": 119,
      "CNC": 120,
      "COc1ccc": 121,
      "NS": 122,
      "2C": 123,
      "Cc1ccc": 124,
      "CN1": 125,
      "COC": 126,
      "c2cc": 127,
      "N3": 128,
      "c1c": 129,
      "OCC": 130,
      "c1nc": 131,
      "Br": 132,
      "@@]": 133,
      "NCC": 134,
      "c2cccc": 135,
      "N2CCN": 136,
      "ccc1": 137,
      "CS": 138,
      "nc3": 139,
      "C4": 140,
      "(-": 141,
      "c2c": 142,
      "@]": 143,
      "ccccc5": 144,
      "c6": 145,
      "CCCN": 146,
      "c3cccc": 147,
      "nc1": 148,
      "n4": 149,
      "Oc1ccc": 150,
      ")\\": 151,
      "c3cc": 152,
      "c4cccc": 153,
      "NC1": 154,
      "Cc1ccccc1": 155,
      "c2c1": 156,
      "c5ccccc5": 157,
      "3C": 158,
      "Nc1ccc": 159,
      "1C": 160,
      "c5ccc": 161,
      "CCOC": 162,
      "c1n": 163,
      "c2nc": 164,
      "c3c": 165,
      "NO": 166,
      "CCNC": 167,
      "ccc2": 168,
      "ccc3": 169,
      "c2n": 170,
      "N4": 171,
      "CC5": 172,
      "nc4": 173,
      "Cc1cc": 174,
      "CCC1": 175,
      "CCCCN": 176,
      "cc5": 177,
      "COc1ccccc1": 178,
      "c1cc2": 179,
      "Nc2ccc": 180,
      "c1ccc2": 181,
      "COc1cc": 182,
      "1O": 183,
      "]([": 184,
      "SC": 185,
      "nn": 186,
      "2CC": 187,
      "c1C": 188,
      "C5": 189,
      "Nc3ccc": 190,
      "Cc2ccc": 191,
      "Cc2ccccc2": 192,
      "ccc4": 193,
      "1CC": 194,
      "cc1Cl": 195,
      "c4cc": 196,
      "Nc1nc": 197,
      "Clc1ccc": 198,
      "Cc1cccc": 199,
      "CCCCCCCC": 200,
      "c12": 201,
      "N3CCN": 202,
      "OCCN": 203,
      "Cc3ccccc3": 204,
      "Cn1": 205,
      "c7": 206,
      "CCCCC1": 207,
      "c2ccc3": 208,
      "COc1cccc": 209,
      "Cc3ccc": 210,
      "(\\": 211,
      "NC2": 212,
      "c1cn": 213,
      "s1": 214,
      "CCC4": 215,
      "c3c2": 216,
      "c4c": 217,
      "([": 218,
      "4C": 219,
      "oc": 220,
      "CCCN1": 221,
      "CCC2": 222,
      "N2C": 223,
      "c3nc": 224,
      "cc1OC": 225,
      "2CCC": 226,
      "nc23": 227,
      "Cc1c": 228,
      "3CCN": 229,
      "Oc2ccc": 230,
      "OC1": 231,
      "nn2": 232,
      "c3n": 233,
      "CN1CCN": 234,
      "cc1C": 235,
      "NN": 236,
      "c2cn": 237,
      "CCCNC": 238,
      "ONC": 239,
      "Fc1ccc": 240,
      "NCCN": 241,
      "sc": 242,
      "cccc2": 243,
      "COc1ccccc1N2CCN": 244,
      "CCCCC2": 245,
      "CC6": 246,
      "Oc1ccccc1": 247,
      "OCCC": 248,
      "NCCC": 249,
      "n2cc": 250,
      "N2CCC": 251,
      "Cc4ccccc4": 252,
      "c1Cl": 253,
      "c3ccc4": 254,
      "CN1C": 255,
      "n1cc": 256,
      "CCOCCO": 257,
      "ncc2": 258,
      "CCCCCCC": 259,
      "s2": 260,
      "ccc5": 261,
      "C1C": 262,
      "CCOCC4": 263,
      "1CN": 264,
      "CN1CC": 265,
      "2O": 266,
      "cn1": 267,
      "Nc1ccccc1": 268,
      "ccccc6": 269,
      "c3cn": 270,
      "FC": 271,
      "c23": 272,
      "Nc1cccc": 273,
      "c1OC": 274,
      "Cc1ccc2": 275,
      "CCCCC4": 276,
      "CCCCCC": 277,
      "3O": 278,
      "nc12": 279,
      "c1ncc": 280,
      "ccccc34": 281,
      "3CC": 282,
      "C6": 283,
      "s3": 284,
      "COc1cc2": 285,
      "Nc4ccc": 286,
      "O2": 287,
      "N5": 288,
      "CCCC2": 289,
      "c5cc": 290,
      "CCCC1": 291,
      "Nc1cc": 292,
      "c2nc3": 293,
      "C2C": 294,
      "CCCCNC": 295,
      "CCOc1ccc": 296,
      "N1C": 297,
      "nn1": 298,
      "c6ccc": 299,
      "1NC": 300,
      "cnc": 301,
      "Clc1cccc": 302,
      "c5cccc": 303,
      "O1": 304,
      "c1nc2": 305,
      "CCN1": 306,
      "c1c2": 307,
      "Oc1cccc": 308,
      "Cc4ccc": 309,
      "Cc2c": 310,
      "c6ccccc6": 311,
      "c1ccc2c": 312,
      "n2cn": 313,
      "c4o": 314,
      "N4CCOCC4": 315,
      "2CCN": 316,
      "Nc2n": 317,
      "ccccc12": 318,
      "3CCC": 319,
      "ncc": 320,
      "Nc2ccccc2": 321,
      "cc12": 322,
      "3N": 323,
      "n5": 324,
      "s4": 325,
      "nc5": 326,
      "CCCCC3": 327,
      "NNC": 328,
      "N1CCC": 329,
      "NC4": 330,
      "nH": 331,
      "CCCC4": 332,
      "COc1ccc2": 333,
      "c34": 334,
      "C1O": 335,
      "CC4CC4": 336,
      "C2CCC": 337,
      "n3nc": 338,
      "4O": 339,
      "ccc12": 340,
      "c4c3": 341,
      "ccccc45": 342,
      "nn3": 343,
      "c1O": 344,
      "c4cccc5": 345,
      "4CC": 346,
      "1OC": 347,
      "c2n1": 348,
      "cc1O": 349,
      "ccccc23": 350,
      "cc6": 351,
      "cc2c": 352,
      "c3nc4": 353,
      "c1cnc": 354,
      "cc2C": 355,
      "c5o": 356,
      "N1CCN": 357,
      "N3CCC": 358,
      "Oc2cc": 359,
      "nc2N": 360,
      "12": 361,
      "N4CCN": 362,
      "CCC5": 363,
      "N3C": 364,
      "n2cnc3c": 365,
      "c4occc4": 366,
      "c2o": 367,
      "OCO": 368,
      "c8": 369,
      "CCCO": 370,
      "c3o": 371,
      "CCOCC3": 372,
      "c5occc5": 373,
      "C1CC": 374,
      "CN4": 375,
      "c2ccc3nc": 376,
      "Nc2nc": 377,
      "CCn1": 378,
      "1CCCN1": 379,
      "23": 380,
      "CN1CCC": 381,
      "c3cccc4": 382,
      "Cc2cnc": 383,
      "o1": 384,
      "n4n3": 385,
      "Nc2cc": 386,
      "c4nc": 387,
      "C2CCN": 388,
      "CCOCC2": 389,
      "cccc4": 390,
      "c4ccc5": 391,
      "CNCC": 392,
      "c2Cl": 393,
      "@@](": 394,
      "Oc1ccc2C": 395,
      "cn3": 396,
      "Oc2ccccc2": 397,
      "OC2": 398,
      "cn2": 399,
      "n4nc": 400,
      "CCCC3": 401,
      "cc23": 402,
      "5C": 403,
      "c2ccccc21": 404,
      "N1CC": 405,
      "@](": 406,
      "Cc3cc": 407,
      "Oc1c2": 408,
      "c3C": 409,
      "c2C1": 410,
      "c4n": 411,
      "n2nc": 412,
      "c1cc2c": 413,
      "ncc3": 414,
      "CCC3": 415,
      "CC1CC": 416,
      "c2cccc3": 417,
      "c2cc3": 418,
      "cc2Cl": 419,
      "Oc3ccc": 420,
      "c2ccncc2": 421,
      "c3ccccn3": 422,
      "Cc1": 423,
      "C3CCN": 424,
      "ccc34": 425,
      "OCCCN": 426,
      "C1CCC": 427,
      "CCN1C": 428,
      "CN2": 429,
      "nc34": 430,
      "c2cc1OC": 431,
      "nc2c1nc": 432,
      "Cc1ccc2c": 433,
      "Cc2cccc": 434,
      "Nc3nc4": 435,
      "Cc1nc": 436,
      "Nc3ccccc3": 437,
      "COc2ccc": 438,
      "Oc3ccccc3": 439,
      "C1NC": 440,
      "CCOCC5": 441,
      "O3": 442,
      "cc7": 443,
      "nc24": 444,
      "NC3": 445,
      "Fc1cccc": 446,
      "CCl": 447,
      "CN3": 448,
      "c5ccccc45": 449,
      "c2C": 450,
      "Clc1cc": 451,
      "c45": 452,
      "c1nnc": 453,
      "10": 454,
      "36": 455,
      "CCN3": 456,
      "ccccc24": 457,
      "c5nc": 458,
      "Oc1c25": 459,
      "OCCCC": 460,
      "c4ccccc34": 461,
      "Oc1cc": 462,
      "C3CCC4": 463,
      "CSC": 464,
      "Nc3nc4c": 465,
      "56": 466,
      "CCN3CCN": 467,
      "cccc3": 468,
      "c1ccccc1C": 469,
      "CC7": 470,
      "ccccc4c3": 471,
      "ccc3c2": 472,
      "c1cncc": 473,
      "NCCCC": 474,
      "OC3": 475,
      "C3C": 476,
      "5CCCC": 477,
      "cccn4n3": 478,
      "c7ccc": 479,
      "c5c": 480,
      "cc3C": 481,
      "n2c": 482,
      "ccc1O": 483,
      "nc2c1ncn2": 484,
      "1CCN": 485,
      "N2CC": 486,
      "CCc1ccc": 487,
      "c5c4": 488,
      "Cn1cc": 489,
      "ccc23": 490,
      "CCN4": 491,
      "cc1F": 492,
      "N3CCOCC3": 493,
      "Nc3cccc": 494,
      "ON": 495,
      "OCC1": 496,
      "C1OC": 497,
      "CC1CCCCC1": 498,
      "Cc5ccccc5": 499,
      "Oc1ccc2": 500,
      "c3ccccc23": 501,
      "COCC": 502,
      "CCOP": 503,
      "sc1": 504,
      "c3cc4": 505,
      "OCc2ccccc2": 506,
      "CCCCC5": 507,
      "ccccc8": 508,
      "12C": 509,
      "3CN": 510,
      "Nc3n": 511,
      "OCc1ccccc1": 512,
      "ccccc13": 513,
      "c1cccc2": 514,
      "n3cn": 515,
      "ncc1": 516,
      "c4cn": 517,
      "n1C": 518,
      "6C": 519,
      "SCC": 520,
      "OC4": 521,
      "CCN3C": 522,
      "ccccc2c1": 523,
      "C2CC": 524,
      "CCOCC1": 525,
      "c4cccs4": 526,
      "NCc1ccccc1": 527,
      "Nc1c": 528,
      "CCc4ccccc4": 529,
      "COc1c": 530,
      "n3cc": 531,
      "N4CCC": 532,
      "c2cnc3nc": 533,
      "cc13": 534,
      "COP": 535,
      "ccc2c1": 536,
      "CCC1n1cc": 537,
      "ccccc7": 538,
      "c3ccc4ccccc4c3": 539,
      "OCc3ccccc3": 540,
      "CNS": 541,
      "cc3Cl": 542,
      "c3occc3": 543,
      "1CCC": 544,
      "CCOc1cc": 545,
      "COc1ccc2C": 546,
      "C4CC4": 547,
      "c3ccncc3": 548,
      "n3cnc4c": 549,
      "c13": 550,
      "nc2c1": 551,
      "c4ccccn4": 552,
      "Nc1ccc2": 553,
      "c8ccccc8": 554,
      "Cc1n": 555,
      "Nc2cccc": 556,
      "C1CN": 557,
      "\\[": 558,
      "N2CCOCC2": 559,
      "CCCCO": 560,
      "Cn2": 561,
      "Nc1n": 562,
      "Nc2nc3": 563,
      "c2ccccc12": 564,
      "c2cccn3nc": 565,
      "C1N": 566,
      "ccccc14": 567,
      "CNCc1cc": 568,
      "COc1cccc2": 569,
      "c2ccccc2n1": 570,
      "cc4F": 571,
      "CCCl": 572,
      "OS": 573,
      "CCCCCCCCC": 574,
      "Cn1cc2c": 575,
      "Nc1nc2": 576,
      "OCCO": 577,
      "no": 578,
      "n1c": 579,
      "Nc4cccc": 580,
      "CC2C": 581,
      "cc4C": 582,
      "CCNC2": 583,
      "c2ncc": 584,
      "cccc2n1": 585,
      "N2CCC3": 586,
      "CCN2": 587,
      "c7ccccc7": 588,
      "1CCCN1CC": 589,
      "Cc4cc": 590,
      "c3n2": 591,
      "c56": 592,
      "ccc45": 593,
      "(/": 594,
      "35": 595,
      "nnc": 596,
      "CCc1ccccc1": 597,
      "c4ccccc24": 598,
      "CN2C": 599,
      "Nc3ccc4": 600,
      "N5CCOCC5": 601,
      "c3cccc4ccccc34": 602,
      "OCCCN4": 603,
      "c3ccccc13": 604,
      "C2O": 605,
      "ccccc3c2": 606,
      "ccc1Oc2ccc": 607,
      "Cn1c": 608,
      "NCCN2": 609,
      "NCc2ccc": 610,
      "sc12": 611,
      "CCc3ccccc3": 612,
      "c2oc": 613,
      "C1C2CCC": 614,
      "ccccc46": 615,
      "N1CC1": 616,
      "c3ccnc": 617,
      "12CC": 618,
      "2CN": 619,
      "Oc2c": 620,
      "c1cccn2nc": 621,
      "cc2c1": 622,
      "N5CCN": 623,
      "2CCNC2": 624,
      "7C": 625,
      "occc": 626,
      "OC2C": 627,
      "ccccc5c4": 628,
      "CCN1CCN": 629,
      "Nc2c": 630,
      "c1F": 631,
      "COC1": 632,
      "2C3": 633,
      "S1": 634,
      "ncc4": 635,
      "C1CC1": 636,
      "CCOc1ccccc1": 637,
      "CCNC3": 638,
      "ccc2n1": 639,
      "c1cnccc1": 640,
      "Cc1cnc": 641,
      "CCN3CC5": 642,
      "NCc3ccc": 643,
      "2CNC": 644,
      "34": 645,
      "Oc2c1": 646,
      "c3nn": 647,
      "C1CCC2": 648,
      "ccccc35": 649,
      "cc4Cl": 650,
      "Cc5ccc": 651,
      "Si": 652,
      "c4c5": 653,
      "c1ccncc1": 654,
      "nc3c": 655,
      "OCCN2": 656,
      "c3ncc": 657,
      "Oc1ccccc1N2CCN": 658,
      "c3ccccc3C": 659,
      "c4ccccc4OC": 660,
      "Oc4ccc": 661,
      "ccn1": 662,
      "CCc2ccccc2": 663,
      "c2c3": 664,
      "c4ccccc14": 665,
      "CC1CN": 666,
      "nc13": 667,
      "ccc21": 668,
      "CCCN1C": 669,
      "Nc2ncc": 670,
      "COc1ccc2c": 671,
      "c4ccccc4Cl": 672,
      "OP": 673,
      "CC8": 674,
      "CON": 675,
      "cc3F": 676,
      "c3cnc": 677,
      "N3CCNCC3": 678,
      "3CCNC3": 679,
      "NCCCCC": 680,
      "c1ccccn1": 681,
      "c3c2C": 682,
      "c5nc6": 683,
      "C7": 684,
      "NCC2": 685,
      "NCCO": 686,
      "C2CCC1": 687,
      "N2CC2": 688,
      "NCCCCN": 689,
      "c2occc2": 690,
      "1CCCN1CCc2ccc3nc": 691,
      "13": 692,
      "Oc1c": 693,
      "CCC6": 694,
      "CCCOC": 695,
      "cc2F": 696,
      "ccc1OC": 697,
      "n4cc": 698,
      "NOC": 699,
      "cccc1": 700,
      "c1N": 701,
      "c4C": 702,
      "CCO2": 703,
      "C3CC": 704,
      "5CC6": 705,
      "Cc1nc2": 706,
      "Sc2ccc": 707,
      "CCCCc5nc6": 708,
      "CN2CCC": 709,
      "CC21C": 710,
      "C2CC2": 711,
      "CNC3": 712,
      "NCCc2ccc": 713,
      "NCCN1": 714,
      "CCOCCOCCOCCO": 715,
      "c4c5CCCCc5nc6": 716,
      "c2ccccc2C": 717,
      "c3ccccc3C2": 718,
      "ncnc2": 719,
      "c3cccs3": 720,
      "C3CCC": 721,
      "ccc1C": 722,
      "c6occc": 723,
      "c6occc6": 724,
      "4CCCC": 725,
      "ccc2C": 726,
      "CC2C3CCC4": 727,
      "C4C": 728,
      "Cc3cn": 729,
      "onc": 730,
      "c35": 731,
      "cc1S": 732,
      "n3c": 733,
      "n2ccnc2": 734,
      "CCc2c1": 735,
      "CN3C": 736,
      "c5cccnc5": 737,
      "Cc1ccc2ccccc2c1": 738,
      "CCN1CCC": 739,
      "CC1CCCCC1n1cc": 740,
      "NCc1ccc": 741,
      "c1ccccc1O": 742,
      "c4ccccc4C": 743,
      "34C": 744,
      "Oc4ccccc4": 745,
      "CN5": 746,
      "CNc1nc": 747,
      "CC12CCC": 748,
      "C2CN": 749,
      "36O": 750,
      ")-": 751,
      "Nc4ccccc4": 752,
      "NCCCN": 753,
      "COc3ccc": 754,
      "cc3c": 755,
      "C3CCCCC3": 756,
      "c2ccccn2": 757,
      "nc1C": 758,
      "c4ccncc4": 759,
      "CCn1c": 760,
      "c4c5CCCCc5nc6ccccc46": 761,
      "c3ccccc3n2": 762,
      "1N": 763,
      "1c3ccc": 764,
      "cccc1C": 765,
      "C12": 766,
      "C1CCN": 767,
      "nc3N": 768,
      "2CCCC": 769,
      "Nc3cc": 770,
      "s5": 771,
      "CCc2ccc": 772,
      "c2cc1": 773,
      "Clc1ccccc1": 774,
      "nc2C": 775,
      "CC4CC": 776,
      "N3CCCC3": 777,
      "Cc1ccccc1C": 778,
      "c2cccc3ccccc23": 779,
      "5CCCC5": 780,
      "Cc1cc2": 781,
      "Fc1ccc2c": 782,
      "S2": 783,
      "cs2": 784,
      "nn4": 785,
      "ncnc": 786,
      "cc21": 787,
      "cc34": 788,
      "Cc6": 789,
      "CCc2cc": 790,
      "n1nn": 791,
      "CC3CC": 792,
      "C4CCCCC4": 793,
      "c2cnc": 794,
      "Oc1cccc2": 795,
      "4Oc5c": 796,
      "Nc3ccc4c": 797,
      "5CC6CC": 798,
      "NCc3ccccc3": 799,
      "c1ccccc1Cl": 800,
      "Cc3c": 801,
      "Cc1ncc": 802,
      "Nc4cc": 803,
      "SCCC": 804,
      "c2cc1O": 805,
      "CN2CCN": 806,
      "cc2O": 807,
      "C2OC": 808,
      "Nc2ccc3": 809,
      "COc1cc2c": 810,
      "c4cccc5ccccc45": 811,
      "c2onc": 812,
      "c4ccc5ccccc5c4": 813,
      "Cc1cn": 814,
      "Nc1ncc": 815,
      "c3C2": 816,
      "CCCCOC": 817,
      "n1cc2c": 818,
      "CC1CCC": 819,
      "C3CC3": 820,
      "N3CC": 821,
      "CCCCNc1ncc": 822,
      "C5CC5": 823,
      "CCN3CC5CCC5": 824,
      "2CO": 825,
      "Sc3ccc": 826,
      "c4nc5": 827,
      "cnc2n1": 828,
      "n3n2": 829,
      "c4cnc": 830,
      "NCCN3": 831,
      "1CCCN1C": 832,
      "CCN4CC6": 833,
      "c2ccccc2Cl": 834,
      "c2ccccc2C1": 835,
      "1OCC": 836,
      "Oc23": 837,
      "ccn2": 838,
      "CCc1cccc": 839,
      "c3oc": 840,
      "c4cc5": 841,
      "CCNc1nc": 842,
      "CCCCCC1": 843,
      "CC1c3ccc": 844,
      "C23": 845,
      "N2CCCCC2": 846,
      "nc2n1": 847,
      "c2ccnc": 848,
      "ccc1Cl": 849,
      "c2no": 850,
      "CCCCN3C": 851,
      "Cc2ccc3": 852,
      "C3CCNCC3": 853,
      "Cn2cnc": 854,
      "CCSSC": 855,
      "Cc2cc": 856,
      "c2sc": 857,
      "Clc1ccc2": 858,
      "CCN5": 859,
      "ncnc23": 860,
      "N1CCCC1": 861,
      "nc2cc": 862,
      "CNC2": 863,
      "OCCF": 864,
      "c2noc": 865,
      "c2ccc3ccccc3c2": 866,
      "COc1ccc2cc": 867,
      "SN": 868,
      "nc2ccccc2n1": 869,
      "scc": 870,
      "CCCc1c": 871,
      "CCNCC4": 872,
      "CCCC5": 873,
      "CCCCCCC1": 874,
      "cc2s1": 875,
      "CC2CCCCC2": 876,
      "n23": 877,
      "n2ccc": 878,
      "N3CCCCC3": 879,
      "1CNC": 880,
      "OCCCCC": 881,
      "Oc2cccc": 882,
      "CCCS": 883,
      "NCCNC": 884,
      "NC1C": 885,
      "c2ncnc": 886,
      "Cc1cccc2": 887,
      "c2ccc3c": 888,
      "n5nc": 889,
      "noc2c1": 890,
      "c3ccccc3C1": 891,
      ")/": 892,
      "2OC": 893,
      "Cc3cccc": 894,
      "sc2c1": 895,
      "CCSC": 896,
      "ClC": 897,
      "c4Cl": 898,
      "c5cn": 899,
      "c2ncnc3": 900,
      "CCCCN1": 901,
      "cccc23": 902,
      "nc2c1ncn2C1OC": 903,
      "NCc4ccc": 904,
      "3CCCC": 905,
      "c9": 906,
      "CCc4cc": 907,
      "ncnc3": 908,
      "COc2cccc": 909,
      "CCCCCCN": 910,
      "CN3CCN": 911,
      "cc24": 912,
      "CC1C": 913,
      "c5ccccc35": 914,
      "CCCCCN1C": 915,
      "N2CCNCC2": 916,
      "Oc1ccccc1C": 917,
      "OCC1OC": 918,
      "OCCN2CCCCC2": 919,
      "NCc4cccc": 920,
      "4CCN": 921,
      "7CC7": 922,
      "Cc2c1": 923,
      "CCn1cc": 924,
      "c3n1": 925,
      "COc2ccccc2": 926,
      "COc1ncc": 927,
      "n2C": 928,
      "N3CCCN": 929,
      "c3csc": 930,
      "CCCN1CCC": 931,
      "cccc4Cl": 932,
      "c2ccccc2c1": 933,
      "6ccccc6": 934,
      "NOCC": 935,
      "Nc3c": 936,
      "OCC2": 937,
      "OC5": 938,
      "OCOC": 939,
      "c4n3": 940,
      "c4ncc": 941,
      "cccc2C": 942,
      "COc3ccccc3": 943,
      "COc4ccc": 944,
      "CCCCOc1ccc": 945,
      "nc4ccccc34": 946,
      "COc1ccccc1C": 947,
      "c1ccc2nc": 948,
      "CN4CCN": 949,
      "N1CCc2nc": 950,
      "Cc1oc": 951,
      "NCc5cccc": 952,
      "CCc1cc": 953,
      "ccc3C": 954,
      "c1NC": 955,
      "c1sc": 956,
      "CCCc1ccccc1": 957,
      "c4CCCC": 958,
      "cc1OCC": 959,
      "CN2CC": 960,
      "cc2c3nc": 961,
      "N2CCCC2": 962,
      "CCCCCNC": 963,
      "c2nccc": 964,
      "C5CCN": 965,
      "2CCCN2C": 966,
      "OCOc4c3": 967,
      "c2c3CCCC": 968,
      "n4ccnc4": 969,
      "n1nnc2ccccc21": 970,
      "Cc4cccc": 971,
      "NCCC1": 972,
      "O4": 973,
      "n6": 974,
      "sc5ccccc45": 975,
      "CCc1c": 976,
      "c1ccc2C": 977,
      "CCN4CC": 978,
      "c2ccc3C": 979,
      "c2cccs2": 980,
      "C1c2ccccc2": 981,
      "n1nc": 982,
      "CC3CCCCC3": 983,
      "N1CCCCC1": 984,
      "nc2c": 985,
      "NC1CCC": 986,
      "NC1CCCCC1": 987,
      "N4C": 988,
      "nn5": 989,
      "OCCN2CCC": 990,
      "nn23": 991,
      "NCCCN3CCN": 992,
      "nn12": 993,
      "c4cccc5nc": 994,
      "CN4CCCCC4": 995,
      "c2c3CCCCc3nc4": 996,
      "NCc2ccccc2": 997,
      "NC5": 998,
      "3NC": 999,
      "Fc1ccccc1": 1000,
      "SC1": 1001,
      "co": 1002,
      "sc2": 1003,
      "sc3": 1004,
      "c1CN": 1005,
      "CCCOc2ccc": 1006,
      "OCc1ccc": 1007,
      "OC3C": 1008,
      "cccc5": 1009,
      "n1nc2ccccc2n1": 1010,
      "c5n": 1011,
      "C23CCN": 1012,
      "C2CCCCC2": 1013,
      "N2Cc3ccccc3": 1014,
      "CC3CCN": 1015,
      "CC3CC3": 1016,
      "n3C": 1017,
      "Brc1ccc": 1018,
      "CS3": 1019,
      "CSCC": 1020,
      "c67": 1021,
      "Oc1ccc2O": 1022,
      "c5cccs5": 1023,
      "CCn1cc2c": 1024,
      "c4no": 1025,
      "6CCN": 1026,
      "Oc3c2": 1027,
      "cccc1Cl": 1028,
      "CCc3cc": 1029,
      "CCCc3ccccc3": 1030,
      "OC2CC": 1031,
      "c4C3": 1032,
      "cc2C1": 1033,
      "C1CCCCC1": 1034,
      "cc3C1": 1035,
      "2CS": 1036,
      "COC3": 1037,
      "c5ccccc5Cl": 1038,
      "Nc2nn": 1039,
      "CCN4CC7CC7": 1040,
      "5O": 1041,
      "c1s": 1042,
      "OCc4ccccc4": 1043,
      "c1cccs1": 1044,
      "CN1C2CCC1": 1045,
      "CSc1ccc": 1046,
      "CCCCCCCCCCCC": 1047,
      "1CN2": 1048,
      "Nc1ccn": 1049,
      "c2nc3c": 1050,
      "OC2OC": 1051,
      "c3nnn": 1052,
      "NCc4ccccc4": 1053,
      "c3ccccc3Cl": 1054,
      "1C2": 1055,
      "5CC": 1056,
      "Cc6ccccc6": 1057,
      "Nc5c4": 1058,
      "ncc5": 1059,
      "CCF": 1060,
      "CCCN2CCC": 1061,
      "CCN2CC": 1062,
      "cc1Br": 1063,
      "CCOc1cccc": 1064,
      "N1CCCC": 1065,
      "CN1CCCC1": 1066,
      "ccc1OCC": 1067,
      "C4CCN": 1068,
      "c6O": 1069,
      "N4CCCC4": 1070,
      "c7O": 1071,
      "NC2CCCCC2": 1072,
      "Cc1nn": 1073,
      "Nc2nc3nn": 1074,
      "c2c3CCCCc3nc4ccccc24": 1075,
      "c3ccccc3c2": 1076,
      "4CCC": 1077,
      "4CCCC4": 1078,
      "8CC": 1079,
      "OB": 1080,
      "cc8": 1081,
      "CCC9": 1082,
      "CCCc1ccc": 1083,
      "OC1CC": 1084,
      "CCNCC": 1085,
      "cc1N1CCc2nc": 1086,
      "CN3CCC": 1087,
      "cc2OC": 1088,
      "C1CCC1": 1089,
      "CC3C": 1090,
      "cn4": 1091,
      "cnc2c": 1092,
      "cnc1N": 1093,
      "nc25": 1094,
      "n3c2C1": 1095,
      "CN1CCCCC1": 1096,
      "OCCCCN3CCN": 1097,
      "ccc13": 1098,
      "c5ccccc5C": 1099,
      "CCCCN1C": 1100,
      "NC2CCN": 1101,
      "nn24": 1102,
      "cccc2c1": 1103,
      "CCOCCOCCO": 1104,
      "ncc2C1": 1105,
      "COc1cc2CCN": 1106,
      "c1c2CCCC": 1107,
      "Nc2nccc": 1108,
      "Cn1ccnc1": 1109,
      "NCCC1CCN": 1110,
      "c3ccccc3F": 1111,
      "c4ccccc4C3": 1112,
      "3OC": 1113,
      "45": 1114,
      "9CCCC": 1115,
      "CBr": 1116,
      "oc1": 1117,
      "CCc5ccccc5": 1118,
      "c1onc": 1119,
      "CCCOc1ccc": 1120,
      "OC1C": 1121,
      "cc1N": 1122,
      "COc1nc": 1123,
      "ccccc15": 1124,
      "CC3N": 1125,
      "CC4CC2C": 1126,
      "NS2": 1127,
      "2Cc3ccc": 1128,
      "N3CCC4": 1129,
      "c1ncn3": 1130,
      "ccc1NC": 1131,
      "CSSC": 1132,
      "nc3c1ncn3": 1133,
      "C45CC6CC": 1134,
      "c1nc2ccccc2": 1135,
      "c2nnc": 1136,
      "1CCNC1": 1137,
      "c3ccc4OCOc4c3": 1138,
      "Nc1ccccc1NC": 1139,
      "Nc1ccccc1C": 1140,
      "c5ccncc5": 1141,
      "nn13": 1142,
      "cncn1": 1143,
      "c3cccc4nc": 1144,
      "5Cc6ccc": 1145,
      "2C3CC4CC2C": 1146,
      "11": 1147,
      "Cc1cc2c": 1148,
      "NCCCN1": 1149,
      "oc2": 1150,
      "sc3c2": 1151,
      "c15": 1152,
      "OCc2cc": 1153,
      "CCN2CCC": 1154,
      "CCN8CC": 1155,
      "CCCCc1ccc": 1156,
      "cc2c4nc": 1157,
      "C1C2": 1158,
      "C13CCN": 1159,
      "CC12": 1160,
      "nc2ccccc12": 1161,
      "COC4": 1162,
      "c1csc": 1163,
      "c2csc": 1164,
      "c2ncn": 1165,
      "ccc3c": 1166,
      "N4CCCCC4": 1167,
      "cccc2Cl": 1168,
      "c2nc3N": 1169,
      "c8ccc": 1170,
      "Cn2cncn2": 1171,
      "1B": 1172,
      "Cn2ccnc2": 1173,
      "Cn4ccnc4": 1174,
      "Nc2cn": 1175,
      "Nc3cn": 1176,
      "oc3c": 1177,
      "cc1NC": 1178,
      "ncn1": 1179,
      "N12": 1180,
      "cc4ccc": 1181,
      "OCCNC": 1182,
      "C4CCC": 1183,
      "C4CCCC4": 1184,
      "ccccc56": 1185,
      "ccc2N1": 1186,
      "ccc3F": 1187,
      "nc4C": 1188,
      "OCCN3CCC": 1189,
      "c7c6": 1190,
      "Cc4ccc5": 1191,
      "10CCC": 1192,
      "c1cnccn1": 1193,
      "c3cc4ccccc4": 1194,
      "c1ccccc1N": 1195,
      "c2ccccc2F": 1196,
      "23C": 1197,
      "Fc1ccc2": 1198,
      "nnc1": 1199,
      "cccnc12": 1200,
      "c2c34": 1201,
      "c3Cl": 1202,
      "CCCN2CCN": 1203,
      "ClC1": 1204,
      "CCN1CC": 1205,
      "CCN1CN": 1206,
      "CO1": 1207,
      "CNc2nc": 1208,
      "c5ccccc15": 1209,
      "C3CCCC3": 1210,
      "C4CC5": 1211,
      "ccc3C2": 1212,
      "C5CCCCC5": 1213,
      "NC23": 1214,
      "c5cc6": 1215,
      "c4ncnc": 1216,
      "c4nsc5ccccc45": 1217,
      "cc7C": 1218,
      "CCN2CC4CC4": 1219,
      "CC8CC8": 1220,
      "NC2C": 1221,
      "c1ccccc1OC": 1222,
      "c4ccccc4c3": 1223,
      "CF": 1224,
      "Fc1cc": 1225,
      "Nc5ccc": 1226,
      "Oc4c3": 1227,
      "OCCOCCOCCOCCO": 1228,
      "CCc3ccc": 1229,
      "CCc4cccc": 1230,
      "c24": 1231,
      "OCc2cccc": 1232,
      "OCc3cc": 1233,
      "CCN2C": 1234,
      "C1CC2": 1235,
      "cc3OC": 1236,
      "CCOc2ccc": 1237,
      "2Cc3ccccc3": 1238,
      "COCc2cc": 1239,
      "NCCCCN1CCN": 1240,
      "CCCNc4c5CCCCc5nc6ccccc46": 1241,
      "c1nn": 1242,
      "Cc3ccc4": 1243,
      "4Cc5ccc": 1244,
      "c3ncnc4": 1245,
      "c3nc4ccccc4": 1246,
      "c3ccc4c": 1247,
      "Nc1cccc2": 1248,
      "c5cccc6": 1249,
      "N4CCNCC4": 1250,
      "36NC": 1251,
      "3CNCCN3C": 1252,
      "35O": 1253,
      "c2nonc2C": 1254,
      "NC3CCC": 1255,
      "NCc2nonc2C": 1256,
      "1CCCC": 1257,
      "1c2ccc": 1258,
      "4CC5": 1259,
      "8C": 1260,
      "Nc5ccccc5": 1261,
      "cs1": 1262,
      "CCn3": 1263,
      "c1CC": 1264,
      "CCNS": 1265,
      "COc3cc": 1266,
      "CNc1ccc": 1267,
      "cc2N1": 1268,
      "C1CCCCN1": 1269,
      "CC1CCN": 1270,
      "cc3C2": 1271,
      "n2n1": 1272,
      "CCOc1c": 1273,
      "cnn3": 1274,
      "N1CCOCC1": 1275,
      "ccc2Cl": 1276,
      "c2nn": 1277,
      "c2ns": 1278,
      "CCC1CC2": 1279,
      "CCCCCCCCCC": 1280,
      "CCC2C3CCC4": 1281,
      "OC1OC": 1282,
      "c3noc": 1283,
      "N5CCC": 1284,
      "12c3ccc": 1285,
      "c4ncccc4": 1286,
      "c4cnn": 1287,
      "Nc1nc2ccc": 1288,
      "c2nccs2": 1289,
      "Cc2ccc3ccccc3c2": 1290,
      "1CC2": 1291,
      "1CCCN": 1292,
      "3CO": 1293,
      "cccc12": 1294,
      "CCc4ccc": 1295,
      "cccnc4": 1296,
      "cccnc23": 1297,
      "CCCCCCNC": 1298,
      "cc2N": 1299,
      "CCO1": 1300,
      "CCOCC6": 1301,
      "CNC4": 1302,
      "CN1c23": 1303,
      "c6cc": 1304,
      "c6cccc": 1305,
      "c2c1C": 1306,
      "ccc3n2": 1307,
      "CCCCNS": 1308,
      "nnn1": 1309,
      "CCC23": 1310,
      "OCCCN3CCN": 1311,
      "n1ccnc1": 1312,
      "c3cnn": 1313,
      "COc1cc2nc": 1314,
      "c6ccc7C": 1315,
      "NC4CCCC4": 1316,
      "OCOc6": 1317,
      "c1cccc2ccccc12": 1318,
      "OCCCN4CCCCC4": 1319,
      "c1cnccc1NC1": 1320,
      "ncnc21": 1321,
      "CCN4CC6CC6": 1322,
      "1CN2CCC1CC2": 1323,
      "c1c2CCCCc2nc3": 1324,
      "12CCC": 1325,
      "1C2CCC": 1326,
      "4CN": 1327,
      "5CCC": 1328,
      "6CCOCC6": 1329,
      "Nc2c1": 1330,
      "Oc2ccc3": 1331,
      "ncc1C": 1332,
      "ccn3": 1333,
      "c1o": 1334,
      "CCCNS": 1335,
      "CCCn3c2C1": 1336,
      "c1ccco1": 1337,
      "CNc1n": 1338,
      ")([": 1339,
      "cc2cc": 1340,
      "n1N": 1341,
      "CCOc2ccccc2": 1342,
      "CC3COC4": 1343,
      "CCCCC3C": 1344,
      "CC4C": 1345,
      "CNC1CCN": 1346,
      "N3CCNC": 1347,
      "ccc1F": 1348,
      "n4C": 1349,
      "NC12": 1350,
      "3Cc4ccc": 1351,
      "ccc3N": 1352,
      "OCCN1": 1353,
      "OCCN3CCN": 1354,
      "c1cnn2ccc": 1355,
      "1CN2CCN": 1356,
      "NC4CCCCC4": 1357,
      "CCn1nnc": 1358,
      "C2CCNCC2": 1359,
      "Nc3ncc": 1360,
      "2CNCCO2": 1361,
      "CCN5CC8CC8": 1362,
      "6ccccc6c5": 1363,
      "cnn3cccc23": 1364,
      "c1ccccc1N2CCN": 1365,
      "-]": 1366,
      "Cc4c": 1367,
      "Nc1nnc": 1368,
      "Oc1nc": 1369,
      "Oc3cc": 1370,
      "OCCCCCCCC": 1371,
      "nccc": 1372,
      "sc4": 1373,
      "sc5": 1374,
      "sc1C": 1375,
      "c14": 1376,
      "c2F": 1377,
      "CCN2CCN": 1378,
      "ncnc34": 1379,
      "CO2": 1380,
      "CCCCCC2": 1381,
      "CCCCCCOC": 1382,
      "CN23": 1383,
      "cc2S": 1384,
      "cc2CC1": 1385,
      "C1S": 1386,
      "C1Cl": 1387,
      "CC1OC": 1388,
      "CC2CCC": 1389,
      "C2N": 1390,
      "C2SC1": 1391,
      "cc32": 1392,
      "cc3c4nc": 1393,
      "CCCCCN": 1394,
      "NCCCCN3CCN": 1395,
      "C4CC": 1396,
      "c5ccccc5n4": 1397,
      "ccc2C1": 1398,
      "ccc35": 1399,
      "c1cc2ccccc2": 1400,
      "C5CCC5": 1401,
      "ccc4c3": 1402,
      "Nc1ncnc2": 1403,
      "Cc3cccs3": 1404,
      "nn25": 1405,
      "nn14": 1406,
      "Cc1s": 1407,
      "C1NCN": 1408,
      "OCCCN4CCC": 1409,
      "ncnc32": 1410,
      "NC23CC4CC": 1411,
      "NC3CCCc4ccccc34": 1412,
      "c1ccccc1C2": 1413,
      "c2ccccc2N": 1414,
      "2C1": 1415,
      "3CC1": 1416,
      "3CNC": 1417,
      "6CC": 1418,
      "Cc2": 1419,
      "Cc2cn": 1420,
      "NP": 1421,
      "NNc1ccc": 1422,
      "Nc1cc2c": 1423,
      "ncccc3": 1424,
      "nnc3c": 1425,
      "onc1": 1426,
      "cccn1": 1427,
      "c1OCCN": 1428,
      "c3C1": 1429,
      "CCCc2ccccc2": 1430,
      "OCc6ccccc6": 1431,
      "CCCCS": 1432,
      "C2CCCC2": 1433,
      "CCOc4cccc5nc": 1434,
      "CC3CS3": 1435,
      "C3CCCCC3C": 1436,
      "ccc1S": 1437,
      "CSc1nc": 1438,
      "3Cc4ccccc4": 1439,
      "c3ncn": 1440,
      "Cc1csc": 1441,
      "ncc2C": 1442,
      "Nc4ccc5": 1443,
      "n5cc": 1444,
      "c1cncnc1": 1445,
      "Cc1onc": 1446,
      "Oc1ccc2CC3N": 1447,
      "Nc1nc2nn": 1448,
      "CCN4CC6CCC6": 1449,
      "4CC5CC": 1450,
      "NCc5ccccc5": 1451,
      "c3ccccc3OC": 1452,
      "3c4ccc": 1453,
      "4CCCCC4": 1454,
      "5CCOCC5": 1455,
      "Oc5ccccc5": 1456,
      "c36": 1457,
      "c3F": 1458,
      "c3s2": 1459,
      "CCCc3ccc": 1460,
      "CCC2C": 1461,
      "CCC1C": 1462,
      "OC7": 1463,
      "OCc2ccc": 1464,
      "CCNc4c5CCCCc5nc6ccccc46": 1465,
      "cc1OCCN2CCCCC2": 1466,
      "cc1OCCN2CCC": 1467,
      "COCCN": 1468,
      "cc25": 1469,
      "C1c2ccccc2C": 1470,
      "c3ccc4C": 1471,
      "C2C1": 1472,
      "cc3c5nc": 1473,
      "C3CCC3": 1474,
      "C34CC5CC": 1475,
      "N1N": 1476,
      "N1c1ccc": 1477,
      "OCCc2ccccc2": 1478,
      "NCCn1c": 1479,
      "CSCc2ccccc2": 1480,
      "nc3c2": 1481,
      "c6c": 1482,
      "1Cc2ccc": 1483,
      "c2nc3ccccc3": 1484,
      "c2nc3ccccc3n2": 1485,
      "CC5CC5": 1486,
      "CCC1C2": 1487,
      "COc1ccccc1N1CCN": 1488,
      "ccc4c": 1489,
      "Nc1ncnc2c1ncn2": 1490,
      "COc1cccc2C": 1491,
      "c3no": 1492,
      "c3cnn4": 1493,
      "OCOc5c4": 1494,
      "CN4CCC3": 1495,
      "c2cc3c": 1496,
      "Nc3nccc": 1497,
      "CCCCOc3ccc4": 1498,
      "Nc2nc3c": 1499,
      "CCN3CC5CC5": 1500,
      "NCCCCCN": 1501,
      "Nc2ccc3c": 1502,
      "c3nc4ccccc4s3": 1503,
      "5CCCCC5": 1504,
      "Cc2cnc3nc": 1505,
      "NCC1": 1506,
      "ncccc2c1": 1507,
      "sc4ncnc": 1508,
      "ccn4": 1509,
      "cccc1F": 1510,
      "CCc": 1511,
      "CCc5ccccc45": 1512,
      "c2O": 1513,
      "OCc1cccc": 1514,
      "cc1CNC": 1515,
      "cccc4C": 1516,
      "CCCCCCOc1ccc": 1517,
      "CCCCn1cc2c": 1518,
      "C1SC": 1519,
      "c5C": 1520,
      "c5cnc": 1521,
      "C3O": 1522,
      "cc4s3": 1523,
      "CN1N": 1524,
      "CN1S": 1525,
      "COC1C": 1526,
      "NCCc2ccccc2": 1527,
      "NCCc3ccc": 1528,
      "NCCc4ccc": 1529,
      "CSCCC": 1530,
      "C4CCCC": 1531,
      "c2cs": 1532,
      "Cc1ccccc1O": 1533,
      "Nc1ccc2C": 1534,
      "c2nccc3": 1535,
      "c2nnn": 1536,
      "c1ccc2ccccc2c1": 1537,
      "ccc4F": 1538,
      "c4ccsc4": 1539,
      "OCCNCC": 1540,
      "Cn1ccc2": 1541,
      "2CCC3": 1542,
      "COc1cc2C": 1543,
      "23CNCC": 1544,
      "Nc2ccnc": 1545,
      "cn2c": 1546,
      "c4nccc": 1547,
      "Nc3ccccc3C": 1548,
      "CC7CC7": 1549,
      "Cc1cncn1C": 1550,
      "Cc1nc2nc": 1551,
      "Cc3cn4": 1552,
      "COc2cccc3C": 1553,
      "N2Cc3ccccc3C": 1554,
      "N1CCCC1C": 1555,
      "c5cc6OCOc6": 1556,
      "c5cc6OCOc6cc25": 1557,
      "c2ccccc2O": 1558,
      "c2ccccc2S": 1559,
      "c3ccccc32": 1560,
      "4CCOCC4": 1561,
      "5CCN": 1562,
      "Nc5cccc": 1563,
      "Oc5cc": 1564,
      "Se": 1565,
      "]%": 1566,
      "oc3": 1567,
      "sc4ccccc34": 1568,
      "CCc2c": 1569,
      "c1Br": 1570,
      "c2OC": 1571,
      "CCCN3CCN": 1572,
      "CCCn1cc2c": 1573,
      "OCc4cc": 1574,
      "OCO2": 1575,
      "Clc1cc2c": 1576,
      "CCN3CCC": 1577,
      "CCN5C": 1578,
      "cc1c2ccccc2": 1579,
      "CC2CC2": 1580,
      "cc3c2": 1581,
      "n2nn": 1582,
      "n2ncc": 1583,
      "nc21": 1584,
      "CC4CCCCC4": 1585,
      "Brc1cccc": 1586,
      "nc3n2": 1587,
      "C4CCC4": 1588,
      "CCC1OC": 1589,
      "COc1ccccc1NC": 1590,
      "OCCN4CCCC4": 1591,
      "c4cnc5": 1592,
      "C6CC6": 1593,
      "COc1cc2ncnc": 1594,
      "c5ccccn5": 1595,
      "3CCCN3C": 1596,
      "C1Oc2cc": 1597,
      "nn3c2": 1598,
      "cc6C": 1599,
      "c4ccc5CNC": 1600,
      "c4ccc5OCOc5c4": 1601,
      "Cc3ccncc3": 1602,
      "c2cccc3nc": 1603,
      "CN2CCCCC2": 1604,
      "COc2ccc3C": 1605,
      "Fc1cccc2": 1606,
      "cccc3Cl": 1607,
      "OCCN2CCOCC2": 1608,
      "c5cnn": 1609,
      "c5ncccc5": 1610,
      "c1c2CCCCc2nc3ccccc13": 1611,
      "NC3CCN": 1612,
      "CCSCC": 1613,
      "c1ccccc1S": 1614,
      "2NC": 1615,
      "7CCN": 1616,
      "Nc3nc": 1617,
      "O5": 1618,
      "Oc2nc": 1619,
      "OCCCCCC": 1620,
      "SCCCCC": 1621,
      "Sc1nc": 1622,
      "o2": 1623,
      "on1": 1624,
      "c1C2": 1625,
      "c3c4CCCC": 1626,
      "CCCc4ccccc4": 1627,
      "CCCN2": 1628,
      "CCCn1c": 1629,
      "OCc3ccc": 1630,
      "OCc5ccccc5": 1631,
      "OC2CCC3": 1632,
      "c4sc": 1633,
      "ncnc12": 1634,
      "CONc1nc": 1635,
      "COc1cnc": 1636,
      "CNCCC": 1637,
      "n1cnc2c": 1638,
      "ccccc2n1": 1639,
      "CC1O": 1640,
      "CC1C2": 1641,
      "CC1CC2C3CCC4": 1642,
      "cc35": 1643,
      "N2CCCC": 1644,
      "N2C1C": 1645,
      "cnn1": 1646,
      "CNC1": 1647,
      "CNC2CCN": 1648,
      "Cc1cccnc1": 1649,
      "COC2": 1650,
      "NCCc5ccc": 1651,
      "ccc1Sc3ccc": 1652,
      "nc3nn": 1653,
      "CCCNc1nc": 1654,
      "c2ncccc2": 1655,
      "c2nnc3c": 1656,
      "N4CCS": 1657,
      "nc4cc": 1658,
      "CCCCN3CCN": 1659,
      "C5C": 1660,
      "C5CC": 1661,
      "C5CC6": 1662,
      "ccc4C": 1663,
      "CCCCCCCCCCC": 1664,
      "NC2CC2": 1665,
      "CCCN1CCN": 1666,
      "c2cncc": 1667,
      "NCCNCC": 1668,
      "CN1CCc2c": 1669,
      "c3cncc": 1670,
      "C6C": 1671,
      "C6C4": 1672,
      "Nc2ccccc2C": 1673,
      "Cc1o": 1674,
      "NC3CCCCC3": 1675,
      "c1cccc2nc": 1676,
      "OC4CCC5": 1677,
      "CCc4ccccc4C3": 1678,
      "Nc1ccc2c": 1679,
      "Cn2nnc3c": 1680,
      "2C3C4CC5": 1681,
      "c3nccs3": 1682,
      "ncnc2s1": 1683,
      "c4nc5ccccc5": 1684,
      "c4noc5cc": 1685,
      "cccnc45": 1686,
      "2C3C4CC5C6C4": 1687,
      "CCS1": 1688,
      "c2ccccc2c": 1689,
      "c3ccccc3COc4ccc": 1690,
      "c4ccccc4OCC": 1691,
      "3c2c1": 1692,
      "Cc1nnc": 1693,
      "Cc4ccccc34": 1694,
      "Nc6ccc": 1695,
      "N6C": 1696,
      "no1": 1697,
      "cccn3n2": 1698,
      "c21": 1699,
      "CCCSC": 1700,
      "CCCN3C": 1701,
      "OCc1cc": 1702,
      "OCc3cccc": 1703,
      "Clc1c": 1704,
      "CCNCC2": 1705,
      "COCC2": 1706,
      "CN4C": 1707,
      "cc2n1": 1708,
      "cc2c1nc": 1709,
      "C1OC2": 1710,
      "c5O": 1711,
      "cc3O": 1712,
      "CCOc1nc": 1713,
      "N2N": 1714,
      "CCCCC6": 1715,
      "C3CCC2": 1716,
      "N1CCCN": 1717,
      "n34": 1718,
      "c2ccsc2": 1719,
      "N3CCc4ccccc4C3": 1720,
      "ccc1N2CCN": 1721,
      "CS2": 1722,
      "nc3cc": 1723,
      "NC1CCN": 1724,
      "Cc1ccccc1S": 1725,
      "c2c1c3ccc": 1726,
      "c5ccccc5F": 1727,
      "nc4ccccc14": 1728,
      "CCC12C": 1729,
      "cc5C": 1730,
      "C5CCCC5": 1731,
      "1CCc2c": 1732,
      "Nc1ncnc": 1733,
      "Nc1ncnc2c1nc": 1734,
      "c2ccc3OCO": 1735,
      "4Cc5ccccc5": 1736,
      "c3nccc": 1737,
      "cc1Cc2cnc": 1738,
      "OCCCN3CCCCC3": 1739,
      "Cc4ccccc4C3": 1740,
      "CCCCCCC3": 1741,
      "n2cnc3ccncc3": 1742,
      "Nc2nnc": 1743,
      "NC4CC4": 1744,
      "COc1ccc2nc": 1745,
      "cc1OCCCN": 1746,
      "CN4CCCC4": 1747,
      "c4ccc5OCC": 1748,
      "CN3CCC2": 1749,
      "CN3CCCCC3": 1750,
      "CCN4CCN": 1751,
      "NCCCCN2CCN": 1752,
      "Cc1nc2c3c": 1753,
      "c4nc5ccccc35": 1754,
      "Cc1cccc2ccccc12": 1755,
      "c2ncccn2": 1756,
      "1C2Cc3ccc": 1757,
      "c1nc2ccccc2s1": 1758,
      "Cc3ccc4ccccc4c3": 1759,
      "Nc4ccc5c": 1760,
      "c3c4CCCCc4nc5ccccc35": 1761,
      "c2ccc3OCOc3c2": 1762,
      "n2cnc3ccncc32": 1763,
      "c1ccccc12": 1764,
      "12CCN": 1765,
      "5C6": 1766,
      "Cc12": 1767,
      "Cc3cccc4ccccc34": 1768,
      "FC1": 1769,
      "Nc2": 1770,
      "Nc4c": 1771,
      "Oc1cc2": 1772,
      "SCCN": 1773,
      "SCC2": 1774,
      "cs3": 1775,
      "CCc12": 1776,
      "c1c2ccccc2": 1777,
      "c1I": 1778,
      "c1oc": 1779,
      "c2N1": 1780,
      "ccccc9": 1781,
      "c3OC": 1782,
      "OC6": 1783,
      "cc1CC": 1784,
      "COS": 1785,
      "CCCCn1cc": 1786,
      "CNc1cccn2nc": 1787,
      "CNc2ccc3C": 1788,
      "cc2OC1": 1789,
      "CC2CC": 1790,
      "C2CCCC": 1791,
      "CCOc3cccc4nc": 1792,
      "ccccc4n3": 1793,
      "COCc1ccc": 1794,
      "ccc1N": 1795,
      "CSCc3ccccc3": 1796,
      "nc3sc": 1797,
      "nc3ccccc23": 1798,
      "c6ccccc46": 1799,
      "c2c1O": 1800,
      "c5ccc6ccccc6c5": 1801,
      "ccc2O": 1802,
      "c2nc3ccc": 1803,
      "nc4c": 1804,
      "CCCCN3CC": 1805,
      "c1ccc2cc3": 1806,
      "Cn1cncn1": 1807,
      "c7c": 1808,
      "c7cc": 1809,
      "c2ccc3OCC": 1810,
      "c4co": 1811,
      "CCC2CCN": 1812,
      "Cc1co": 1813,
      "c2cn3": 1814,
      "cccc2C1": 1815,
      "c3ccc4nc": 1816,
      "CN1CCc2ccc": 1817,
      "COc1cc2OC": 1818,
      "N5CCCCC5": 1819,
      "nn34": 1820,
      "1CCCN1S": 1821,
      "Oc2ccccc2C": 1822,
      "CCN4CCC": 1823,
      "Oc1ccc2c": 1824,
      "Nc1nnnn1": 1825,
      "Clc1ccccc1N2CCN": 1826,
      "c4CCCCc34": 1827,
      "C5CCNCC5": 1828,
      "c3cc4ccccc4cn3": 1829,
      "CNc1ncc2cc": 1830,
      "NCc3cccc": 1831,
      "NCc2cnc3nc": 1832,
      "c3ccccc3c4ccccc4": 1833,
      "c4ccccc4O": 1834,
      "c4ccccc4S": 1835,
      "c4ccccc4n3": 1836,
      "1CO": 1837,
      "1Nc2c": 1838,
      "2c3ccc": 1839,
      "Cc7ccccc7": 1840,
      "Nc3c2": 1841,
      "Nc1cnc": 1842,
      "Nc2sc": 1843,
      "occ5": 1844,
      "oc2cc1O": 1845,
      "CCc1nc": 1846,
      "ccc6C": 1847,
      "c25": 1848,
      "OCc4ccc5ccccc5c4": 1849,
      "CCNCC3": 1850,
      "nc6": 1851,
      "COc4ccccc4": 1852,
      "COc1n": 1853,
      "CNc3ccc": 1854,
      "C1CCCN1": 1855,
      "C1NCCN1": 1856,
      "ccccc16": 1857,
      "n1ccc": 1858,
      "n1cncn1": 1859,
      "c3cccnc23": 1860,
      "C21": 1861,
      "cc3cccnc23": 1862,
      "ccccc37": 1863,
      "c1ccnc": 1864,
      "c1ccsc1": 1865,
      "CCOc1cc2": 1866,
      "CCCCCS": 1867,
      "CCCCCc1ccc": 1868,
      "C3N": 1869,
      "cnccc12": 1870,
      "cc4OC": 1871,
      "n3ncc": 1872,
      "CNCc1ccccc1": 1873,
      "OCCOC": 1874,
      "NCCc1ccccc1": 1875,
      "NCCc3ccccc3": 1876,
      "c6co": 1877,
      "c6ccccc16": 1878,
      "nc14": 1879,
      "nc1O": 1880,
      "n4c": 1881,
      "NC1CC1": 1882,
      "Cc1ccccc1c2ccccc2": 1883,
      "1Cc4ccc": 1884,
      "c5ccc6": 1885,
      "CCOC1": 1886,
      "ccc3O": 1887,
      "SCc2ccccc2": 1888,
      "Cc2cccs2": 1889,
      "ccc46": 1890,
      "CCCCCCCCc1ccc": 1891,
      "Cn1nn": 1892,
      "c7ccccc37": 1893,
      "NC2CCC": 1894,
      "c3c2cc1OC": 1895,
      "NNc1cc": 1896,
      "Oc1ccccc1NC": 1897,
      "OCCCO": 1898,
      "OCCCN2CCN": 1899,
      "NCCCN2CCN": 1900,
      "ccc5c4": 1901,
      "Cc1ccc2cc": 1902,
      "N5CCCC5": 1903,
      "c2nc3n": 1904,
      "c1nc2N": 1905,
      "Cc4cccs4": 1906,
      "c4cccc5cccc": 1907,
      "cc6O": 1908,
      "12CNCC": 1909,
      "12CC3CC": 1910,
      "c3oc4ccc": 1911,
      "c3oc4ccccc4c3": 1912,
      "cccc4c56": 1913,
      "OC2C1O": 1914,
      "Oc1c24": 1915,
      "CN2CCCC2": 1916,
      "CN2CCOCC2": 1917,
      "cccc3F": 1918,
      "c5cocc5": 1919,
      "n3ccnc3": 1920,
      "Nc1ccc2nn": 1921,
      "COc1cccc2c1C": 1922,
      "noc13": 1923,
      "N3CCCC3c3cc": 1924,
      "c2ncnc3scc": 1925,
      "c9ccccc9": 1926,
      "COc3ccccc3OC1": 1927,
      "Cc4ccc5OCC": 1928,
      "c3ncnc4scc": 1929,
      "c2nsnc2": 1930,
      "NC12CC3CC": 1931,
      "OCCN1CCCCC1": 1932,
      "c2csc3C": 1933,
      "c2ncccc2C3CCNCC3": 1934,
      "c6cocc6": 1935,
      "NC6": 1936,
      "c2ccccc2NC": 1937,
      "c3ccccc3S": 1938,
      "+]": 1939,
      "1S": 1940,
      "3C4CCCC": 1941,
      "8CCC9": 1942,
      "Cc23": 1943,
      "Cc5cc": 1944,
      "Nc3": 1945,
      "Nc4n3": 1946,
      "N6CCN": 1947,
      "Oc3cccc": 1948,
      "Oc5ccc": 1949,
      "Oc6ccc7C": 1950,
      "Sc1ccccc1": 1951,
      "SC2C": 1952,
      "ncccc4": 1953,
      "nccc3c2": 1954,
      "on4": 1955,
      "sc3ccccc3c2": 1956,
      "cc9": 1957,
      "ccnc2": 1958,
      "CCc2cccc": 1959,
      "CCc3ccccn3": 1960,
      "CCCc1nc": 1961,
      "CCCN3CCOCC3": 1962,
      "c46": 1963,
      "CCNc1ccc": 1964,
      "COc5ccccc5": 1965,
      "CNCC1": 1966,
      "CN3CC": 1967,
      "C2CC3": 1968,
      "C2CNC": 1969,
      "C2Cc3ccccc3": 1970,
      "C2CCOCC2": 1971,
      "n2sc3ccccc3c2": 1972,
      "N2CCS": 1973,
      "CC3OC1CC": 1974,
      "CCCCCc1cc": 1975,
      "nc2C1": 1976,
      "cc45": 1977,
      "cc4c3": 1978,
      "CC4CCC4": 1979,
      "n3c2c1": 1980,
      "Cc1ccco1": 1981,
      "CN1CCC23": 1982,
      "COC1CC": 1983,
      "CS1": 1984,
      "c6ccccc56": 1985,
      "c3ccsc3": 1986,
      "CCOC4": 1987,
      "c1ncccn1": 1988,
      "ccc24": 1989,
      "ccc3ccc": 1990,
      "ccc3cccc4": 1991,
      "CCC1c2ccc": 1992,
      "Nc2ccc3C": 1993,
      "c1ccc2cc": 1994,
      "c7ncc": 1995,
      "c1cnc2": 1996,
      "4Cc5cc": 1997,
      "cc1OC5CCCC5": 1998,
      "c3nnc": 1999,
      "NNc2c3CCCCc3nc4ccccc24": 2000,
      "c2cnc3": 2001,
      "ncc2Cl": 2002,
      "1CN2C": 2003,
      "C68": 2004,
      "c2nc3cc": 2005,
      "Clc1cccc2": 2006,
      "NC45CC6CC": 2007,
      "nn3c4ccc": 2008,
      "c4cccc5cccnc45": 2009,
      "cc6OC": 2010,
      "23CNC": 2011,
      "cn2c1C": 2012,
      "c2cccc3OC": 2013,
      "CN3CCOCC3": 2014,
      "36N": 2015,
      "cccc34": 2016,
      "Nc3ncc4ccc": 2017,
      "OC4CCN": 2018,
      "OCCCN4CCN": 2019,
      "C1C2CCC3CC1": 2020,
      "CN5CCOCC5": 2021,
      "Oc1cccc2ccccc12": 2022,
      "CCOc2ccccc2OCc3ccccc3": 2023,
      "C1OC2COP": 2024,
      "c4cocc4": 2025,
      "ccnc2cc1OCCCN": 2026,
      "CCSC1": 2027,
      "c1ccccc1NC": 2028,
      "c1ccccc1OCC": 2029,
      "c2ccccc2N1": 2030,
      "1CS": 2031,
      "2N": 2032,
      "4C5CC6": 2033,
      "7ccccc7": 2034,
      "Cn4": 2035,
      "Cn2cc": 2036,
      "Cc7ccc": 2037,
      "Ic1ccc": 2038,
      "NCCCCCC": 2039,
      "N6CCOCC6": 2040,
      "OCC3": 2041,
      "OCCOCCO": 2042,
      "n7": 2043,
      "oc3C": 2044,
      "sc2C1": 2045,
      "c1OCC": 2046,
      "c3O": 2047,
      "c4cc23": 2048,
      "cc15": 2049,
      "cc1c2nnc3c": 2050,
      "cc2NC": 2051,
      "cc2cnccc12": 2052,
      "n1cnc": 2053,
      "n1nnc": 2054,
      "CC1NC": 2055,
      "CC1CCCC": 2056,
      "CC1CC2": 2057,
      "CC2CCN": 2058,
      "C2NCCN2": 2059,
      "c1ccoc1": 2060,
      "CCOc4cc": 2061,
      "N2CC3": 2062,
      "CCCCCOC": 2063,
      "CCCCC1C": 2064,
      "cnc2c1": 2065,
      "N1O": 2066,
      "n3c2n1": 2067,
      "Cc1cccs1": 2068,
      "COCc1cccc": 2069,
      "COC1OC": 2070,
      "NCCc1ccc": 2071,
      "c6c5": 2072,
      "NC1CC": 2073,
      "CCOCc2cccc": 2074,
      "c2ncn3": 2075,
      "CC5CCC4": 2076,
      "nc4N": 2077,
      "CCCCN2C": 2078,
      "c1cc2cc": 2079,
      "c1ccc2ncccc2c1": 2080,
      "SCc2ccc": 2081,
      "CCCCCCCCCCCCCCCC": 2082,
      "c2ccc3cc": 2083,
      "OC1CCCCC1": 2084,
      "c3nnc4": 2085,
