{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Sequence",
    "pretokenizers": [
      {
        "type": "Split",
        "pattern": {
          "String": "(\\[|\\]|Br|Cl|OH|NH|[CNOPSFIHBr]|[0-9]|=|#|-|\\(|\\)|\\+|\\\\|\\/|@|\\.|:|c1|n1|o1|s1)"
        },
        "behavior": "Isolated",
        "invert": false
      },
      {
        "type": "Whitespace"
      }
    ]
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "WordPiece",
    "unk_token": "[UNK]",
    "continuing_subword_prefix": "",
    "max_input_chars_per_word": 100,
    "vocab": {
      "[PAD]": 0,
      "[CLS]": 1,
      "[SEP]": 2,
      "[MASK]": 3,
      "[UNK]": 4,
      "#": 5,
      "%": 6,
      "(": 7,
      ")": 8,
      "+": 9,
      "-": 10,
      "/": 11,
      "0": 12,
      "1": 13,
      "2": 14,
      "3": 15,
      "4": 16,
      "5": 17,
      "6": 18,
      "7": 19,
      "8": 20,
      "9": 21,
      "=": 22,
      "@": 23,
      "A": 24,
      "B": 25,
      "C": 26,
      "F": 27,
      "H": 28,
      "I": 29,
      "N": 30,
      "O": 31,
      "P": 32,
      "S": 33,
      "[": 34,
      "\\": 35,
      "]": 36,
      "c": 37,
      "e": 38,
      "i": 39,
      "l": 40,
      "n": 41,
      "o": 42,
      "r": 43,
      "s": 44,
      "cc": 45,
      "CC": 46,
      "(=": 47,
      "ccc": 48,
      "c1": 49,
      "c2": 50,
      "ccccc": 51,
      "c3": 52,
      "NC": 53,
      "CCC": 54,
      "@@": 55,
      "](": 56,
      "OC": 57,
      "Cl": 58,
      "c1ccc": 59,
      "c4": 60,
      "CCN": 61,
      "cc1": 62,
      "nc": 63,
      "cccc": 64,
      ")[": 65,
      "CO": 66,
      "CCCC": 67,
      "CN": 68,
      ")(": 69,
      ")(=": 70,
      "cc2": 71,
      "c2ccc": 72,
      "C1": 73,
      "ccccc1": 74,
      "n1": 75,
      "c1ccccc1": 76,
      "c3ccc": 77,
      "ccccc2": 78,
      "CC1": 79,
      "c5": 80,
      "CC2": 81,
      "C2": 82,
      "cc3": 83,
      "c2ccccc2": 84,
      "ccccc3": 85,
      "n2": 86,
      "c1cc": 87,
      "c3ccccc3": 88,
      "CCO": 89,
      "c1cccc": 90,
      "N2": 91,
      "ccccc4": 92,
      "CC3": 93,
      "CCCCC": 94,
      "c4ccc": 95,
      ")=": 96,
      "C3": 97,
      "cn": 98,
      "N1": 99,
      "c4ccccc4": 100,
      "nc2": 101,
      "cc4": 102,
      "CC4": 103,
      "n3": 104,
      "CNC": 105,
      "COc1ccc": 106,
      "NS": 107,
      "2C": 108,
      "Cc1ccc": 109,
      "CN1": 110,
      "COC": 111,
      "c2cc": 112,
      "N3": 113,
      "c1c": 114,
      "OCC": 115,
      "c1nc": 116,
      "Br": 117,
      "@@]": 118,
      "NCC": 119,
      "c2cccc": 120,
      "N2CCN": 121,
      "ccc1": 122,
      "CS": 123,
      "nc3": 124,
      "C4": 125,
      "(-": 126,
      "c2c": 127,
      "@]": 128,
      "ccccc5": 129,
      "c6": 130,
      "CCCN": 131,
      "c3cccc": 132,
      "nc1": 133,
      "n4": 134,
      "Oc1ccc": 135,
      ")\\": 136,
      "c3cc": 137,
      "c4cccc": 138,
      "NC1": 139,
      "Cc1ccccc1": 140,
      "c2c1": 141,
      "c5ccccc5": 142,
      "3C": 143,
      "Nc1ccc": 144,
      "1C": 145,
      "c5ccc": 146,
      "CCOC": 147,
      "c1n": 148,
      "c2nc": 149,
      "c3c": 150,
      "NO": 151,
      "CCNC": 152,
      "ccc2": 153,
      "ccc3": 154,
      "c2n": 155,
      "N4": 156,
      "CC5": 157,
      "nc4": 158,
      "Cc1cc": 159,
      "CCC1": 160,
      "CCCCN": 161,
      "cc5": 162,
      "COc1ccccc1": 163,
      "c1cc2": 164,
      "Nc2ccc": 165,
      "c1ccc2": 166,
      "COc1cc": 167,
      "1O": 168,
      "]([": 169,
      "SC": 170,
      "nn": 171,
      "2CC": 172,
      "c1C": 173,
      "C5": 174,
      "Nc3ccc": 175,
      "Cc2ccc": 176,
      "Cc2ccccc2": 177,
      "ccc4": 178,
      "1CC": 179,
      "cc1Cl": 180,
      "c4cc": 181,
      "Nc1nc": 182,
      "Clc1ccc": 183,
      "Cc1cccc": 184,
      "CCCCCCCC": 185,
      "c12": 186,
      "N3CCN": 187,
      "OCCN": 188,
      "Cc3ccccc3": 189,
      "Cn1": 190,
      "c7": 191,
      "CCCCC1": 192,
      "c2ccc3": 193,
      "COc1cccc": 194,
      "Cc3ccc": 195,
      "(\\": 196,
      "c1cn": 197,
      "NC2": 198,
      "s1": 199,
      "CCC4": 200,
      "c3c2": 201,
      "c4c": 202,
      "([": 203,
      "4C": 204,
      "oc": 205,
      "CCCN1": 206,
      "CCC2": 207,
      "N2C": 208,
      "c3nc": 209,
      "cc1OC": 210,
      "2CCC": 211,
      "nc23": 212,
      "CCS": 213,
      "Cc1c": 214,
      "3CCN": 215,
      "Oc2ccc": 216,
      "OC1": 217,
      "nn2": 218,
      "c3n": 219,
      "CN1CCN": 220,
      "cc1C": 221,
      "NN": 222,
      "c2cn": 223,
      "CCCNC": 224,
      "ONC": 225,
      "Fc1ccc": 226,
      "NCCN": 227,
      "sc": 228,
      "cccc2": 229,
      "COc1ccccc1N2CCN": 230,
      "CCCCC2": 231,
      "CC6": 232,
      "Oc1ccccc1": 233,
      "OCCC": 234,
      "NCCC": 235,
      "n2cc": 236,
      "N2CCC": 237,
      "Cc4ccccc4": 238,
      "c1Cl": 239,
      "c3ccc4": 240,
      "CN1C": 241,
      "n1cc": 242,
      "CCOCCO": 243,
      "ncc2": 244,
      "CCCCCCC": 245,
      "s2": 246,
      "ccc5": 247,
      "C1C": 248,
      "CCOCC4": 249,
      "1CN": 250,
      "CN1CC": 251,
      "2O": 252,
      "cn1": 253,
      "Nc1ccccc1": 254,
      "ccccc6": 255,
      "c3cn": 256,
      "FC": 257,
      "c23": 258,
      "Nc1cccc": 259,
      "c1OC": 260,
      "Cc1ccc2": 261,
      "CCCCC4": 262,
      "CCCCCC": 263,
      "3O": 264,
      "nc12": 265,
      "c1ncc": 266,
      "ccccc34": 267,
      "3CC": 268,
      "C6": 269,
      "s3": 270,
      "COc1cc2": 271,
      "Nc4ccc": 272,
      "O2": 273,
      "N5": 274,
      "CCCC2": 275,
      "c5cc": 276,
      "CCCC1": 277,
      "Nc1cc": 278,
      "c2nc3": 279,
      "C2C": 280,
      "CCCCNC": 281,
      "CCOc1ccc": 282,
      "N1C": 283,
      "nn1": 284,
      "c6ccc": 285,
      "1NC": 286,
      "cnc": 287,
      "Clc1cccc": 288,
      "c5cccc": 289,
      "O1": 290,
      "c1nc2": 291,
      "CCN1": 292,
      "c1c2": 293,
      "Oc1cccc": 294,
      "Cc4ccc": 295,
      "Cc2c": 296,
      "c6ccccc6": 297,
      "c1ccc2c": 298,
      "n2cn": 299,
      "c4o": 300,
      "N4CCOCC4": 301,
      "2CCN": 302,
      "Nc2n": 303,
      "ccccc12": 304,
      "3CCC": 305,
      "ncc": 306,
      "Nc2ccccc2": 307,
      "cc12": 308,
      "3N": 309,
      "n5": 310,
      "s4": 311,
      "nc5": 312,
      "CCCCC3": 313,
      "NNC": 314,
      "N1CCC": 315,
      "nH": 316,
      "NC4": 317,
      "CCCC4": 318,
      "COc1ccc2": 319,
      "c34": 320,
      "C1O": 321,
      "CC4CC4": 322,
      "C2CCC": 323,
      "n3nc": 324,
      "4O": 325,
      "ccc12": 326,
      "c4c3": 327,
      "ccccc45": 328,
      "nn3": 329,
      "c1O": 330,
      "c4cccc5": 331,
      "4CC": 332,
      "1OC": 333,
      "c2n1": 334,
      "cc1O": 335,
      "ccccc23": 336,
      "cc6": 337,
      "cc2c": 338,
      "c3nc4": 339,
      "c1cnc": 340,
      "cc2C": 341,
      "c5o": 342,
      "N1CCN": 343,
      "N3CCC": 344,
      "Oc2cc": 345,
      "nc2N": 346,
      "12": 347,
      "N4CCN": 348,
      "CCC5": 349,
      "N3C": 350,
      "n2cnc3c": 351,
      "c4occc4": 352,
      "c2o": 353,
      "OCO": 354,
      "c8": 355,
      "CCCO": 356,
      "c3o": 357,
      "CCOCC3": 358,
      "c5occc5": 359,
      "C1CC": 360,
      "CN4": 361,
      "c2ccc3nc": 362,
      "Nc2nc": 363,
      "CCn1": 364,
      "1CCCN1": 365,
      "23": 366,
      "CN1CCC": 367,
      "c3cccc4": 368,
      "Cc2cnc": 369,
      "o1": 370,
      "n4n3": 371,
      "Nc2cc": 372,
      "c4nc": 373,
      "C2CCN": 374,
      "CCOCC2": 375,
      "cccc4": 376,
      "c4ccc5": 377,
      "CNCC": 378,
      "c2Cl": 379,
      "@@](": 380,
      "Oc1ccc2C": 381,
      "cn3": 382,
      "Oc2ccccc2": 383,
      "OC2": 384,
      "cn2": 385,
      "n4nc": 386,
      "CCCC3": 387,
      "cc23": 388,
      "5C": 389,
      "c2ccccc21": 390,
      "N1CC": 391,
      "@](": 392,
      "Cc3cc": 393,
      "Oc1c2": 394,
      "c3C": 395,
      "c2C1": 396,
      "c4n": 397,
      "n2nc": 398,
      "c1cc2c": 399,
      "ncc3": 400,
      "CCC3": 401,
      "CC1CC": 402,
      "c2cccc3": 403,
      "c2cc3": 404,
      "cc2Cl": 405,
      "Oc3ccc": 406,
      "c2ccncc2": 407,
      "c3ccccn3": 408,
      "Cc1": 409,
      "C3CCN": 410,
      "ccc34": 411,
      "OCCCN": 412,
      "C1CCC": 413,
      "CCN1C": 414,
      "CN2": 415,
      "nc34": 416,
      "c2cc1OC": 417,
      "nc2c1nc": 418,
      "Cc1ccc2c": 419,
      "Cc2cccc": 420,
      "Nc3nc4": 421,
      "Cc1nc": 422,
      "Nc3ccccc3": 423,
      "COc2ccc": 424,
      "Oc3ccccc3": 425,
      "C1NC": 426,
      "CCOCC5": 427,
      "O3": 428,
      "cc7": 429,
      "nc24": 430,
      "Fc1cccc": 431,
      "CCl": 432,
      "NC3": 433,
      "CN3": 434,
      "c5ccccc45": 435,
      "c2C": 436,
      "Clc1cc": 437,
      "c45": 438,
      "c1nnc": 439,
      "10": 440,
      "36": 441,
      "CCN3": 442,
      "ccccc24": 443,
      "c5nc": 444,
      "Oc1c25": 445,
      "OCCCC": 446,
      "c4ccccc34": 447,
      "Oc1cc": 448,
      "C3CCC4": 449,
      "CSC": 450,
      "Nc3nc4c": 451,
      "56": 452,
      "CCN3CCN": 453,
      "cccc3": 454,
      "CC7": 455,
      "c1ccccc1C": 456,
      "ccccc4c3": 457,
      "ccc3c2": 458,
      "c1cncc": 459,
      "NCCCC": 460,
      "OC3": 461,
      "C3C": 462,
      "5CCCC": 463,
      "cccn4n3": 464,
      "c7ccc": 465,
      "c5c": 466,
      "cc3C": 467,
      "n2c": 468,
      "ccc1O": 469,
      "nc2c1ncn2": 470,
      "1CCN": 471,
      "N2CC": 472,
      "CCc1ccc": 473,
      "c5c4": 474,
      "Cn1cc": 475,
      "ccc23": 476,
      "CCN4": 477,
      "cc1F": 478,
      "N3CCOCC3": 479,
      "Nc3cccc": 480,
      "ON": 481,
      "OCC1": 482,
      "C1OC": 483,
      "CC1CCCCC1": 484,
      "Cc5ccccc5": 485,
      "Oc1ccc2": 486,
      "c3ccccc23": 487,
      "c3cccnc3": 488,
      "COCC": 489,
      "CCOP": 490,
      "sc1": 491,
      "c3cc4": 492,
      "OCc2ccccc2": 493,
      "CCCCC5": 494,
      "ccccc8": 495,
      "12C": 496,
      "3CN": 497,
      "Nc3n": 498,
      "OCc1ccccc1": 499,
      "ccccc13": 500,
      "c1cccc2": 501,
      "n3cn": 502,
      "ncc1": 503,
      "c4cn": 504,
      "n1C": 505,
      "c4cccnc4": 506,
      "6C": 507,
      "SCC": 508,
      "OC4": 509,
      "CCN3C": 510,
      "ccccc2c1": 511,
      "C2CC": 512,
      "CCOCC1": 513,
      "c4cccs4": 514,
      "Nc1c": 515,
      "CCc4ccccc4": 516,
      "NCc1ccccc1": 517,
      "COc1c": 518,
      "n3cc": 519,
      "N4CCC": 520,
      "c2cnc3nc": 521,
      "cc13": 522,
      "COP": 523,
      "ccc2c1": 524,
      "CCC1n1cc": 525,
      "ccccc7": 526,
      "c3ccc4ccccc4c3": 527,
      "OCc3ccccc3": 528,
      "CNS": 529,
      "cc3Cl": 530,
      "c3occc3": 531,
      "1CCC": 532,
      "CCOc1cc": 533,
      "COc1ccc2C": 534,
      "C4CC4": 535,
      "c3ccncc3": 536,
      "n3cnc4c": 537,
      "c13": 538,
      "c1cccnc1": 539,
      "nc2c1": 540,
      "c4ccccn4": 541,
      "Nc1ccc2": 542,
      "c8ccccc8": 543,
      "Cc1n": 544,
      "Nc2cccc": 545,
      "C1CN": 546,
      "\\[": 547,
      "N2CCOCC2": 548,
      "CCCCO": 549,
      "Cn2": 550,
      "Nc1n": 551,
      "Nc2nc3": 552,
      "c2ccccc12": 553,
      "c2cccn3nc": 554,
      "C1N": 555,
      "ccccc14": 556,
      "CNCc1cc": 557,
      "COc1cccc2": 558,
      "c2ccccc2n1": 559,
      "cc4F": 560,
      "CCCl": 561,
      "OS": 562,
      "CCCCCCCCC": 563,
      "Cn1cc2c": 564,
      "Nc1nc2": 565,
      "OCCO": 566,
      "no": 567,
      "n1c": 568,
      "Nc4cccc": 569,
      "CC2C": 570,
      "cc4C": 571,
      "CCNC2": 572,
      "c2ncc": 573,
      "cccc2n1": 574,
      "N2CCC3": 575,
      "CCN2": 576,
      "c7ccccc7": 577,
      "1CCCN1CC": 578,
      "Cc4cc": 579,
      "c3n2": 580,
      "c56": 581,
      "ccc45": 582,
      "(/": 583,
      "35": 584,
      "nnc": 585,
      "CCc1ccccc1": 586,
      "c4ccccc24": 587,
      "CN2C": 588,
      "Nc3ccc4": 589,
      "N5CCOCC5": 590,
      "c3cccc4ccccc34": 591,
      "OCCCN4": 592,
      "c3ccccc13": 593,
      "C2O": 594,
      "ccccc3c2": 595,
      "ccc1Oc2ccc": 596,
      "Cn1c": 597,
      "NCCN2": 598,
      "sc12": 599,
      "CCc3ccccc3": 600,
      "c2oc": 601,
      "NCc2ccc": 602,
      "C1C2CCC": 603,
      "ccccc46": 604,
      "N1CC1": 605,
      "c3ccnc": 606,
      "12CC": 607,
      "2CN": 608,
      "Oc2c": 609,
      "c1cccn2nc": 610,
      "cc2c1": 611,
      "N5CCN": 612,
      "2CCNC2": 613,
      "7C": 614,
      "occc": 615,
      "OC2C": 616,
      "ccccc5c4": 617,
      "CCN1CCN": 618,
      "Nc2c": 619,
      "c1F": 620,
      "COC1": 621,
      "2C3": 622,
      "S1": 623,
      "ncc4": 624,
      "C1CC1": 625,
      "CCOc1ccccc1": 626,
      "CCNC3": 627,
      "ccc2n1": 628,
      "c1cnccc1": 629,
      "Cc1cnc": 630,
      "CCN3CC5": 631,
      "2CNC": 632,
      "34": 633,
      "Oc2c1": 634,
      "c3nn": 635,
      "NCc3ccc": 636,
      "C1CCC2": 637,
      "ccccc35": 638,
      "cc4Cl": 639,
      "Cc5ccc": 640,
      "Si": 641,
      "c4c5": 642,
      "c1ccncc1": 643,
      "nc3c": 644,
      "OCCN2": 645,
      "c3ncc": 646,
      "Oc1ccccc1N2CCN": 647,
      "Nc4ccccc4": 648,
      "Oc4ccc": 649,
      "ccn1": 650,
      "CCc2ccccc2": 651,
      "c2c3": 652,
      "c4ccccc14": 653,
      "CC1CN": 654,
      "c3ccccc3C": 655,
      "nc13": 656,
      "ccc21": 657,
      "CCCN1C": 658,
      "Nc2ncc": 659,
      "COc1ccc2c": 660,
      "OP": 661,
      "CC8": 662,
      "CON": 663,
      "cc3F": 664,
      "c3cnc": 665,
      "N3CCNCC3": 666,
      "3CCNC3": 667,
      "NCCCCC": 668,
      "c1ccccn1": 669,
      "c4ccccc4OC": 670,
      "c3c2C": 671,
      "c5nc6": 672,
      "C7": 673,
      "NCC2": 674,
      "NCCO": 675,
      "C2CCC1": 676,
      "N2CC2": 677,
      "NCCCCN": 678,
      "c2occc2": 679,
      "1CCCN1CCc2ccc3nc": 680,
      "13": 681,
      "Oc1c": 682,
      "CCC6": 683,
      "CCCOC": 684,
      "cc2F": 685,
      "ccc1OC": 686,
      "n4cc": 687,
      "NOC": 688,
      "cccc1": 689,
      "c1N": 690,
      "c4C": 691,
      "CCO2": 692,
      "C3CC": 693,
      "5CC6": 694,
      "Cc1nc2": 695,
      "Sc2ccc": 696,
      "CCCCc5nc6": 697,
      "CN2CCC": 698,
      "CC21C": 699,
      "C2CC2": 700,
      "CNC3": 701,
      "NCCc2ccc": 702,
      "NCCN1": 703,
      "CCOCCOCCOCCO": 704,
      "c4c5CCCCc5nc6": 705,
      "ncnc2": 706,
      "c3cccs3": 707,
      "c2ccccc2C": 708,
      "c3ccccc3C2": 709,
      "C3CCC": 710,
      "ccc1C": 711,
      "c6occc": 712,
      "c6occc6": 713,
      "4CCCC": 714,
      "ccc2C": 715,
      "CC2C3CCC4": 716,
      "C4C": 717,
      "Cc3cn": 718,
      "onc": 719,
      "c35": 720,
      "cc1S": 721,
      "n3c": 722,
      "n2ccnc2": 723,
      "CCc2c1": 724,
      "CN3C": 725,
      "c4ccccc4Cl": 726,
      "c5cccnc5": 727,
      "Cc1ccc2ccccc2c1": 728,
      "CCN1CCC": 729,
      "CC1CCCCC1n1cc": 730,
      "34C": 731,
      "Oc4ccccc4": 732,
      "NCc1ccc": 733,
      "Clc1ccccc1": 734,
      "CN5": 735,
      "CNc1nc": 736,
      "CC12CCC": 737,
      "C2CN": 738,
      "36O": 739,
      ")-": 740,
      "NCCCN": 741,
      "COc3ccc": 742,
      "cc3c": 743,
      "C3CCCCC3": 744,
      "c4ccccc4C": 745,
      "c2ccccn2": 746,
      "nc1C": 747,
      "c4ccncc4": 748,
      "CCn1c": 749,
      "c4c5CCCCc5nc6ccccc46": 750,
      "1N": 751,
      "1c3ccc": 752,
      "cccc1C": 753,
      "C12": 754,
      "C1CCN": 755,
      "c3ccccc3n2": 756,
      "nc3N": 757,
      "2CCCC": 758,
      "Nc3cc": 759,
      "s5": 760,
      "CCc2ccc": 761,
      "c2cc1": 762,
      "c1ccccc1O": 763,
      "nc2C": 764,
      "CC4CC": 765,
      "N3CCCC3": 766,
      "Cc1ccccc1C": 767,
      "c2cccc3ccccc23": 768,
      "5CCCC5": 769,
      "Cc1cc2": 770,
      "Fc1ccc2c": 771,
      "S2": 772,
      "cs2": 773,
      "nn4": 774,
      "ncnc": 775,
      "cc21": 776,
      "cc34": 777,
      "Cc6": 778,
      "CCc2cc": 779,
      "n1nn": 780,
      "CC3CC": 781,
      "C4CCCCC4": 782,
      "c2cnc": 783,
      "Oc1cccc2": 784,
      "4Oc5c": 785,
      "Nc3ccc4c": 786,
      "5CC6CC": 787,
      "Cc3c": 788,
      "Cc1ncc": 789,
      "Nc4cc": 790,
      "SCCC": 791,
      "c2cc1O": 792,
      "NCc3ccccc3": 793,
      "CN2CCN": 794,
      "cc2O": 795,
      "c1ccccc1Cl": 796,
      "C2OC": 797,
      "Nc2ccc3": 798,
      "COc1cc2c": 799,
      "c4cccc5ccccc45": 800,
      "c2onc": 801,
      "c4ccc5ccccc5c4": 802,
      "Cc1cn": 803,
      "Nc1ncc": 804,
      "c3C2": 805,
      "CCCCOC": 806,
      "n1cc2c": 807,
      "CC1CCC": 808,
      "C3CC3": 809,
      "N3CC": 810,
      "CCCCNc1ncc": 811,
      "C5CC5": 812,
      "CCN3CC5CCC5": 813,
      "2CO": 814,
      "Sc3ccc": 815,
      "c4nc5": 816,
      "cnc2n1": 817,
      "n3n2": 818,
      "c4cnc": 819,
      "NCCN3": 820,
      "1CCCN1C": 821,
      "CCN4CC6": 822,
      "1OCC": 823,
      "Oc23": 824,
      "ccn2": 825,
      "CCc1cccc": 826,
      "c3oc": 827,
      "c4cc5": 828,
      "CCNc1nc": 829,
      "CCCCCC1": 830,
      "CC1c3ccc": 831,
      "C23": 832,
      "c2ccccc2Cl": 833,
      "c2ccccc2C1": 834,
      "N2CCCCC2": 835,
      "nc2n1": 836,
      "c2ccnc": 837,
      "ccc1Cl": 838,
      "c2no": 839,
      "CCCCN3C": 840,
      "Cc2ccc3": 841,
      "C3CCNCC3": 842,
      "Cn2cnc": 843,
      "Cc2cc": 844,
      "c2sc": 845,
      "Clc1ccc2": 846,
      "CCN5": 847,
      "ncnc23": 848,
      "N1CCCC1": 849,
      "nc2cc": 850,
      "CNC2": 851,
      "OCCF": 852,
      "c2noc": 853,
      "c2ccc3ccccc3c2": 854,
      "CCSSC": 855,
      "COc1ccc2cc": 856,
      "SN": 857,
      "nc2ccccc2n1": 858,
      "scc": 859,
      "CCCc1c": 860,
      "CCNCC4": 861,
      "CCCC5": 862,
      "CCCCCCC1": 863,
      "cc2s1": 864,
      "CC2CCCCC2": 865,
      "n23": 866,
      "n2ccc": 867,
      "N3CCCCC3": 868,
      "1CNC": 869,
      "OCCCCC": 870,
      "Oc2cccc": 871,
      "CCCS": 872,
      "NCCNC": 873,
      "NC1C": 874,
      "c2ncnc": 875,
      "Cc1cccc2": 876,
      "c2ccc3c": 877,
      "n5nc": 878,
      "noc2c1": 879,
      ")/": 880,
      "2OC": 881,
      "Cc3cccc": 882,
      "sc2c1": 883,
      "CCSC": 884,
      "ClC": 885,
      "c4Cl": 886,
      "c5cn": 887,
      "c3ccccc3C1": 888,
      "c2ncnc3": 889,
      "CCCCN1": 890,
      "cccc23": 891,
      "nc2c1ncn2C1OC": 892,
      "3CCCC": 893,
      "c9": 894,
      "CCc4cc": 895,
      "NCc4ccc": 896,
      "ncnc3": 897,
      "COc2cccc": 898,
      "CCCCCCN": 899,
      "CN3CCN": 900,
      "cc24": 901,
      "CC1C": 902,
      "c5ccccc35": 903,
      "CCCCCN1C": 904,
      "N2CCNCC2": 905,
      "Oc1ccccc1C": 906,
      "OCC1OC": 907,
      "OCCN2CCCCC2": 908,
      "4CCN": 909,
      "7CC7": 910,
      "Cc2c1": 911,
      "CCn1cc": 912,
      "c3n1": 913,
      "NCc4cccc": 914,
      "COc2ccccc2": 915,
      "COc1ncc": 916,
      "n2C": 917,
      "N3CCCN": 918,
      "c3csc": 919,
      "CCCN1CCC": 920,
      "cccc4Cl": 921,
      "6ccccc6": 922,
      "NOCC": 923,
      "Nc3c": 924,
      "OCC2": 925,
      "OC5": 926,
      "OCOC": 927,
      "c4n3": 928,
      "c4ncc": 929,
      "cccc2C": 930,
      "COc3ccccc3": 931,
      "COc4ccc": 932,
      "CCCCOc1ccc": 933,
      "c2ccccc2c1": 934,
      "nc4ccccc34": 935,
      "COc1ccccc1C": 936,
      "c1ccc2nc": 937,
      "CN4CCN": 938,
      "N1CCc2nc": 939,
      "Cc1oc": 940,
      "CCc1cc": 941,
      "ccc3C": 942,
      "c1NC": 943,
      "c1sc": 944,
      "NCc5cccc": 945,
      "CCCc1ccccc1": 946,
      "c4CCCC": 947,
      "cc1OCC": 948,
      "CN2CC": 949,
      "cc2c3nc": 950,
      "N2CCCC2": 951,
      "CCCCCNC": 952,
      "c2nccc": 953,
      "C5CCN": 954,
      "2CCCN2C": 955,
      "OCOc4c3": 956,
      "c2c3CCCC": 957,
      "n4ccnc4": 958,
      "n1nnc2ccccc21": 959,
      "Cc4cccc": 960,
      "NCCC1": 961,
      "O4": 962,
      "n6": 963,
      "sc5ccccc45": 964,
      "CCc1c": 965,
      "c1ccc2C": 966,
      "CCN4CC": 967,
      "c2ccc3C": 968,
      "c2cccs2": 969,
      "C1c2ccccc2": 970,
      "n1nc": 971,
      "CC3CCCCC3": 972,
      "N1CCCCC1": 973,
      "nc2c": 974,
      "NC1CCC": 975,
      "NC1CCCCC1": 976,
      "N4C": 977,
      "nn5": 978,
      "OCCN2CCC": 979,
      "nn23": 980,
      "NCCCN3CCN": 981,
      "nn12": 982,
      "c4cccc5nc": 983,
      "CN4CCCCC4": 984,
      "c2c3CCCCc3nc4": 985,
      "3NC": 986,
      "Fc1ccccc1": 987,
      "SC1": 988,
      "co": 989,
      "sc2": 990,
      "sc3": 991,
      "c1CN": 992,
      "NC5": 993,
      "NCc2ccccc2": 994,
      "CCCOc2ccc": 995,
      "OCc1ccc": 996,
      "OC3C": 997,
      "cccc5": 998,
      "n1nc2ccccc2n1": 999
    }
  }
}