{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 5,
      "content": "C1OC1",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 6,
      "content": "C2OC2",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 7,
      "content": "C3OC3",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 8,
      "content": "C4OC4",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 9,
      "content": "C5OC5",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10,
      "content": "NC",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 11,
      "content": "CCS",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 12,
      "content": "C=C(C=O)",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 13,
      "content": "c1ccccc1",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 14,
      "content": "c1cccnc1",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 15,
      "content": "c1ccc[nH]cc1",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 16,
      "content": "c2ccccc2",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 17,
      "content": "c2cccnc2",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 18,
      "content": "c2ccc[nH]cc2",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 19,
      "content": "c3ccccc3",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 20,
      "content": "c3cccnc3",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 21,
      "content": "c3ccc[nH]cc3",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 22,
      "content": "c4ccccc4",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 23,
      "content": "c4cccnc4",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 24,
      "content": "c4ccc[nH]cc4",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Sequence",
    "pretokenizers": [
      {
        "type": "Split",
        "pattern": {
          "String": "(\\[|\\]|Br|Cl|OH|NH|[CNOPSFIHBr]|[0-9]|=|#|-|\\(|\\)|\\+|\\\\|\\/|@|\\.|:|c1|n1|o1|s1)"
        },
        "behavior": "Isolated",
        "invert": false
      },
      {
        "type": "Whitespace"
      }
    ]
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "WordPiece",
    "unk_token": "[UNK]",
    "continuing_subword_prefix": "",
    "max_input_chars_per_word": 100,
    "vocab": {
      "[PAD]": 0,
      "[CLS]": 1,
      "[SEP]": 2,
      "[MASK]": 3,
      "[UNK]": 4,
      "C1OC1": 5,
      "C2OC2": 6,
      "C3OC3": 7,
      "C4OC4": 8,
      "C5OC5": 9,
      "NC": 10,
      "CCS": 11,
      "C=C(C=O)": 12,
      "c1ccccc1": 13,
      "c1cccnc1": 14,
      "c1ccc[nH]cc1": 15,
      "c2ccccc2": 16,
      "c2cccnc2": 17,
      "c2ccc[nH]cc2": 18,
      "c3ccccc3": 19,
      "c3cccnc3": 20,
      "c3ccc[nH]cc3": 21,
      "c4ccccc4": 22,
      "c4cccnc4": 23,
      "c4ccc[nH]cc4": 24,
      "#": 25,
      "%": 26,
      "(": 27,
      ")": 28,
      "+": 29,
      "-": 30,
      "/": 31,
      "0": 32,
      "1": 33,
      "2": 34,
      "3": 35,
      "4": 36,
      "5": 37,
      "6": 38,
      "7": 39,
      "8": 40,
      "9": 41,
      "=": 42,
      "@": 43,
      "A": 44,
      "B": 45,
      "C": 46,
      "F": 47,
      "H": 48,
      "I": 49,
      "N": 50,
      "O": 51,
      "P": 52,
      "S": 53,
      "[": 54,
      "\\": 55,
      "]": 56,
      "c": 57,
      "e": 58,
      "i": 59,
      "l": 60,
      "n": 61,
      "o": 62,
      "r": 63,
      "s": 64,
      "cc": 65,
      "CC": 66,
      "(=": 67,
      "ccc": 68,
      "c1": 69,
      "c2": 70,
      "ccccc": 71,
      "c3": 72,
      "CCC": 73,
      "@@": 74,
      "](": 75,
      "OC": 76,
      "Cl": 77,
      "c1ccc": 78,
      "c4": 79,
      "CCN": 80,
      "cc1": 81,
      "nc": 82,
      "cccc": 83,
      ")[": 84,
      "CO": 85,
      "CCCC": 86,
      "CN": 87,
      ")(": 88,
      ")(=": 89,
      "cc2": 90,
      "c2ccc": 91,
      "C1": 92,
      "ccccc1": 93,
      "n1": 94,
      "c3ccc": 95,
      "ccccc2": 96,
      "CC1": 97,
      "c5": 98,
      "CC2": 99,
      "C2": 100,
      "cc3": 101,
      "ccccc3": 102,
      "n2": 103,
      "c1cc": 104,
      "CCO": 105,
      "c1cccc": 106,
      "N2": 107,
      "ccccc4": 108,
      "CC3": 109,
      "CCCCC": 110,
      "c4ccc": 111,
      ")=": 112,
      "C3": 113,
      "cn": 114,
      "N1": 115,
      "nc2": 116,
      "cc4": 117,
      "CC4": 118,
      "n3": 119,
      "CNC": 120,
      "COc1ccc": 121,
      "NS": 122,
      "2C": 123,
      "Cc1ccc": 124,
      "CN1": 125,
      "COC": 126,
      "c2cc": 127,
      "N3": 128,
      "c1c": 129,
      "OCC": 130,
      "c1nc": 131,
      "Br": 132,
      "@@]": 133,
      "NCC": 134,
      "c2cccc": 135,
      "N2CCN": 136,
      "ccc1": 137,
      "CS": 138,
      "nc3": 139,
      "C4": 140,
      "(-": 141,
      "c2c": 142,
      "@]": 143,
      "ccccc5": 144,
      "c6": 145,
      "CCCN": 146,
      "c3cccc": 147,
      "nc1": 148,
      "n4": 149,
      "Oc1ccc": 150,
      ")\\": 151,
      "c3cc": 152,
      "c4cccc": 153,
      "NC1": 154,
      "Cc1ccccc1": 155,
      "c2c1": 156,
      "c5ccccc5": 157,
      "3C": 158,
      "Nc1ccc": 159,
      "1C": 160,
      "c5ccc": 161,
      "CCOC": 162,
      "c1n": 163,
      "c2nc": 164,
      "c3c": 165,
      "NO": 166,
      "CCNC": 167,
      "ccc2": 168,
      "ccc3": 169,
      "c2n": 170,
      "N4": 171,
      "CC5": 172,
      "nc4": 173,
      "Cc1cc": 174,
      "CCC1": 175,
      "CCCCN": 176,
      "cc5": 177,
      "COc1ccccc1": 178,
      "c1cc2": 179,
      "Nc2ccc": 180,
      "c1ccc2": 181,
      "COc1cc": 182,
      "1O": 183,
      "]([": 184,
      "SC": 185,
      "nn": 186,
      "2CC": 187,
      "c1C": 188,
      "C5": 189,
      "Nc3ccc": 190,
      "Cc2ccc": 191,
      "Cc2ccccc2": 192,
      "ccc4": 193,
      "1CC": 194,
      "cc1Cl": 195,
      "c4cc": 196,
      "Nc1nc": 197,
      "Clc1ccc": 198,
      "Cc1cccc": 199,
      "CCCCCCCC": 200,
      "c12": 201,
      "N3CCN": 202,
      "OCCN": 203,
      "Cc3ccccc3": 204,
      "Cn1": 205,
      "c7": 206,
      "CCCCC1": 207,
      "c2ccc3": 208,
      "COc1cccc": 209,
      "Cc3ccc": 210,
      "(\\": 211,
      "NC2": 212,
      "c1cn": 213,
      "s1": 214,
      "CCC4": 215,
      "c3c2": 216,
      "c4c": 217,
      "([": 218,
      "4C": 219,
      "oc": 220,
      "CCCN1": 221,
      "CCC2": 222,
      "N2C": 223,
      "c3nc": 224,
      "cc1OC": 225,
      "2CCC": 226,
      "nc23": 227,
      "Cc1c": 228,
      "3CCN": 229,
      "Oc2ccc": 230,
      "OC1": 231,
      "nn2": 232,
      "c3n": 233,
      "CN1CCN": 234,
      "cc1C": 235,
      "NN": 236,
      "c2cn": 237,
      "CCCNC": 238,
      "ONC": 239,
      "Fc1ccc": 240,
      "NCCN": 241,
      "sc": 242,
      "cccc2": 243,
      "COc1ccccc1N2CCN": 244,
      "CCCCC2": 245,
      "CC6": 246,
      "Oc1ccccc1": 247,
      "OCCC": 248,
      "NCCC": 249,
      "n2cc": 250,
      "N2CCC": 251,
      "Cc4ccccc4": 252,
      "c1Cl": 253,
      "c3ccc4": 254,
      "CN1C": 255,
      "n1cc": 256,
      "CCOCCO": 257,
      "ncc2": 258,
      "CCCCCCC": 259,
      "s2": 260,
      "ccc5": 261,
      "C1C": 262,
      "CCOCC4": 263,
      "1CN": 264,
      "CN1CC": 265,
      "2O": 266,
      "cn1": 267,
      "Nc1ccccc1": 268,
      "ccccc6": 269,
      "c3cn": 270,
      "FC": 271,
      "c23": 272,
      "Nc1cccc": 273,
      "c1OC": 274,
      "Cc1ccc2": 275,
      "CCCCC4": 276,
      "CCCCCC": 277,
      "3O": 278,
      "nc12": 279,
      "c1ncc": 280,
      "ccccc34": 281,
      "3CC": 282,
      "C6": 283,
      "s3": 284,
      "COc1cc2": 285,
      "Nc4ccc": 286,
      "O2": 287,
      "N5": 288,
      "CCCC2": 289,
      "c5cc": 290,
      "CCCC1": 291,
      "Nc1cc": 292,
      "c2nc3": 293,
      "C2C": 294,
      "CCCCNC": 295,
      "CCOc1ccc": 296,
      "N1C": 297,
      "nn1": 298,
      "c6ccc": 299,
      "1NC": 300,
      "cnc": 301,
      "Clc1cccc": 302,
      "c5cccc": 303,
      "O1": 304,
      "c1nc2": 305,
      "CCN1": 306,
      "c1c2": 307,
      "Oc1cccc": 308,
      "Cc4ccc": 309,
      "Cc2c": 310,
      "c6ccccc6": 311,
      "c1ccc2c": 312,
      "n2cn": 313,
      "c4o": 314,
      "N4CCOCC4": 315,
      "2CCN": 316,
      "Nc2n": 317,
      "ccccc12": 318,
      "3CCC": 319,
      "ncc": 320,
      "Nc2ccccc2": 321,
      "cc12": 322,
      "3N": 323,
      "n5": 324,
      "s4": 325,
      "nc5": 326,
      "CCCCC3": 327,
      "NNC": 328,
      "N1CCC": 329,
      "NC4": 330,
      "nH": 331,
      "CCCC4": 332,
      "COc1ccc2": 333,
      "c34": 334,
      "C1O": 335,
      "CC4CC4": 336,
      "C2CCC": 337,
      "n3nc": 338,
      "4O": 339,
      "ccc12": 340,
      "c4c3": 341,
      "ccccc45": 342,
      "nn3": 343,
      "c1O": 344,
      "c4cccc5": 345,
      "4CC": 346,
      "1OC": 347,
      "c2n1": 348,
      "cc1O": 349,
      "ccccc23": 350,
      "cc6": 351,
      "cc2c": 352,
      "c3nc4": 353,
      "c1cnc": 354,
      "cc2C": 355,
      "c5o": 356,
      "N1CCN": 357,
      "N3CCC": 358,
      "Oc2cc": 359,
      "nc2N": 360,
      "12": 361,
      "N4CCN": 362,
      "CCC5": 363,
      "N3C": 364,
      "n2cnc3c": 365,
      "c4occc4": 366,
      "c2o": 367,
      "OCO": 368,
      "c8": 369,
      "CCCO": 370,
      "c3o": 371,
      "CCOCC3": 372,
      "c5occc5": 373,
      "C1CC": 374,
      "CN4": 375,
      "c2ccc3nc": 376,
      "Nc2nc": 377,
      "CCn1": 378,
      "1CCCN1": 379,
      "23": 380,
      "CN1CCC": 381,
      "c3cccc4": 382,
      "Cc2cnc": 383,
      "o1": 384,
      "n4n3": 385,
      "Nc2cc": 386,
      "c4nc": 387,
      "C2CCN": 388,
      "CCOCC2": 389,
      "cccc4": 390,
      "c4ccc5": 391,
      "CNCC": 392,
      "c2Cl": 393,
      "@@](": 394,
      "Oc1ccc2C": 395,
      "cn3": 396,
      "Oc2ccccc2": 397,
      "OC2": 398,
      "cn2": 399,
      "n4nc": 400,
      "CCCC3": 401,
      "cc23": 402,
      "5C": 403,
      "c2ccccc21": 404,
      "N1CC": 405,
      "@](": 406,
      "Cc3cc": 407,
      "Oc1c2": 408,
      "c3C": 409,
      "c2C1": 410,
      "c4n": 411,
      "n2nc": 412,
      "c1cc2c": 413,
      "ncc3": 414,
      "CCC3": 415,
      "CC1CC": 416,
      "c2cccc3": 417,
      "c2cc3": 418,
      "cc2Cl": 419,
      "Oc3ccc": 420,
      "c2ccncc2": 421,
      "c3ccccn3": 422,
      "Cc1": 423,
      "C3CCN": 424,
      "ccc34": 425,
      "OCCCN": 426,
      "C1CCC": 427,
      "CCN1C": 428,
      "CN2": 429,
      "nc34": 430,
      "c2cc1OC": 431,
      "nc2c1nc": 432,
      "Cc1ccc2c": 433,
      "Cc2cccc": 434,
      "Nc3nc4": 435,
      "Cc1nc": 436,
      "Nc3ccccc3": 437,
      "COc2ccc": 438,
      "Oc3ccccc3": 439,
      "C1NC": 440,
      "CCOCC5": 441,
      "O3": 442,
      "cc7": 443,
      "nc24": 444,
      "NC3": 445,
      "Fc1cccc": 446,
      "CCl": 447,
      "CN3": 448,
      "c5ccccc45": 449,
      "c2C": 450,
      "Clc1cc": 451,
      "c45": 452,
      "c1nnc": 453,
      "10": 454,
      "36": 455,
      "CCN3": 456,
      "ccccc24": 457,
      "c5nc": 458,
      "Oc1c25": 459,
      "OCCCC": 460,
      "c4ccccc34": 461,
      "Oc1cc": 462,
      "C3CCC4": 463,
      "CSC": 464,
      "Nc3nc4c": 465,
      "56": 466,
      "CCN3CCN": 467,
      "cccc3": 468,
      "c1ccccc1C": 469,
      "CC7": 470,
      "ccccc4c3": 471,
      "ccc3c2": 472,
      "c1cncc": 473,
      "NCCCC": 474,
      "OC3": 475,
      "C3C": 476,
      "5CCCC": 477,
      "cccn4n3": 478,
      "c7ccc": 479,
      "c5c": 480,
      "cc3C": 481,
      "n2c": 482,
      "ccc1O": 483,
      "nc2c1ncn2": 484,
      "1CCN": 485,
      "N2CC": 486,
      "CCc1ccc": 487,
      "c5c4": 488,
      "Cn1cc": 489,
      "ccc23": 490,
      "CCN4": 491,
      "cc1F": 492,
      "N3CCOCC3": 493,
      "Nc3cccc": 494,
      "ON": 495,
      "OCC1": 496,
      "C1OC": 497,
      "CC1CCCCC1": 498,
      "Cc5ccccc5": 499,
      "Oc1ccc2": 500,
      "c3ccccc23": 501,
      "COCC": 502,
      "CCOP": 503,
      "sc1": 504,
      "c3cc4": 505,
      "OCc2ccccc2": 506,
      "CCCCC5": 507,
      "ccccc8": 508,
      "12C": 509,
      "3CN": 510,
      "Nc3n": 511,
      "OCc1ccccc1": 512,
      "ccccc13": 513,
      "c1cccc2": 514,
      "n3cn": 515,
      "ncc1": 516,
      "c4cn": 517,
      "n1C": 518,
      "6C": 519,
      "SCC": 520,
      "OC4": 521,
      "CCN3C": 522,
      "ccccc2c1": 523,
      "C2CC": 524,
      "CCOCC1": 525,
      "c4cccs4": 526,
      "NCc1ccccc1": 527,
      "Nc1c": 528,
      "CCc4ccccc4": 529,
      "COc1c": 530,
      "n3cc": 531,
      "N4CCC": 532,
      "c2cnc3nc": 533,
      "cc13": 534,
      "COP": 535,
      "ccc2c1": 536,
      "CCC1n1cc": 537,
      "ccccc7": 538,
      "c3ccc4ccccc4c3": 539,
      "OCc3ccccc3": 540,
      "CNS": 541,
      "cc3Cl": 542,
      "c3occc3": 543,
      "1CCC": 544,
      "CCOc1cc": 545,
      "COc1ccc2C": 546,
      "C4CC4": 547,
      "c3ccncc3": 548,
      "n3cnc4c": 549,
      "c13": 550,
      "nc2c1": 551,
      "c4ccccn4": 552,
      "Nc1ccc2": 553,
      "c8ccccc8": 554,
      "Cc1n": 555,
      "Nc2cccc": 556,
      "C1CN": 557,
      "\\[": 558,
      "N2CCOCC2": 559,
      "CCCCO": 560,
      "Cn2": 561,
      "Nc1n": 562,
      "Nc2nc3": 563,
      "c2ccccc12": 564,
      "c2cccn3nc": 565,
      "C1N": 566,
      "ccccc14": 567,
      "CNCc1cc": 568,
      "COc1cccc2": 569,
      "c2ccccc2n1": 570,
      "cc4F": 571,
      "CCCl": 572,
      "OS": 573,
      "CCCCCCCCC": 574,
      "Cn1cc2c": 575,
      "Nc1nc2": 576,
      "OCCO": 577,
      "no": 578,
      "n1c": 579,
      "Nc4cccc": 580,
      "CC2C": 581,
      "cc4C": 582,
      "CCNC2": 583,
      "c2ncc": 584,
      "cccc2n1": 585,
      "N2CCC3": 586,
      "CCN2": 587,
      "c7ccccc7": 588,
      "1CCCN1CC": 589,
      "Cc4cc": 590,
      "c3n2": 591,
      "c56": 592,
      "ccc45": 593,
      "(/": 594,
      "35": 595,
      "nnc": 596,
      "CCc1ccccc1": 597,
      "c4ccccc24": 598,
      "CN2C": 599,
      "Nc3ccc4": 600,
      "N5CCOCC5": 601,
      "c3cccc4ccccc34": 602,
      "OCCCN4": 603,
      "c3ccccc13": 604,
      "C2O": 605,
      "ccccc3c2": 606,
      "ccc1Oc2ccc": 607,
      "Cn1c": 608,
      "NCCN2": 609,
      "NCc2ccc": 610,
      "sc12": 611,
      "CCc3ccccc3": 612,
      "c2oc": 613,
      "C1C2CCC": 614,
      "ccccc46": 615,
      "N1CC1": 616,
      "c3ccnc": 617,
      "12CC": 618,
      "2CN": 619,
      "Oc2c": 620,
      "c1cccn2nc": 621,
      "cc2c1": 622,
      "N5CCN": 623,
      "2CCNC2": 624,
      "7C": 625,
      "occc": 626,
      "OC2C": 627,
      "ccccc5c4": 628,
      "CCN1CCN": 629,
      "Nc2c": 630,
      "c1F": 631,
      "COC1": 632,
      "2C3": 633,
      "S1": 634,
      "ncc4": 635,
      "C1CC1": 636,
      "CCOc1ccccc1": 637,
      "CCNC3": 638,
      "ccc2n1": 639,
      "c1cnccc1": 640,
      "Cc1cnc": 641,
      "CCN3CC5": 642,
      "NCc3ccc": 643,
      "2CNC": 644,
      "34": 645,
      "Oc2c1": 646,
      "c3nn": 647,
      "C1CCC2": 648,
      "ccccc35": 649,
      "cc4Cl": 650,
      "Cc5ccc": 651,
      "Si": 652,
      "c4c5": 653,
      "c1ccncc1": 654,
      "nc3c": 655,
      "OCCN2": 656,
      "c3ncc": 657,
      "Oc1ccccc1N2CCN": 658,
      "c3ccccc3C": 659,
      "c4ccccc4OC": 660,
      "Oc4ccc": 661,
      "ccn1": 662,
      "CCc2ccccc2": 663,
      "c2c3": 664,
      "c4ccccc14": 665,
      "CC1CN": 666,
      "nc13": 667,
      "ccc21": 668,
      "CCCN1C": 669,
      "Nc2ncc": 670,
      "COc1ccc2c": 671,
      "c4ccccc4Cl": 672,
      "OP": 673,
      "CC8": 674,
      "CON": 675,
      "cc3F": 676,
      "c3cnc": 677,
      "N3CCNCC3": 678,
      "3CCNC3": 679,
      "NCCCCC": 680,
      "c1ccccn1": 681,
      "c3c2C": 682,
      "c5nc6": 683,
      "C7": 684,
      "NCC2": 685,
      "NCCO": 686,
      "C2CCC1": 687,
      "N2CC2": 688,
      "NCCCCN": 689,
      "c2occc2": 690,
      "1CCCN1CCc2ccc3nc": 691,
      "13": 692,
      "Oc1c": 693,
      "CCC6": 694,
      "CCCOC": 695,
      "cc2F": 696,
      "ccc1OC": 697,
      "n4cc": 698,
      "NOC": 699,
      "cccc1": 700,
      "c1N": 701,
      "c4C": 702,
      "CCO2": 703,
      "C3CC": 704,
      "5CC6": 705,
      "Cc1nc2": 706,
      "Sc2ccc": 707,
      "CCCCc5nc6": 708,
      "CN2CCC": 709,
      "CC21C": 710,
      "C2CC2": 711,
      "CNC3": 712,
      "NCCc2ccc": 713,
      "NCCN1": 714,
      "CCOCCOCCOCCO": 715,
      "c4c5CCCCc5nc6": 716,
      "c2ccccc2C": 717,
      "c3ccccc3C2": 718,
      "ncnc2": 719,
      "c3cccs3": 720,
      "C3CCC": 721,
      "ccc1C": 722,
      "c6occc": 723,
      "c6occc6": 724,
      "4CCCC": 725,
      "ccc2C": 726,
      "CC2C3CCC4": 727,
      "C4C": 728,
      "Cc3cn": 729,
      "onc": 730,
      "c35": 731,
      "cc1S": 732,
      "n3c": 733,
      "n2ccnc2": 734,
      "CCc2c1": 735,
      "CN3C": 736,
      "c5cccnc5": 737,
      "Cc1ccc2ccccc2c1": 738,
      "CCN1CCC": 739,
      "CC1CCCCC1n1cc": 740,
      "NCc1ccc": 741,
      "c1ccccc1O": 742,
      "c4ccccc4C": 743,
      "34C": 744,
      "Oc4ccccc4": 745,
      "CN5": 746,
      "CNc1nc": 747,
      "CC12CCC": 748,
      "C2CN": 749,
      "36O": 750,
      ")-": 751,
      "Nc4ccccc4": 752,
      "NCCCN": 753,
      "COc3ccc": 754,
      "cc3c": 755,
      "C3CCCCC3": 756,
      "c2ccccn2": 757,
      "nc1C": 758,
      "c4ccncc4": 759,
      "CCn1c": 760,
      "c4c5CCCCc5nc6ccccc46": 761,
      "c3ccccc3n2": 762,
      "1N": 763,
      "1c3ccc": 764,
      "cccc1C": 765,
      "C12": 766,
      "C1CCN": 767,
      "nc3N": 768,
      "2CCCC": 769,
      "Nc3cc": 770,
      "s5": 771,
      "CCc2ccc": 772,
      "c2cc1": 773,
      "Clc1ccccc1": 774,
      "nc2C": 775,
      "CC4CC": 776,
      "N3CCCC3": 777,
      "Cc1ccccc1C": 778,
      "c2cccc3ccccc23": 779,
      "5CCCC5": 780,
      "Cc1cc2": 781,
      "Fc1ccc2c": 782,
      "S2": 783,
      "cs2": 784,
      "nn4": 785,
      "ncnc": 786,
      "cc21": 787,
      "cc34": 788,
      "Cc6": 789,
      "CCc2cc": 790,
      "n1nn": 791,
      "CC3CC": 792,
      "C4CCCCC4": 793,
      "c2cnc": 794,
      "Oc1cccc2": 795,
      "4Oc5c": 796,
      "Nc3ccc4c": 797,
      "5CC6CC": 798,
      "NCc3ccccc3": 799,
      "c1ccccc1Cl": 800,
      "Cc3c": 801,
      "Cc1ncc": 802,
      "Nc4cc": 803,
      "SCCC": 804,
      "c2cc1O": 805,
      "CN2CCN": 806,
      "cc2O": 807,
      "C2OC": 808,
      "Nc2ccc3": 809,
      "COc1cc2c": 810,
      "c4cccc5ccccc45": 811,
      "c2onc": 812,
      "c4ccc5ccccc5c4": 813,
      "Cc1cn": 814,
      "Nc1ncc": 815,
      "c3C2": 816,
      "CCCCOC": 817,
      "n1cc2c": 818,
      "CC1CCC": 819,
      "C3CC3": 820,
      "N3CC": 821,
      "CCCCNc1ncc": 822,
      "C5CC5": 823,
      "CCN3CC5CCC5": 824,
      "2CO": 825,
      "Sc3ccc": 826,
      "c4nc5": 827,
      "cnc2n1": 828,
      "n3n2": 829,
      "c4cnc": 830,
      "NCCN3": 831,
      "1CCCN1C": 832,
      "CCN4CC6": 833,
      "c2ccccc2Cl": 834,
      "c2ccccc2C1": 835,
      "1OCC": 836,
      "Oc23": 837,
      "ccn2": 838,
      "CCc1cccc": 839,
      "c3oc": 840,
      "c4cc5": 841,
      "CCNc1nc": 842,
      "CCCCCC1": 843,
      "CC1c3ccc": 844,
      "C23": 845,
      "N2CCCCC2": 846,
      "nc2n1": 847,
      "c2ccnc": 848,
      "ccc1Cl": 849,
      "c2no": 850,
      "CCCCN3C": 851,
      "Cc2ccc3": 852,
      "C3CCNCC3": 853,
      "Cn2cnc": 854,
      "CCSSC": 855,
      "Cc2cc": 856,
      "c2sc": 857,
      "Clc1ccc2": 858,
      "CCN5": 859,
      "ncnc23": 860,
      "N1CCCC1": 861,
      "nc2cc": 862,
      "CNC2": 863,
      "OCCF": 864,
      "c2noc": 865,
      "c2ccc3ccccc3c2": 866,
      "COc1ccc2cc": 867,
      "SN": 868,
      "nc2ccccc2n1": 869,
      "scc": 870,
      "CCCc1c": 871,
      "CCNCC4": 872,
      "CCCC5": 873,
      "CCCCCCC1": 874,
      "cc2s1": 875,
      "CC2CCCCC2": 876,
      "n23": 877,
      "n2ccc": 878,
      "N3CCCCC3": 879,
      "1CNC": 880,
      "OCCCCC": 881,
      "Oc2cccc": 882,
      "CCCS": 883,
      "NCCNC": 884,
      "NC1C": 885,
      "c2ncnc": 886,
      "Cc1cccc2": 887,
      "c2ccc3c": 888,
      "n5nc": 889,
      "noc2c1": 890,
      "c3ccccc3C1": 891,
      ")/": 892,
      "2OC": 893,
      "Cc3cccc": 894,
      "sc2c1": 895,
      "CCSC": 896,
      "ClC": 897,
      "c4Cl": 898,
      "c5cn": 899,
      "c2ncnc3": 900,
      "CCCCN1": 901,
      "cccc23": 902,
      "nc2c1ncn2C1OC": 903,
      "NCc4ccc": 904,
      "3CCCC": 905,
      "c9": 906,
      "CCc4cc": 907,
      "ncnc3": 908,
      "COc2cccc": 909,
      "CCCCCCN": 910,
      "CN3CCN": 911,
      "cc24": 912,
      "CC1C": 913,
      "c5ccccc35": 914,
      "CCCCCN1C": 915,
      "N2CCNCC2": 916,
      "Oc1ccccc1C": 917,
      "OCC1OC": 918,
      "OCCN2CCCCC2": 919,
      "NCc4cccc": 920,
      "4CCN": 921,
      "7CC7": 922,
      "Cc2c1": 923,
      "CCn1cc": 924,
      "c3n1": 925,
      "COc2ccccc2": 926,
      "COc1ncc": 927,
      "n2C": 928,
      "N3CCCN": 929,
      "c3csc": 930,
      "CCCN1CCC": 931,
      "cccc4Cl": 932,
      "c2ccccc2c1": 933,
      "6ccccc6": 934,
      "NOCC": 935,
      "Nc3c": 936,
      "OCC2": 937,
      "OC5": 938,
      "OCOC": 939,
      "c4n3": 940,
      "c4ncc": 941,
      "cccc2C": 942,
      "COc3ccccc3": 943,
      "COc4ccc": 944,
      "CCCCOc1ccc": 945,
      "nc4ccccc34": 946,
      "COc1ccccc1C": 947,
      "c1ccc2nc": 948,
      "CN4CCN": 949,
      "N1CCc2nc": 950,
      "Cc1oc": 951,
      "NCc5cccc": 952,
      "CCc1cc": 953,
      "ccc3C": 954,
      "c1NC": 955,
      "c1sc": 956,
      "CCCc1ccccc1": 957,
      "c4CCCC": 958,
      "cc1OCC": 959,
      "CN2CC": 960,
      "cc2c3nc": 961,
      "N2CCCC2": 962,
      "CCCCCNC": 963,
      "c2nccc": 964,
      "C5CCN": 965,
      "2CCCN2C": 966,
      "OCOc4c3": 967,
      "c2c3CCCC": 968,
      "n4ccnc4": 969,
      "n1nnc2ccccc21": 970,
      "Cc4cccc": 971,
      "NCCC1": 972,
      "O4": 973,
      "n6": 974,
      "sc5ccccc45": 975,
      "CCc1c": 976,
      "c1ccc2C": 977,
      "CCN4CC": 978,
      "c2ccc3C": 979
    }
  }
}