[PAD]	0
[CLS]	1
[SEP]	2
[MASK]	3
[UNK]	4
#	5
%	6
(	7
)	8
+	9
-	10
/	11
0	12
1	13
2	14
3	15
4	16
5	17
6	18
7	19
8	20
9	21
=	22
@	23
A	24
B	25
C	26
F	27
H	28
I	29
N	30
O	31
P	32
S	33
[	34
\	35
]	36
c	37
e	38
i	39
l	40
n	41
o	42
r	43
s	44
cc	45
CC	46
(=	47
ccc	48
c1	49
c2	50
ccccc	51
c3	52
NC	53
CCC	54
@@	55
](	56
OC	57
Cl	58
c1ccc	59
c4	60
CCN	61
cc1	62
nc	63
cccc	64
)[	65
CO	66
CCCC	67
CN	68
)(	69
)(=	70
cc2	71
c2ccc	72
C1	73
ccccc1	74
n1	75
c1ccccc1	76
c3ccc	77
ccccc2	78
CC1	79
c5	80
CC2	81
C2	82
cc3	83
c2ccccc2	84
ccccc3	85
n2	86
c1cc	87
c3ccccc3	88
CCO	89
c1cccc	90
N2	91
ccccc4	92
CC3	93
CCCCC	94
c4ccc	95
)=	96
C3	97
cn	98
N1	99
c4ccccc4	100
nc2	101
cc4	102
CC4	103
n3	104
CNC	105
COc1ccc	106
NS	107
2C	108
Cc1ccc	109
CN1	110
COC	111
c2cc	112
N3	113
c1c	114
OCC	115
c1nc	116
Br	117
@@]	118
NCC	119
c2cccc	120
N2CCN	121
ccc1	122
CS	123
nc3	124
C4	125
(-	126
c2c	127
@]	128
ccccc5	129
c6	130
CCCN	131
c3cccc	132
nc1	133
n4	134
Oc1ccc	135
)\	136
c3cc	137
c4cccc	138
NC1	139
Cc1ccccc1	140
c2c1	141
c5ccccc5	142
3C	143
Nc1ccc	144
1C	145
c5ccc	146
CCOC	147
c1n	148
c2nc	149
c3c	150
NO	151
CCNC	152
ccc2	153
ccc3	154
c2n	155
N4	156
CC5	157
nc4	158
Cc1cc	159
CCC1	160
CCCCN	161
cc5	162
COc1ccccc1	163
c1cc2	164
Nc2ccc	165
c1ccc2	166
COc1cc	167
1O	168
]([	169
SC	170
nn	171
2CC	172
c1C	173
C5	174
Nc3ccc	175
Cc2ccc	176
Cc2ccccc2	177
ccc4	178
1CC	179
cc1Cl	180
c4cc	181
Nc1nc	182
Clc1ccc	183
Cc1cccc	184
CCCCCCCC	185
c12	186
N3CCN	187
OCCN	188
Cc3ccccc3	189
Cn1	190
c7	191
CCCCC1	192
c2ccc3	193
COc1cccc	194
Cc3ccc	195
(\	196
c1cn	197
NC2	198
s1	199
CCC4	200
c3c2	201
c4c	202
([	203
4C	204
oc	205
CCCN1	206
CCC2	207
N2C	208
c3nc	209
cc1OC	210
2CCC	211
nc23	212
CCS	213
Cc1c	214
3CCN	215
Oc2ccc	216
OC1	217
nn2	218
c3n	219
CN1CCN	220
cc1C	221
NN	222
c2cn	223
CCCNC	224
ONC	225
Fc1ccc	226
NCCN	227
sc	228
cccc2	229
COc1ccccc1N2CCN	230
CCCCC2	231
CC6	232
Oc1ccccc1	233
OCCC	234
NCCC	235
n2cc	236
N2CCC	237
Cc4ccccc4	238
c1Cl	239
c3ccc4	240
CN1C	241
n1cc	242
CCOCCO	243
ncc2	244
CCCCCCC	245
s2	246
ccc5	247
C1C	248
CCOCC4	249
1CN	250
CN1CC	251
2O	252
cn1	253
Nc1ccccc1	254
ccccc6	255
c3cn	256
FC	257
c23	258
Nc1cccc	259
c1OC	260
Cc1ccc2	261
CCCCC4	262
CCCCCC	263
3O	264
nc12	265
c1ncc	266
ccccc34	267
3CC	268
C6	269
s3	270
COc1cc2	271
Nc4ccc	272
O2	273
N5	274
CCCC2	275
c5cc	276
CCCC1	277
Nc1cc	278
c2nc3	279
C2C	280
CCCCNC	281
CCOc1ccc	282
N1C	283
nn1	284
c6ccc	285
1NC	286
cnc	287
Clc1cccc	288
c5cccc	289
O1	290
c1nc2	291
CCN1	292
c1c2	293
Oc1cccc	294
Cc4ccc	295
Cc2c	296
c6ccccc6	297
c1ccc2c	298
n2cn	299
c4o	300
N4CCOCC4	301
2CCN	302
Nc2n	303
ccccc12	304
3CCC	305
ncc	306
Nc2ccccc2	307
cc12	308
3N	309
n5	310
s4	311
nc5	312
CCCCC3	313
NNC	314
N1CCC	315
nH	316
NC4	317
CCCC4	318
COc1ccc2	319
c34	320
C1O	321
CC4CC4	322
C2CCC	323
n3nc	324
4O	325
ccc12	326
c4c3	327
ccccc45	328
nn3	329
c1O	330
c4cccc5	331
4CC	332
1OC	333
c2n1	334
cc1O	335
ccccc23	336
cc6	337
cc2c	338
c3nc4	339
c1cnc	340
cc2C	341
c5o	342
N1CCN	343
N3CCC	344
Oc2cc	345
nc2N	346
12	347
N4CCN	348
CCC5	349
N3C	350
n2cnc3c	351
c4occc4	352
c2o	353
OCO	354
c8	355
CCCO	356
c3o	357
CCOCC3	358
c5occc5	359
C1CC	360
CN4	361
c2ccc3nc	362
Nc2nc	363
CCn1	364
1CCCN1	365
23	366
CN1CCC	367
c3cccc4	368
Cc2cnc	369
o1	370
n4n3	371
Nc2cc	372
c4nc	373
C2CCN	374
CCOCC2	375
cccc4	376
c4ccc5	377
CNCC	378
c2Cl	379
@@](	380
Oc1ccc2C	381
cn3	382
Oc2ccccc2	383
OC2	384
cn2	385
n4nc	386
CCCC3	387
cc23	388
5C	389
c2ccccc21	390
N1CC	391
@](	392
Cc3cc	393
Oc1c2	394
c3C	395
c2C1	396
c4n	397
n2nc	398
c1cc2c	399
ncc3	400
CCC3	401
CC1CC	402
c2cccc3	403
c2cc3	404
cc2Cl	405
Oc3ccc	406
c2ccncc2	407
c3ccccn3	408
Cc1	409
C3CCN	410
ccc34	411
OCCCN	412
C1CCC	413
CCN1C	414
CN2	415
nc34	416
c2cc1OC	417
nc2c1nc	418
Cc1ccc2c	419
Cc2cccc	420
Nc3nc4	421
Cc1nc	422
Nc3ccccc3	423
COc2ccc	424
Oc3ccccc3	425
C1NC	426
CCOCC5	427
O3	428
cc7	429
nc24	430
Fc1cccc	431
CCl	432
NC3	433
CN3	434
c5ccccc45	435
c2C	436
Clc1cc	437
c45	438
c1nnc	439
10	440
36	441
CCN3	442
ccccc24	443
c5nc	444
Oc1c25	445
OCCCC	446
c4ccccc34	447
Oc1cc	448
C3CCC4	449
CSC	450
Nc3nc4c	451
56	452
CCN3CCN	453
cccc3	454
CC7	455
c1ccccc1C	456
ccccc4c3	457
ccc3c2	458
c1cncc	459
NCCCC	460
OC3	461
C3C	462
5CCCC	463
cccn4n3	464
c7ccc	465
c5c	466
cc3C	467
n2c	468
ccc1O	469
nc2c1ncn2	470
1CCN	471
N2CC	472
CCc1ccc	473
c5c4	474
Cn1cc	475
ccc23	476
CCN4	477
cc1F	478
N3CCOCC3	479
Nc3cccc	480
ON	481
OCC1	482
C1OC	483
CC1CCCCC1	484
Cc5ccccc5	485
Oc1ccc2	486
c3ccccc23	487
c3cccnc3	488
COCC	489
CCOP	490
sc1	491
c3cc4	492
OCc2ccccc2	493
CCCCC5	494
ccccc8	495
12C	496
3CN	497
Nc3n	498
OCc1ccccc1	499
ccccc13	500
c1cccc2	501
n3cn	502
ncc1	503
c4cn	504
n1C	505
c4cccnc4	506
6C	507
SCC	508
OC4	509
CCN3C	510
ccccc2c1	511
C2CC	512
CCOCC1	513
c4cccs4	514
Nc1c	515
CCc4ccccc4	516
NCc1ccccc1	517
COc1c	518
n3cc	519
N4CCC	520
c2cnc3nc	521
cc13	522
COP	523
ccc2c1	524
CCC1n1cc	525
ccccc7	526
c3ccc4ccccc4c3	527
OCc3ccccc3	528
CNS	529
cc3Cl	530
c3occc3	531
1CCC	532
CCOc1cc	533
COc1ccc2C	534
C4CC4	535
c3ccncc3	536
n3cnc4c	537
c13	538
c1cccnc1	539
nc2c1	540
c4ccccn4	541
Nc1ccc2	542
c8ccccc8	543
Cc1n	544
Nc2cccc	545
C1CN	546
\[	547
N2CCOCC2	548
CCCCO	549
Cn2	550
Nc1n	551
Nc2nc3	552
c2ccccc12	553
c2cccn3nc	554
C1N	555
ccccc14	556
CNCc1cc	557
COc1cccc2	558
c2ccccc2n1	559
cc4F	560
CCCl	561
OS	562
CCCCCCCCC	563
Cn1cc2c	564
Nc1nc2	565
OCCO	566
no	567
n1c	568
Nc4cccc	569
CC2C	570
cc4C	571
CCNC2	572
c2ncc	573
cccc2n1	574
N2CCC3	575
CCN2	576
c7ccccc7	577
1CCCN1CC	578
Cc4cc	579
c3n2	580
c56	581
ccc45	582
(/	583
35	584
nnc	585
CCc1ccccc1	586
c4ccccc24	587
CN2C	588
Nc3ccc4	589
N5CCOCC5	590
c3cccc4ccccc34	591
OCCCN4	592
c3ccccc13	593
C2O	594
ccccc3c2	595
ccc1Oc2ccc	596
Cn1c	597
NCCN2	598
sc12	599
CCc3ccccc3	600
c2oc	601
NCc2ccc	602
C1C2CCC	603
ccccc46	604
N1CC1	605
c3ccnc	606
12CC	607
2CN	608
Oc2c	609
c1cccn2nc	610
cc2c1	611
N5CCN	612
2CCNC2	613
7C	614
occc	615
OC2C	616
ccccc5c4	617
CCN1CCN	618
Nc2c	619
c1F	620
COC1	621
2C3	622
S1	623
ncc4	624
C1CC1	625
CCOc1ccccc1	626
CCNC3	627
ccc2n1	628
c1cnccc1	629
Cc1cnc	630
CCN3CC5	631
2CNC	632
34	633
Oc2c1	634
c3nn	635
NCc3ccc	636
C1CCC2	637
ccccc35	638
cc4Cl	639
Cc5ccc	640
Si	641
c4c5	642
c1ccncc1	643
nc3c	644
OCCN2	645
c3ncc	646
Oc1ccccc1N2CCN	647
Nc4ccccc4	648
Oc4ccc	649
ccn1	650
CCc2ccccc2	651
c2c3	652
c4ccccc14	653
CC1CN	654
c3ccccc3C	655
nc13	656
ccc21	657
CCCN1C	658
Nc2ncc	659
COc1ccc2c	660
OP	661
CC8	662
CON	663
cc3F	664
c3cnc	665
N3CCNCC3	666
3CCNC3	667
NCCCCC	668
c1ccccn1	669
c4ccccc4OC	670
c3c2C	671
c5nc6	672
C7	673
NCC2	674
NCCO	675
C2CCC1	676
N2CC2	677
NCCCCN	678
c2occc2	679
1CCCN1CCc2ccc3nc	680
13	681
Oc1c	682
CCC6	683
CCCOC	684
cc2F	685
ccc1OC	686
n4cc	687
NOC	688
cccc1	689
c1N	690
c4C	691
CCO2	692
C3CC	693
5CC6	694
Cc1nc2	695
Sc2ccc	696
CCCCc5nc6	697
CN2CCC	698
CC21C	699
C2CC2	700
CNC3	701
NCCc2ccc	702
NCCN1	703
CCOCCOCCOCCO	704
c4c5CCCCc5nc6	705
ncnc2	706
c3cccs3	707
c2ccccc2C	708
c3ccccc3C2	709
C3CCC	710
ccc1C	711
c6occc	712
c6occc6	713
4CCCC	714
ccc2C	715
CC2C3CCC4	716
C4C	717
Cc3cn	718
onc	719
c35	720
cc1S	721
n3c	722
n2ccnc2	723
CCc2c1	724
CN3C	725
c4ccccc4Cl	726
c5cccnc5	727
Cc1ccc2ccccc2c1	728
CCN1CCC	729
CC1CCCCC1n1cc	730
34C	731
Oc4ccccc4	732
NCc1ccc	733
Clc1ccccc1	734
CN5	735
CNc1nc	736
CC12CCC	737
C2CN	738
36O	739
)-	740
NCCCN	741
COc3ccc	742
cc3c	743
C3CCCCC3	744
c4ccccc4C	745
c2ccccn2	746
nc1C	747
c4ccncc4	748
CCn1c	749
c4c5CCCCc5nc6ccccc46	750
1N	751
1c3ccc	752
cccc1C	753
C12	754
C1CCN	755
c3ccccc3n2	756
nc3N	757
2CCCC	758
Nc3cc	759
s5	760
CCc2ccc	761
c2cc1	762
c1ccccc1O	763
nc2C	764
CC4CC	765
N3CCCC3	766
Cc1ccccc1C	767
c2cccc3ccccc23	768
5CCCC5	769
Cc1cc2	770
Fc1ccc2c	771
S2	772
cs2	773
nn4	774
ncnc	775
cc21	776
cc34	777
Cc6	778
CCc2cc	779
n1nn	780
CC3CC	781
C4CCCCC4	782
c2cnc	783
Oc1cccc2	784
4Oc5c	785
Nc3ccc4c	786
5CC6CC	787
Cc3c	788
Cc1ncc	789
Nc4cc	790
SCCC	791
c2cc1O	792
NCc3ccccc3	793
CN2CCN	794
cc2O	795
c1ccccc1Cl	796
C2OC	797
Nc2ccc3	798
COc1cc2c	799
c4cccc5ccccc45	800
c2onc	801
c4ccc5ccccc5c4	802
Cc1cn	803
Nc1ncc	804
c3C2	805
CCCCOC	806
n1cc2c	807
CC1CCC	808
C3CC3	809
N3CC	810
CCCCNc1ncc	811
C5CC5	812
CCN3CC5CCC5	813
2CO	814
Sc3ccc	815
c4nc5	816
cnc2n1	817
n3n2	818
c4cnc	819
NCCN3	820
1CCCN1C	821
CCN4CC6	822
1OCC	823
Oc23	824
ccn2	825
CCc1cccc	826
c3oc	827
c4cc5	828
CCNc1nc	829
CCCCCC1	830
CC1c3ccc	831
C23	832
c2ccccc2Cl	833
c2ccccc2C1	834
N2CCCCC2	835
nc2n1	836
c2ccnc	837
ccc1Cl	838
c2no	839
CCCCN3C	840
Cc2ccc3	841
C3CCNCC3	842
Cn2cnc	843
Cc2cc	844
c2sc	845
Clc1ccc2	846
CCN5	847
ncnc23	848
N1CCCC1	849
nc2cc	850
CNC2	851
OCCF	852
c2noc	853
c2ccc3ccccc3c2	854
CCSSC	855
COc1ccc2cc	856
SN	857
nc2ccccc2n1	858
scc	859
CCCc1c	860
CCNCC4	861
CCCC5	862
CCCCCCC1	863
cc2s1	864
CC2CCCCC2	865
n23	866
n2ccc	867
N3CCCCC3	868
1CNC	869
OCCCCC	870
Oc2cccc	871
CCCS	872
NCCNC	873
NC1C	874
c2ncnc	875
Cc1cccc2	876
c2ccc3c	877
n5nc	878
noc2c1	879
)/	880
2OC	881
Cc3cccc	882
sc2c1	883
CCSC	884
ClC	885
c4Cl	886
c5cn	887
c3ccccc3C1	888
c2ncnc3	889
CCCCN1	890
cccc23	891
nc2c1ncn2C1OC	892
3CCCC	893
c9	894
CCc4cc	895
NCc4ccc	896
ncnc3	897
COc2cccc	898
CCCCCCN	899
CN3CCN	900
cc24	901
CC1C	902
c5ccccc35	903
CCCCCN1C	904
N2CCNCC2	905
Oc1ccccc1C	906
OCC1OC	907
OCCN2CCCCC2	908
4CCN	909
7CC7	910
Cc2c1	911
CCn1cc	912
c3n1	913
NCc4cccc	914
COc2ccccc2	915
COc1ncc	916
n2C	917
N3CCCN	918
c3csc	919
CCCN1CCC	920
cccc4Cl	921
6ccccc6	922
NOCC	923
Nc3c	924
OCC2	925
OC5	926
OCOC	927
c4n3	928
c4ncc	929
cccc2C	930
COc3ccccc3	931
COc4ccc	932
CCCCOc1ccc	933
c2ccccc2c1	934
nc4ccccc34	935
COc1ccccc1C	936
c1ccc2nc	937
CN4CCN	938
N1CCc2nc	939
Cc1oc	940
CCc1cc	941
ccc3C	942
c1NC	943
c1sc	944
NCc5cccc	945
CCCc1ccccc1	946
c4CCCC	947
cc1OCC	948
CN2CC	949
cc2c3nc	950
N2CCCC2	951
CCCCCNC	952
c2nccc	953
C5CCN	954
2CCCN2C	955
OCOc4c3	956
c2c3CCCC	957
n4ccnc4	958
n1nnc2ccccc21	959
Cc4cccc	960
NCCC1	961
O4	962
n6	963
sc5ccccc45	964
CCc1c	965
c1ccc2C	966
CCN4CC	967
c2ccc3C	968
c2cccs2	969
C1c2ccccc2	970
n1nc	971
CC3CCCCC3	972
N1CCCCC1	973
nc2c	974
NC1CCC	975
NC1CCCCC1	976
N4C	977
nn5	978
OCCN2CCC	979
nn23	980
NCCCN3CCN	981
nn12	982
c4cccc5nc	983
CN4CCCCC4	984
c2c3CCCCc3nc4	985
3NC	986
Fc1ccccc1	987
SC1	988
co	989
sc2	990
sc3	991
c1CN	992
NC5	993
NCc2ccccc2	994
CCCOc2ccc	995
OCc1ccc	996
OC3C	997
cccc5	998
n1nc2ccccc2n1	999
c5n	1000
C23CCN	1001
C2CCCCC2	1002
N2Cc3ccccc3	1003
CC3CCN	1004
CC3CC3	1005
n3C	1006
Brc1ccc	1007
CS3	1008
CSCC	1009
c67	1010
Oc1ccc2O	1011
c5cccs5	1012
CCn1cc2c	1013
c4no	1014
6CCN	1015
Oc3c2	1016
cccc1Cl	1017
CCc3cc	1018
CCCc3ccccc3	1019
OC2CC	1020
c4C3	1021
cc2C1	1022
C1CCCCC1	1023
cc3C1	1024
2CS	1025
COC3	1026
c5ccccc5Cl	1027
Nc2nn	1028
CCN4CC7CC7	1029
5O	1030
c1s	1031
OCc4ccccc4	1032
c1cccs1	1033
CN1C2CCC1	1034
CSc1ccc	1035
CCCCCCCCCCCC	1036
1CN2	1037
Nc1ccn	1038
c2nc3c	1039
OC2OC	1040
c3nnn	1041
1C2	1042
5CC	1043
Cc6ccccc6	1044
Nc5c4	1045
ncc5	1046
CCF	1047
NCc4ccccc4	1048
CCCN2CCC	1049
CCN2CC	1050
cc1Br	1051
c3ccccc3Cl	1052
CCOc1cccc	1053
N1CCCC	1054
CN1CCCC1	1055
ccc1OCC	1056
C4CCN	1057
c6O	1058
N4CCCC4	1059
c7O	1060
NC2CCCCC2	1061
Cc1nn	1062
Nc2nc3nn	1063
c2c3CCCCc3nc4ccccc24	1064
4CCC	1065
4CCCC4	1066
8CC	1067
OB	1068
cc8	1069
CCC9	1070
CCCc1ccc	1071
OC1CC	1072
CCNCC	1073
cc1N1CCc2nc	1074
CN3CCC	1075
cc2OC	1076
c2cccnc2	1077
C1CCC1	1078
c3ccccc3c2	1079
CC3C	1080
cn4	1081
cnc2c	1082
cnc1N	1083
nc25	1084
n3c2C1	1085
CN1CCCCC1	1086
OCCCCN3CCN	1087
ccc13	1088
c5ccccc5C	1089
CCCCN1C	1090
NC2CCN	1091
nn24	1092
cccc2c1	1093
CCOCCOCCO	1094
ncc2C1	1095
COc1cc2CCN	1096
c1c2CCCC	1097
Nc2nccc	1098
Cn1ccnc1	1099
NCCC1CCN	1100
3OC	1101
45	1102
9CCCC	1103
CBr	1104
oc1	1105
CCc5ccccc5	1106
c1onc	1107
CCCOc1ccc	1108
OC1C	1109
cc1N	1110
COc1nc	1111
ccccc15	1112
c3ccccc3F	1113
CC3N	1114
c4ccccc4C3	1115
CC4CC2C	1116
NS2	1117
2Cc3ccc	1118
N3CCC4	1119
c1ncn3	1120
ccc1NC	1121
CSSC	1122
nc3c1ncn3	1123
C45CC6CC	1124
c1nc2ccccc2	1125
c2nnc	1126
1CCNC1	1127
c3ccc4OCOc4c3	1128
Nc1ccccc1C	1129
Nc1ccccc1NC	1130
c5ccncc5	1131
nn13	1132
cncn1	1133
c3cccc4nc	1134
5Cc6ccc	1135
2C3CC4CC2C	1136
11	1137
Cc1cc2c	1138
NCCCN1	1139
oc2	1140
sc3c2	1141
c15	1142
OCc2cc	1143
CCN2CCC	1144
CCN8CC	1145
CCCCc1ccc	1146
cc2c4nc	1147
C1C2	1148
C13CCN	1149
CC12	1150
nc2ccccc12	1151
COC4	1152
c1csc	1153
c2csc	1154
c2ncn	1155
ccc3c	1156
N4CCCCC4	1157
cccc2Cl	1158
c2nc3N	1159
c8ccc	1160
Cn2cncn2	1161
1B	1162
Cn2ccnc2	1163
Cn4ccnc4	1164
Nc2cn	1165
Nc3cn	1166
oc3c	1167
cc1NC	1168
ncn1	1169
N12	1170
cc4ccc	1171
OCCNC	1172
C4CCC	1173
C4CCCC4	1174
ccccc56	1175
ccc2N1	1176
ccc3F	1177
nc4C	1178
OCCN3CCC	1179
c7c6	1180
Cc4ccc5	1181
10CCC	1182
c1cnccn1	1183
c3cc4ccccc4	1184
23C	1185
Fc1ccc2	1186
nnc1	1187
cccnc12	1188
c2c34	1189
c3Cl	1190
CCCN2CCN	1191
ClC1	1192
CCN1CC	1193
CCN1CN	1194
CO1	1195
CNc2nc	1196
c1ccccc1N	1197
c5ccccc15	1198
c2ccccc2F	1199
C3CCCC3	1200
C4CC5	1201
ccc3C2	1202
C5CCCCC5	1203
NC23	1204
c5cc6	1205
c4ncnc	1206
c4nsc5ccccc45	1207
cc7C	1208
CCN2CC4CC4	1209
CC8CC8	1210
CF	1211
Fc1cc	1212
Nc5ccc	1213
Oc4c3	1214
OCCOCCOCCOCCO	1215
CCc3ccc	1216
CCc4cccc	1217
c24	1218
NC2C	1219
OCc2cccc	1220
OCc3cc	1221
CCN2C	1222
C1CC2	1223
c1ccccc1OC	1224
cc3OC	1225
CCOc2ccc	1226
c4ccccc4c3	1227
2Cc3ccccc3	1228
COCc2cc	1229
NCCCCN1CCN	1230
CCCNc4c5CCCCc5nc6ccccc46	1231
c1nn	1232
Cc3ccc4	1233
4Cc5ccc	1234
c3ncnc4	1235
c3nc4ccccc4	1236
c3ccc4c	1237
Nc1cccc2	1238
c5cccc6	1239
N4CCNCC4	1240
36NC	1241
3CNCCN3C	1242
35O	1243
c2nonc2C	1244
1CCCC	1245
1c2ccc	1246
4CC5	1247
8C	1248
Nc5ccccc5	1249
cs1	1250
CCn3	1251
c1CC	1252
NC3CCC	1253
NCc2nonc2C	1254
CCNS	1255
COc3cc	1256
CNc1ccc	1257
cc2N1	1258
C1CCCCN1	1259
CC1CCN	1260
cc3C2	1261
n2n1	1262
CCOc1c	1263
cnn3	1264
N1CCOCC1	1265
ccc2Cl	1266
c2nn	1267
c2ns	1268
CCC1CC2	1269
CCCCCCCCCC	1270
CCC2C3CCC4	1271
OC1OC	1272
c3noc	1273
N5CCC	1274
12c3ccc	1275
c4ncccc4	1276
c4cnn	1277
Nc1nc2ccc	1278
c2nccs2	1279
Cc2ccc3ccccc3c2	1280
1CC2	1281
1CCCN	1282
3CO	1283
cccc12	1284
CCc4ccc	1285
cccnc4	1286
cccnc23	1287
CCCCCCNC	1288
cc2N	1289
CCO1	1290
CCOCC6	1291
CNC4	1292
CN1c23	1293
c6cc	1294
c6cccc	1295
c2c1C	1296
ccc3n2	1297
CCCCNS	1298
nnn1	1299
CCC23	1300
OCCCN3CCN	1301
n1ccnc1	1302
c3cnn	1303
COc1cc2nc	1304
c6ccc7C	1305
NC4CCCC4	1306
OCOc6	1307
c1cccc2ccccc12	1308
OCCCN4CCCCC4	1309
c1cnccc1NC1	1310
ncnc21	1311
CCN4CC6CC6	1312
1CN2CCC1CC2	1313
c1c2CCCCc2nc3	1314
12CCC	1315
1C2CCC	1316
4CN	1317
5CCC	1318
6CCOCC6	1319
Nc2c1	1320
Oc2ccc3	1321
ncc1C	1322
ccn3	1323
c1o	1324
CCCNS	1325
CCCn3c2C1	1326
c1ccco1	1327
CNc1n	1328
)([	1329
cc2cc	1330
n1N	1331
CCOc2ccccc2	1332
CC3COC4	1333
CCCCC3C	1334
CC4C	1335
CNC1CCN	1336
N3CCNC	1337
ccc1F	1338
n4C	1339
NC12	1340
3Cc4ccc	1341
ccc3N	1342
OCCN1	1343
OCCN3CCN	1344
c1cnn2ccc	1345
1CN2CCN	1346
NC4CCCCC4	1347
CCn1nnc	1348
C2CCNCC2	1349
Nc3ncc	1350
2CNCCO2	1351
CCN5CC8CC8	1352
6ccccc6c5	1353
cnn3cccc23	1354
-]	1355
Cc4c	1356
Nc1nnc	1357
Oc1nc	1358
Oc3cc	1359
OCCCCCCCC	1360
nccc	1361
sc4	1362
sc5	1363
sc1C	1364
c14	1365
c2F	1366
CCN2CCN	1367
ncnc34	1368
CO2	1369
CCCCCC2	1370
CCCCCCOC	1371
CN23	1372
cc2S	1373
cc2CC1	1374
C1S	1375
C1Cl	1376
c1ccccc1N2CCN	1377
CC1OC	1378
CC2CCC	1379
C2N	1380
C2SC1	1381
cc32	1382
cc3c4nc	1383
CCCCCN	1384
NCCCCN3CCN	1385
C4CC	1386
c5ccccc5n4	1387
ccc2C1	1388
ccc35	1389
c1cc2ccccc2	1390
C5CCC5	1391
ccc4c3	1392
Nc1ncnc2	1393
Cc3cccs3	1394
nn25	1395
nn14	1396
Cc1s	1397
C1NCN	1398
OCCCN4CCC	1399
ncnc32	1400
NC23CC4CC	1401
NC3CCCc4ccccc34	1402
2C1	1403
3CC1	1404
3CNC	1405
6CC	1406
Cc2	1407
Cc2cn	1408
NP	1409
NNc1ccc	1410
Nc1cc2c	1411
ncccc3	1412
nnc3c	1413
onc1	1414
cccn1	1415
c1OCCN	1416
c3C1	1417
CCCc2ccccc2	1418
OCc6ccccc6	1419
CCCCS	1420
c1ccccc1C2	1421
C2CCCC2	1422
c2ccccc2N	1423
CCOc4cccc5nc	1424
CC3CS3	1425
C3CCCCC3C	1426
ccc1S	1427
CSc1nc	1428
3Cc4ccccc4	1429
c3ncn	1430
Cc1csc	1431
ncc2C	1432
Nc4ccc5	1433
n5cc	1434
c1cncnc1	1435
Cc1onc	1436
Oc1ccc2CC3N	1437
Nc1nc2nn	1438
CCN4CC6CCC6	1439
4CC5CC	1440
3c4ccc	1441
4CCCCC4	1442
5CCOCC5	1443
Oc5ccccc5	1444
c36	1445
c3F	1446
c3s2	1447
NCc5ccccc5	1448
CCCc3ccc	1449
CCC2C	1450
CCC1C	1451
OC7	1452
OCc2ccc	1453
CCNc4c5CCCCc5nc6ccccc46	1454
cc1OCCN2CCCCC2	1455
cc1OCCN2CCC	1456
COCCN	1457
cc25	1458
C1c2ccccc2C	1459
c3ccc4C	1460
C2C1	1461
cc3c5nc	1462
c3ccccc3OC	1463
C3CCC3	1464
C34CC5CC	1465
N1N	1466
N1c1ccc	1467
OCCc2ccccc2	1468
NCCn1c	1469
CSCc2ccccc2	1470
nc3c2	1471
c6c	1472
1Cc2ccc	1473
c2nc3ccccc3	1474
c2nc3ccccc3n2	1475
CC5CC5	1476
CCC1C2	1477
COc1ccccc1N1CCN	1478
ccc4c	1479
Nc1ncnc2c1ncn2	1480
COc1cccc2C	1481
c3no	1482
c3cnn4	1483
OCOc5c4	1484
CN4CCC3	1485
c2cc3c	1486
Nc3nccc	1487
CCCCOc3ccc4	1488
Nc2nc3c	1489
CCN3CC5CC5	1490
NCCCCCN	1491
Nc2ccc3c	1492
c3nc4ccccc4s3	1493
5CCCCC5	1494
Cc2cnc3nc	1495
NCC1	1496
Oc2n	1497
ncccc2c1	1498
sc4ncnc	1499
ccn4	1500
cccc1F	1501
CCc	1502
CCc5ccccc45	1503
c2O	1504
OCc1cccc	1505
cc1CNC	1506
cccc4C	1507
CCCCCCOc1ccc	1508
CCCCn1cc2c	1509
C1SC	1510
c5C	1511
c5cnc	1512
C3O	1513
cc4s3	1514
CN1N	1515
CN1S	1516
COC1C	1517
NCCc3ccc	1518
NCCc2ccccc2	1519
NCCc4ccc	1520
CSCCC	1521
C4CCCC	1522
c2cs	1523
Nc1ccc2C	1524
c2nccc3	1525
c1ccc2ccccc2c1	1526
ccc4F	1527
c4ccsc4	1528
OCCNCC	1529
Cn1ccc2	1530
2CCC3	1531
COc1cc2C	1532
23CNCC	1533
Nc2ccnc	1534
cn2c	1535
c4nccc	1536
Nc3ccccc3C	1537
CC7CC7	1538
Cc1cncn1C	1539
Cc1nc2nc	1540
Cc3cn4	1541
COc2cccc3C	1542
N2Cc3ccccc3C	1543
N1CCCC1C	1544
c5cc6OCOc6	1545
c5cc6OCOc6cc25	1546
4CCOCC4	1547
5CCN	1548
Nc5cccc	1549
Oc5cc	1550
Se	1551
]%	1552
oc3	1553
sc4ccccc34	1554
CCc2c	1555
c1Br	1556
c2OC	1557
CCCN3CCN	1558
CCCn1cc2c	1559
OCc4cc	1560
OCO2	1561
Clc1cc2c	1562
CCN3CCC	1563
CCN5C	1564
cc1c2ccccc2	1565
CC2CC2	1566
cc3c2	1567
c2ccccc2O	1568
c2ccccc2S	1569
n2nn	1570
n2ncc	1571
c3ccccc32	1572
nc21	1573
CC4CCCCC4	1574
Brc1cccc	1575
nc3n2	1576
C4CCC4	1577
Cc1ccccc1O	1578
CCC1OC	1579
COc1ccccc1NC	1580
OCCN4CCCC4	1581
c4cnc5	1582
C6CC6	1583
COc1cc2ncnc	1584
c5ccccn5	1585
3CCCN3C	1586
C1Oc2cc	1587
nn3c2	1588
cc6C	1589
c4ccc5CNC	1590
c4ccc5OCOc5c4	1591
Cc3ccncc3	1592
c2cccc3nc	1593
CN2CCCCC2	1594
COc2ccc3C	1595
Fc1cccc2	1596
cccc3Cl	1597
OCCN2CCOCC2	1598
c5cnn	1599
c5ncccc5	1600
c1c2CCCCc2nc3ccccc13	1601
2NC	1602
7CCN	1603
Nc3nc	1604
O5	1605
Oc2nc	1606
OCCCCCC	1607
SCCCCC	1608
Sc1nc	1609
o2	1610
on1	1611
c1C2	1612
c3c4CCCC	1613
NC3CCN	1614
CCCN2	1615
CCCc4ccccc4	1616
CCCn1c	1617
OCc3ccc	1618
OCc5ccccc5	1619
OC2CCC3	1620
c4sc	1621
ncnc12	1622
CONc1nc	1623
COc1cnc	1624
CNCCC	1625
n1cnc2c	1626
c1ccccc1S	1627
ccccc2n1	1628
CC1O	1629
CC1C2	1630
CC1CC2C3CCC4	1631
cc35	1632
N2CCCC	1633
N2C1C	1634
cnn1	1635
CNC1	1636
CNC2CCN	1637
Cc1cccnc1	1638
COC2	1639
NCCc5ccc	1640
ccc1Sc3ccc	1641
nc3nn	1642
CCCNc1nc	1643
c2nnc3c	1644
N4CCS	1645
nc4cc	1646
CCCCN3CCN	1647
C5C	1648
C5CC	1649
C5CC6	1650
ccc4C	1651
CCCCCCCCCCC	1652
NC2CC2	1653
CCCN1CCN	1654
CCSCC	1655
c2cncc	1656
NCCNCC	1657
CN1CCc2c	1658
c3cncc	1659
C6C	1660
C6C4	1661
Nc2ccccc2C	1662
Cc1o	1663
NC3CCCCC3	1664
c1cccc2nc	1665
OC4CCC5	1666
CCc4ccccc4C3	1667
Nc1ccc2c	1668
Cn2nnc3c	1669
2C3C4CC5	1670
c3nccs3	1671
ncnc2s1	1672
c4nc5ccccc5	1673
c4noc5cc	1674
cccnc45	1675
2C3C4CC5C6C4	1676
3c2c1	1677
Cc1nnc	1678
Cc4ccccc34	1679
Nc6ccc	1680
N6C	1681
no1	1682
cccn3n2	1683
c1c2ccccc2	1684
c21	1685
CCCSC	1686
CCCN3C	1687
OCc1cc	1688
OCc3cccc	1689
Clc1c	1690
CCNCC2	1691
COCC2	1692
CN4C	1693
cc2n1	1694
cc2c1nc	1695
C1OC2	1696
c5O	1697
cc3O	1698
c3ccccc3COc4ccc	1699
CCOc1nc	1700
N2N	1701
CCCCC6	1702
C3CCC2	1703
N1CCCN	1704
c4ccccc4OCC	1705
n34	1706
c2ccsc2	1707
N3CCc4ccccc4C3	1708
ccc1N2CCN	1709
CS2	1710
nc3cc	1711
NC1CCN	1712
Cc1ccccc1S	1713
c2c1c3ccc	1714
c5ccccc5F	1715
nc4ccccc14	1716
CCC12C	1717
cc5C	1718
C5CCCC5	1719
1CCc2c	1720
Nc1ncnc	1721
Nc1ncnc2c1nc	1722
c2ccc3OCO	1723
4Cc5ccccc5	1724
CCS1	1725
c3nccc	1726
cc1Cc2cnc	1727
OCCCN3CCCCC3	1728
Cc4ccccc4C3	1729
CCCCCCC3	1730
n2cnc3ccncc3	1731
Nc2nnc	1732
NC4CC4	1733
COc1ccc2nc	1734
cc1OCCCN	1735
CN4CCCC4	1736
c4ccc5OCC	1737
CN3CCC2	1738
CN3CCCCC3	1739
CCN4CCN	1740
NCCCCN2CCN	1741
Cc1nc2c3c	1742
c4nc5ccccc35	1743
Cc1cccc2ccccc12	1744
c2ncccn2	1745
1C2Cc3ccc	1746
c1nc2ccccc2s1	1747
Cc3ccc4ccccc4c3	1748
Nc4ccc5c	1749
c3c4CCCCc4nc5ccccc35	1750
c2ccc3OCOc3c2	1751
n2cnc3ccncc32	1752
12CCN	1753
5C6	1754
Cc12	1755
Cc3cccc4ccccc34	1756
FC1	1757
Nc2	1758
Nc4c	1759
Oc1cc2	1760
SCCN	1761
SCC2	1762
cs3	1763
CCc12	1764
c1I	1765
c1oc	1766
c2N1	1767
ccccc9	1768
c3OC	1769
OC6	1770
cc1CC	1771
COS	1772
CCCCn1cc	1773
CNc1cccn2nc	1774
CNc2ccc3C	1775
cc2OC1	1776
c1ccccc12	1777
CC2CC	1778
C2CCCC	1779
c2ccccc2c	1780
CCOc3cccc4nc	1781
ccccc4n3	1782
COCc1ccc	1783
ccc1N	1784
CSCc3ccccc3	1785
nc3sc	1786
nc3ccccc23	1787
c6ccccc46	1788
c2c1O	1789
c5ccc6ccccc6c5	1790
ccc2O	1791
nc4c	1792
CCCCN3CC	1793
c1ccc2cc3	1794
Cn1cncn1	1795
c7c	1796
c7cc	1797
c2ccc3OCC	1798
c4co	1799
CCC2CCN	1800
Cc1co	1801
c2cn3	1802
cccc2C1	1803
c3ccc4nc	1804
CN1CCc2ccc	1805
COc1cc2OC	1806
N5CCCCC5	1807
nn34	1808
1CCCN1S	1809
Oc2ccccc2C	1810
CCN4CCC	1811
Oc1ccc2c	1812
Nc1nnnn1	1813
Clc1ccccc1N2CCN	1814
c4CCCCc34	1815
C5CCNCC5	1816
c3cc4ccccc4cn3	1817
CNc1ncc2cc	1818
1CO	1819
1Nc2c	1820
2c3ccc	1821
Cc7ccccc7	1822
Nc3c2	1823
Nc1cnc	1824
Nc2sc	1825
occ5	1826
oc2cc1O	1827
CCc1nc	1828
ccc6C	1829
c25	1830
NCc3cccc	1831
NCc2cnc3nc	1832
OCc4ccc5ccccc5c4	1833
CCNCC3	1834
nc6	1835
COc4ccccc4	1836
COc1n	1837
CNc3ccc	1838
C1CCCN1	1839
C1NCCN1	1840
ccccc16	1841
n1ccc	1842
n1cncn1	1843
c3cccnc23	1844
C21	1845
cc3cccnc23	1846
ccccc37	1847
c1ccnc	1848
c1ccsc1	1849
c3ccccc3c4ccccc4	1850
CCOc1cc2	1851
CCCCCS	1852
CCCCCc1ccc	1853
C3N	1854
cnccc12	1855
c4ccccc4O	1856
c4ccccc4S	1857
c4ccccc4n3	1858
cc4OC	1859
n3ncc	1860
CNCc1ccccc1	1861
OCCOC	1862
NCCc1ccccc1	1863
NCCc3ccccc3	1864
c6co	1865
c6ccccc16	1866
nc14	1867
nc1O	1868
n4c	1869
NC1CC1	1870
Cc1ccccc1c2ccccc2	1871
1Cc4ccc	1872
c5ccc6	1873
CCOC1	1874
ccc3O	1875
c2nc3ccc	1876
SCc2ccccc2	1877
Cc2cccs2	1878
ccc46	1879
CCCCCCCCc1ccc	1880
Cn1nn	1881
c7ccccc37	1882
NC2CCC	1883
c3c2cc1OC	1884
NNc1cc	1885
cccc2C3CCNCC3	1886
Oc1ccccc1NC	1887
OCCCO	1888
OCCCN2CCN	1889
NCCCN2CCN	1890
ccc5c4	1891
Cc1ccc2cc	1892
N5CCCC5	1893
c2nc3n	1894
c1nc2N	1895
Cc4cccs4	1896
c4cccc5cccc	1897
cc6O	1898
12CNCC	1899
12CC3CC	1900
c3oc4ccc	1901
c3oc4ccccc4c3	1902
cccc4c56	1903
OC2C1O	1904
Oc1c24	1905
CN2CCCC2	1906
CN2CCOCC2	1907
cccc3F	1908
c5cocc5	1909
n3ccnc3	1910
Nc1ccc2nn	1911
COc1cccc2c1C	1912
noc13	1913
N3CCCC3c3cc	1914
c2ncnc3scc	1915
c9ccccc9	1916
COc3ccccc3OC1	1917
Cc4ccc5OCC	1918
c3ncnc4scc	1919
c2nsnc2	1920
NC12CC3CC	1921
OCCN1CCCCC1	1922
c2csc3C	1923
c6cocc6	1924
+]	1925
1S	1926
3C4CCCC	1927
8CCC9	1928
Cc23	1929
Cc5cc	1930
Nc3	1931
Nc4n3	1932
N6CCN	1933
Oc3cccc	1934
Oc5ccc	1935
Oc6ccc7C	1936
Sc1ccccc1	1937
SC2C	1938
ncccc4	1939
nccc3c2	1940
on4	1941
sc3ccccc3c2	1942
cc9	1943
ccnc2	1944
CCc2cccc	1945
CCc3ccccn3	1946
NC6	1947
CCCc1nc	1948
CCCN3CCOCC3	1949
c46	1950
CCNc1ccc	1951
COc5ccccc5	1952
CNCC1	1953
CN3CC	1954
C2CC3	1955
C2CNC	1956
C2Cc3ccccc3	1957
C2CCOCC2	1958
c2ccccc2NC	1959
n2sc3ccccc3c2	1960
c3ccccc3S	1961
N2CCS	1962
CC3OC1CC	1963
CCCCCc1cc	1964
nc2C1	1965
cc45	1966
cc4c3	1967
CC4CCC4	1968
n3c2c1	1969
Cc1ccco1	1970
CN1CCC23	1971
COC1CC	1972
CS1	1973
c6ccccc56	1974
c3ccsc3	1975
CCOC4	1976
c1ncccn1	1977
ccc24	1978
ccc3ccc	1979
ccc3cccc4	1980
CCC1c2ccc	1981
Nc2ccc3C	1982
c1ccc2cc	1983
c7ncc	1984
c1cnc2	1985
4Cc5cc	1986
cc1OC5CCCC5	1987
c3nnc	1988
NNc2c3CCCCc3nc4ccccc24	1989
c2cnc3	1990
ncc2Cl	1991
1CN2C	1992
C68	1993
c2nc3cc	1994
Clc1cccc2	1995
NC45CC6CC	1996
nn3c4ccc	1997
c4cccc5cccnc45	1998
cc6OC	1999
23CNC	2000
cn2c1C	2001
c2cccc3OC	2002
CN3CCOCC3	2003
36N	2004
cccc34	2005
Nc3ncc4ccc	2006
OC4CCN	2007
OCCCN4CCN	2008
C1C2CCC3CC1	2009
CN5CCOCC5	2010
Oc1cccc2ccccc12	2011
CCOc2ccccc2OCc3ccccc3	2012
C1OC2COP	2013
c4cocc4	2014
ccnc2cc1OCCCN	2015
1CS	2016
2N	2017
4C5CC6	2018
7ccccc7	2019
Cn4	2020
Cn2cc	2021
Cc7ccc	2022
Ic1ccc	2023
NCCCCCC	2024
N6CCOCC6	2025
OCC3	2026
OCCOCCO	2027
n7	2028
oc3C	2029
sc2C1	2030
c1OCC	2031
c3O	2032
c4cc23	2033
cc15	2034
cc1c2nnc3c	2035
cc2NC	2036
cc2cnccc12	2037
n1cnc	2038
n1nnc	2039
c1ccccc1NC	2040
c1ccccc1OCC	2041
CC1NC	2042
CC1CCCC	2043
CC1CC2	2044
CC2CCN	2045
C2NCCN2	2046
c2ccccc2N1	2047
c1ccoc1	2048
CCOc4cc	2049
N2CC3	2050
CCCCCOC	2051
CCCCC1C	2052
cnc2c1	2053
N1O	2054
n3c2n1	2055
Cc1cccs1	2056
COCc1cccc	2057
COC1OC	2058
NCCc1ccc	2059
c6c5	2060
NC1CC	2061
CCOCc2cccc	2062
c2ncn3	2063
CC5CCC4	2064
nc4N	2065
CCCCN2C	2066
c1cc2cc	2067
c1ccc2ncccc2c1	2068
SCc2ccc	2069
CCCCCCCCCCCCCCCC	2070
c2ccc3cc	2071
CCSC1	2072
OC1CCCCC1	2073
c3nnc4	2074
c2cnn	2075
CC6CC6	2076
CCCCCCCOc1ccc	2077
ccc5N3	2078
CN1CCc2cc	2079
COc1cc2CCn3	2080
c5ccsc5	2081
Nc1ccnc	2082
C2Cc3cc	2083
nn1C	2084
c1nc2c	2085
c1nc2cc3c	2086
c4onc	2087
Nc2nc3ccc	2088
C2CCC1C	2089
c4cccc5cc	2090
C1CCc2cc	2091
c4ncn	2092
c2cc3cnc	2093
C1NCc2ccc	2094
c7ccc8	2095
Oc1ccc2N	2096
c3cc4c	2097
NCc1ccccc1C2	2098
c8ccccc8OC	2099
COc1cccc2OC	2100
Nc1nc2c	2101
CCC65O	2102
Cc6c	2103
OCC2CN	2104
n1ncnc1	2105
CCCCOc3ccc4CCC	2106
4C5CC6CC4C	2107
CC5CCC4C5	2108
COc1cc2CCn3cnc	2109
1N2CCC3	2110
3CCCN	2111
4C3	2112
5CC5	2113
5c7ccc	2114
6CCCC	2115
Cc6ccc	2116
Cc5cccc	2117
Cn2cn	2118
Cc8ccccc8	2119
NN2	2120
SC2	2121
Sc2ccccc2	2122
oc2cc	2123
oc2c1	2124
sc2ccc	2125
ss1	2126
ssc1	2127
ccnc	2128
CC9	2129
c1c2c	2130
NCc5ccc	2131
CCCc1cc	2132
OCc3ccc4ccccc4c3	2133
Clc1cc2	2134
Clc1ccccc1C	2135
Clc1cnc2	2136
c4N	2137
c4s	2138
c4nn	2139
CCNCC5	2140
cc14	2141
cccc3C	2142
ccccn4n3	2143
COCCOc1cc	2144
COCCOCCOCCOCCO	2145
CNP	2146
CNc1cc	2147
CN4CC	2148
CN5C	2149
cc2cn1	2150
C1Cc2ccccc2	2151
C1CCCC1	2152
n1Nc1ccc	2153
c1ccccc1F	2154
c1ccccc1Br	2155
ccccc25	2156
c5ncc	2157
c5ccccc25	2158
CC2CCC1	2159
CC2CCC2	2160
CC2CNC2	2161
C25	2162
cc3O2	2163
c2ccccc2c3ccccc3	2164
CCOCCOC	2165
N2CCC2	2166
CC3CCC	2167
C3c4ccc	2168
cn5	2169
N1S	2170
c4ccccc4F	2171
c4ccccc4C2	2172
cc4c	2173
cc4CCN	2174
cc4C3	2175
n3cnc	2176
CSS	2177
CSC1	2178
CSc1nnc	2179
nc1N	2180
nc1CC	2181
CCNC4	2182
CCCCN2CCN	2183
CCCCN4CCN	2184
COc1ccccc1CC	2185
c1ccc2ccc	2186
Cn1nc	2187
Cn1ncc2	2188
c1cnn	2189
CCCN1c2ccccc2	2190
OC1CCN	2191
c3nsc4ccccc34	2192
CN1CCN2	2193
c3ccc4cccc	2194
CN1CCc2ccccc2	2195
CCCCCCn34	2196
COc1cc2CC	2197
COc1cc2CCNC	2198
CCCC1CCN	2199
CCCC1CNC	2200
C2Cc3c	2201
c6ccccc6OC	2202
Nc2ccccc21	2203
nc5C	2204
Nc2ccncc2	2205
cn3c2C1	2206
CCN3CC6CC6	2207
c3cc4ccccn4n3	2208
Nc3nc4cccc	2209
COc1cccc2c1nc	2210
c2ncccc12	2211
35CCN4CC6CC6	2212
CCOc1ccccc1N2CCN	2213
Cc1nc2CN	2214
NCCN1CCOCC1	2215
CC12CCC3C	2216
Oc1cccc2c1OC	2217
Cc1cnc2nc	2218
c9ccc	2219
C1CCC1C2C	2220
NCCCN1CCN	2221
c2nccc3cc4CCN	2222
cnn1c2ccc	2223
CN3CCC2CC3	2224
5C6CCC	2225
c3nnc4CCCCCCn34	2226
n1ncnc1c2nc3c	2227
Clc1cnc2nc1	2228
+]([	2229
14	2230
2CCCCNC	2231
4N	2232
CP	2233
Cc3c2	2234
Cc1cncc	2235
Cc2occc2	2236
N7	2237
Nc5cc	2238
Oc8ccccc8	2239
S3	2240
SCc1ccccc1	2241
oc12	2242
oc2ccccc12	2243
onc1C	2244
cccc1O	2245
CCNC1	2246
CCc5ccc	2247
CCc3c2	2248
CCc3ccccc23	2249
CCc1s	2250
c1c3ccc	2251
c2s	2252
c32	2253
c3NC	2254
NCc2cccc	2255
NC2CC	2256
CCCc5ccccc5	2257
CCCc3c2	2258
CCCn23	2259
OCN1C	2260
ClCC	2261
Clc1ccc2c	2262
CCN3CC	2263
cc1I	2264
ncn	2265
CO3	2266
COCCOC	2267
COc1cncc	2268
CCCCCC3	2269
CCCCOc2ccc	2270
CCCCOc1cccc	2271
CNCC2	2272
CNc2cccn3nc	2273
n1CC	2274
n1ncc2	2275
n1CCC2C	2276
CC12C	2277
CC21	2278
C2c4ccc	2279
C2C3	2280
C2CCC2	2281
cc36	2282
cc3ccccc3	2283
n2c1	2284
n2nnc	2285
CCO3	2286
CCON	2287
N2CCCN	2288
CC3C6	2289
CC3CCCCCCC3	2290
C3CCC12C	2291
cncc	2292
cc4C1	2293
CN1CCCC	2294
OCCc2ccc	2295
OCCCCN3CCC	2296
NCCS	2297
ccc14	2298
CSc1ccccc1	2299
C4CCNCC4	2300
nc1c2ccc	2301
n45	2302
NC1CCc2ccc	2303
NC1CCc2cc	2304
Cc1ccccc1NC	2305
Cc1ccccc1Oc2ccc	2306
c2c1nc3N	2307
c1nc2ccccc2n1	2308
c3co	2309
ccc2S	2310
ccc2c34	2311
ccc2n1C	2312
ccc3cc	2313
c2nnn	2314
CC5C	2315
CC5CCCCC5	2316
CCCCN3	2317
c1ccc2cnc	2318
c1ccc2n1CCC2C	2319
ccc4c23	2320
OCCN3	2321
OCCN1CCN	2322
Cn1ccc	2323
c1cnc2n	2324
cccc24	2325
Oc1ccccc1CC	2326
OCCCOc2ccc	2327
NCCCO	2328
ccc5C	2329
CCCCCCNC1	2330
3Oc4c	2331
C6CCCCC6	2332
N5CCCN	2333
cncn4	2334
c1nc2nn	2335
CCN1CCCCC1	2336
2CCNc3ccc	2337
3CCCN3	2338
COc1ccc2ccc	2339
nn3C	2340
c5oc6ccccc6	2341
OCOc2c1	2342
C1CCc2ccc	2343
23OCCN	2344
c2ccncc2S	2345
OCCCN5CCCCC5	2346
CN3c4ccccc4C	2347
10CC	2348
N2CCSC	2349
CCN4CCCC4	2350
1CCCN1CCc2ccc	2351
N5CCNCC5	2352
CCOc1ccccc1NC	2353
NCCCN4CCN	2354
COc3ccc4C	2355
c4nccs4	2356
c4nonc4N	2357
2CSSCCC	2358
CCOCCOCCOCCOC	2359
cc4cccnc24	2360
Cc4ccc5ccccc5c4	2361
2Cc3ccccc3CN2	2362
c5cccc6cccc4c56	2363
c2nsc3ccccc23	2364
c4ncccc4n2	2365
c1cnccc1NC1CCCCCC1	2366
c1cnccc1NC1CCCCCCC1	2367
-])	2368
C1SCCS1	2369
Cc1sc2ncnc	2370
c4ncccn4	2371
2C3C4CC5C6C4CC3C6	2372
c3ncccn3	2373
c2cn3c	2374
COCCOc1ccn2c	2375
n3cncn3	2376
2C3C4CC5C6C4CC3C6C25	2377
/[	2378
1n2cnc3c	2379
24	2380
23CCN	2381
2OC3	2382
2CN3CCC2CC3	2383
3CC4	2384
4CCCN	2385
7CCC	2386
7CCCC	2387
Cc5c	2388
NCCCCCCC	2389
NCCOc1ccc	2390
Oc3c	2391
ON1C	2392
OCC3CCN	2393
Sc2cc	2394
])	2395
csc12	2396
nccc4c3	2397
sccc3c2	2398
ccsc	2399
CCB	2400
CCn2	2401
ccc6	2402
c1O2	2403
c2I	2404
c3cc2	2405
c3nc2	2406
c3c2c1	2407
c3sc	2408
CCCOc1ccc2C	2409
OCc2cn	2410
ClCC1	2411
CCN5CC6	2412
CCCCc3cn	2413
CCCCON	2414
CCCCn3cc	2415
CNCCCC	2416
C13	2417
C1c3ccc	2418
C12C	2419
C1c1cccc2	2420
c1ccccc1I	2421
c5CC	2422
CC2CCCC2	2423
C2NC	2424
cc3ccc	2425
c2ccccc2S1	2426
c1ccn	2427
c1ccncn1	2428
c3ccccc3CNCC	2429
CCOS	2430
CCOc3ccccc3c4ccccc4	2431
N2C1SC	2432
CCCCCO	2433
CCCCCN1CCN	2434
C3COC	2435
cnc3	2436
cnn2	2437
cnn2cc	2438
c4ccccc43	2439
c4ccccc4N	2440
nc2nn	2441
n3ccc4	2442
CNC12	2443
CN1CCOCC1	2444
CN1C2CCC1C	2445
OCCc3ccccc3	2446
Brc1cc	2447
CSc1cccc	2448
CSC12	2449
CSc1ccccc1N2CCN	2450
nc3n1	2451
C4CCC5	2452
c6ncnc	2453
n4cncn4	2454
Cc1ccccc1Cl	2455
Cc1ccccc1N2CCN	2456
c1noc	2457
ccc2OC	2458
ccc2ccccc12	2459
N4CC	2460
nc4nc	2461
nc4c3s2	2462
c1cc2nc	2463
1Oc3ccccc3C	2464
nn6	2465
ccc4c12	2466
CCCCCCCCCCCCC	2467
OCCN4CCCCC4	2468
c7nc	2469
c2ccc3sccc3c2	2470
c1cnc2ccccc2n1	2471
c1cnc2ccccc2c1	2472
NC2CCCC2	2473
NC2CCCCCC2	2474
c3c2Cl	2475
CCC2CCCCC2	2476
CCS2	2477
CCCNC3	2478
NCCN4CCOCC4	2479
Oc1ccccc1Cl	2480
NCCCl	2481
Cc4ccccc4F	2482
c3ccc4N	2483
c3ccc4CC5C	2484
ncc23	2485
CN1CCc2ccc3	2486
CCOc1ccc2C	2487
cncn6	2488
Nc2ncc3C	2489
nc5ccccc45	2490
CCC56C	2491
N3Cc4occc4	2492
CCCO4	2493
c3onc	2494
CN4CCOCC4	2495
c3cccc4c	2496
c4nnc	2497
ncc3c2	2498
CCC34C	2499
c2cccc3c2	2500
c2cc3ccccc3	2501
CCN3CCOCC3	2502
NCCCCCCCN	2503
OC3CSS	2504
ccc1Oc2cccc	2505
Oc1ccc2ccc	2506
c3cc4CCN5C	2507
Nc3nc4ccc	2508
1CCCNC1	2509
CCCCOc4ccc5	2510
Nc2nc3CC	2511
Nc2nc3cccc	2512
OCCO2	2513
Nc3ccc4nc	2514
CCC6C5CC	2515
C2CNCCO2	2516
Cc6cc	2517
c4cncnc4	2518
C23CC4CC	2519
ncnc3c2	2520
n6cncn6	2521
coc2n1	2522
NC5CC5	2523
N2Cc3ccccc3CC2C	2524
NCCCN12	2525
OCCNCc2cccc	2526
8C9CCCC	2527
12CCC3C	2528
c1oc2ccccc2c1	2529
c1cc2ccccc2o1	2530
Cc3cn4cc	2531
Fc1cccc2cccc	2532
c5ncccc5c1	2533
C3CCC21C	2534
c4ccccc4Oc13	2535
Cn1nnnc1	2536
ncccc4c3	2537
c5oc6ccccc6n5	2538
CCN5CC6CC6	2539
c3ccccc3CNCCc4cccs4	2540
cnn2cccc12	2541
OC3CSSC3	2542
13CCN	2543
1c2onc	2544
3CCC4	2545
3c2cc1O	2546
4CO	2547
4CCOC4	2548
7O	2549
Cc4c3	2550
Cc4occc4	2551
Cc2cc1OC	2552
Cc5ccccc45	2553
FCCOC	2554
NN1	2555
NN1CC	2556
NCC1CCC	2557
O6	2558
Oc12	2559
OCCCCCCC	2560
Sc3ccccc3	2561
SCS	2562
nc3ccc	2563
nc4ccc	2564
occ1O	2565
sc4C	2566
CCc1cnc	2567
CCc2cc1	2568
CCc15	2569
CCc4ccc5OCC	2570
c1NC1	2571
c2N	2572
c2CC	2573
c2NC	2574
c2c3ccccc3	2575
c2Br	2576
c3c1	2577
c3c4ccccc4	2578
NCN	2579
NCc1cccc	2580
NCc5cccnc5	2581
CCCc2c1	2582
CCCN3CCC	2583
ClC1C	2584
cc1Nc1ccc	2585
cc1c2ccc3nc	2586
ncnc4	2587
nc7ccccc7	2588
ccccn45	2589
CONC	2590
CCCCOc3ccc	2591
CNc2ccc	2592
CNc2ccc3nc	2593
CNc2cnc3nc	2594
CN7CCN	2595
cc2ccccc12	2596
c2cccnc12	2597
C1CO	2598
C1C2CC	2599
c1ccccc1S2	2600
ccccc26	2601
CC1CC1	2602
c5cc4F	2603
C24	2604
cc3n2	2605
ccccc36	2606
c3ccccc3S2	2607
c3ccccc3Sc3ccc	2608
N2CNC	2609
N2C3CCCCC3	2610
CCCCCN4CCN	2611
C3C2	2612
C3CCCCN3	2613
cnn	2614
cnc46	2615
N1CC2	2616
c4ccccc4C1	2617
CC4CCN	2618
CN1c1ccc	2619
COCc1ccccc1	2620
COC1CCN	2621
COC12C	2622
OCCc1ccccc1	2623
c2cccc3C	2624
ccc1CCC	2625
CSc1cc	2626
nc3CC	2627
nc3oc	2628
nc3N12	2629
nc3c2ncn3	2630
C4CCOCC4	2631
C4CCC3	2632
C4Oc5cc	2633
c6ccccc26	2634
c6ccccc36	2635
n4n	2636
n4ncc	2637
NC1Cc2ccc	2638
c5ccccc5N	2639
c5ccccc5O	2640
c1nc2ccc	2641
c1nnc3c	2642
c1nonc1	2643
ccc2oc	2644
ccc3Cl	2645
CCCCN1CCC	2646
c1ccc2ccccc2n1	2647
C5Cc6ccccc6	2648
Cc2ccccc2Br	2649
ccc4C3	2650
Nc1ncnc2c1ncn2C1OC	2651
Cc1ccccn1	2652
OCCNCC2	2653
OCCN5CCCC5	2654
Cn1cnc2c	2655
CCC4C3CCC3	2656
cc1OC2	2657
2CCCN2	2658
Cc1cs	2659
OC1CC2	2660
c3nc4ccc	2661
c2cnc3cc	2662
c2cnc3ccccc3n2	2663
Oc1ccccc1OCCNCc2cccc	2664
c3ccc4ccccc4n3	2665
ccc57	2666
ccc5CNC	2667
2O1	2668
cn12	2669
Nc1ccccc1Cl	2670
c1OCc3ccccc3	2671
c1OCO2	2672
Cc1ccc2OC	2673
Cc1ccc2nc	2674
CCCCCCc1onc	2675
COc1cc2CCN3C	2676
CCN1CCCC1CNC	2677
c6ccccc6Cl	2678
n5cnc	2679
n5ncc	2680
c4c3C	2681
c4cccc5C	2682
CCC56	2683
N3Cc4cc	2684
N3Cc4c	2685
c2oc3ccccc3c2	2686
OCOc3	2687
CCCOc4ccc5CNC	2688
C1CCc2c	2689
CN4CCC	2690
CCn1ccc	2691
Oc2ccccc2Cl	2692
cn2n1	2693
N1CCc2ccc	2694
c4noc	2695
c2cc3ccc	2696
Nc3ccccc3S	2697
OCCCCCCNc4c5CCCCc5nc6ccccc46	2698
NCCCCCCN	2699
OCc2ccccc2C	2700
c1cccc2cccnc12	2701
Cc1nc2ccccc2c	2702
CCCCOc4ccc5CNC	2703
COc1cccc2ccccc12	2704
CCOc1ccccc1OCC	2705
c1cnccc1N2CCN	2706
34c56	2707
Nc4ccccc4Cl	2708
c2c3c45	2709
C4Cc5cccc6cccc4c56	2710
c5cccnc5F	2711
Cc1cc2cc	2712
Cc6nc7ccccc7	2713
c4cc5ccccc5	2714
Clc1ccc2cc	2715
CCN5CCC	2716
COc3ccccc3O2	2717
CCN2CCc3ccccc3	2718
c1nc2ccccc2n3nc	2719
Fc1ccc2cccc	2720
2Cc3ccccc3CN	2721
Cc2s1	2722
c1OCCNCCOc2ccccc2OCc3ccccc3	2723
c2nc3ccccc3s2	2724
Oc2nnn	2725
Oc2ncccc2C3CCNCC3	2726
Cn1ccc2ccc3	2727
N2CCCC2C	2728
cc2OC1c1ccc	2729
ncnc3c2c5CC	2730
1COc2cccc3C	2731
1c2c3c45	2732
2OCC	2733
2CCCN	2734
23CCC	2735
2OCCNCC	2736
3COC	2737
45C	2738
6CNC	2739
Cn2c	2740
Cc4cnc	2741
Nc5	2742
NCCCCCCCC	2743
NCCCNC	2744
Nc4c3	2745
Nc3ccccn3	2746
N7C	2747
Nc7ccc8	2748
OOC	2749
Oc4cc	2750
Oc4c	2751
SCCCC	2752
cs4	2753
co1	2754
nc2ccc	2755
ccn5	2756
ccnc2c1	2757
CCc3	2758
CCc3c	2759
CCc3nc	2760
CCc3cn	2761
CCc1ccc2c	2762
cccn5	2763
cccn2n1	2764
NCc2nc	2765
NCc5cc	2766
NCc2ccc3nc	2767
CCCF	2768
CCCNC1	2769
CCCN2C	2770
CCCOc1cccc	2771
OCc2c	2772
c1ccc1	2773
CCNc2nc	2774
cc1Nc3ncc	2775
COc3cccc	2776
COc4cccc	2777
COCCNC	2778
COc1c2	2779
COc3ccccc3C2	2780
COc6ccc7C	2781
CCCCc1c	2782
CCCCNC1	2783
CCCCc5ccccc5	2784
CCCCCCN3CCN	2785
CNCCN	2786
CNCCC2	2787
CNc1ncc	2788
CNc2ncc	2789
cc2Br	2790
cc2O1	2791
c2ccc1	2792
C1CNC	2793
C1N1CC1	2794
C1OC1OC	2795
ccccc17	2796
n1c3ccc	2797
n1c4ccc	2798
CC1F	2799
C2Cl	2800
C2c3ccc	2801
C24O	2802
cc3s2	2803
cc3OC2	2804
c2ccccc2Oc3ccccc3	2805
n2ncc3	2806
n2C1OC2COP	2807
c1ccnnc1	2808
c1ccn2ncc	2809
c3ccccc3O2	2810
CC34CCC	2811
CCCCCON	2812
C3C4	2813
cnc3nc	2814
N1c1ccccc1	2815
N1Cc2ccccc2	2816
nc2NC	2817
nc2c3ccc	2818
nc2c1C	2819
nc2cncc	2820
CC4CCCO4	2821
n3c2n	2822
2COC	2823
2Cc5ccc	2824
Cc1ccc2C	2825
N3CCOC	2826
OCCCCN	2827
C4N	2828
c2cn1	2829
c6nc	2830
NC1CCCC1	2831
3Cc2c1	2832
CCOC1OC	2833
CCNC5	2834
Cc1ccn	2835
Cc1ccnc	2836
Cc1ccsc1	2837
CCC12	2838
CCCCNc1nc	2839
CCCCN1CCN	2840
COc1ccccc1N	2841
COc1ccccc1O	2842
COc1ccccc1OCC	2843
c1ccc2NC	2844
c1ccc2oc	2845
ccc4n3	2846
c4ccnc	2847
CCCCCCCCCCCCCC	2848
Cn1cnc	2849
Cn1ncc	2850
c7occc	2851
c2ccc3NC	2852
Cc3cccnc3	2853
CCCN1CC	2854
3CCNCC3	2855
OC1CCC	2856
CN1CCN2C	2857
cc1Cc2cnc3nc	2858
cccc2C1C	2859
OCCCOc3ccc	2860
Cc4ccccc4OC	2861
c3ccc4ncccc4c3	2862
ncc2CN	2863
ccc5F	2864
ccc5OCC	2865
3CCc4ccccc4	2866
Nc1ccncc1	2867
c1nc2cc	2868
c6ccccc6C	2869
Nc2nccc3ccc	2870
NC4CC5CCC4C5	2871
C2CCCN2	2872
C2CCC34C	2873
1OCc2ccccc2	2874
c3nc4cc	2875
OCOc5	2876
c8c7	2877
CCCOc3ccc	2878
CCCOc4ccc	2879
CCCOc1nc2N	2880
c3oc4ccccc4n3	2881
Nc2ncnc3sc	2882
cccc45	2883
cccc4F	2884
cn3c4ccc	2885
c2ccncc2NC	2886
CN3CCCC3	2887
10C	2888
36OC	2889
Oc1ccc2CC3	2890
sc1NC	2891
sc1c3ccnc	2892
sc1c3csc	2893
c1cccc2c	2894
Nc1ccc2nc	2895
C1NCC2	2896
CCCCCCCCCc1ccc	2897
Nc1nc2cc	2898
Nc1nc2cc3c	2899
CCN2CCCC2	2900
c1ccncc1S	2901
c3cncnc3	2902
NCC2CCC	2903
NCC2CCC3	2904
CCC6C5CCC5	2905
cccc1N	2906
cccc1CC	2907
C1CCNCC1	2908
c4cc5C	2909
c4cc5OCOc5	2910
c2noc3ccccc23	2911
c5ns	2912
ccc1OCCOC	2913
cn4n3	2914
OC1Cc2c	2915
Nc3cnc4	2916
c3cc4ccccc4s3	2917
OCCN1CCOCC1	2918
Nc1ncnc2c1c	2919
ncccc34	2920
ncccc3c12	2921
OCc6ccccc6C	2922
c3noc4cc	2923
c3noc4ccccc34	2924
c3cnn4ncccc34	2925
c5cncnc5	2926
c4cnc5ccccc5c4	2927
c4cnc5ccccn45	2928
CC1C2Cc3ccc	2929
N4CCSC4	2930
c4nc5ccccc5s4	2931
CCOc1cc2ncnc	2932
cc6Oc7cc	2933
CC2CCC1N2C	2934
n1ncc2c	2935
c3nc2nc1C	2936
C1c1cccc2c1OCO2	2937
n5cncn5	2938
c2cc3cccnc3c	2939
c4cc5ccccc5s4	2940
Cn1ccc2ccc3ncccc3c12	2941
Nc7ccc8nc	2942
C24OO3	2943
CC34CCC1C	2944
c7occc7	2945
1NS	2946
1CCC2	2947
1N2C	2948
1C2CC	2949
23CC	2950
3c5cc	2951
34CC	2952
3CNCC	2953
35C	2954
3C4CC5	2955
4CNC	2956
4CN3	2957
6O	2958
6C5	2959
6c8ccc	2960
7N	2961
Cc3nc	2962
Cc3ccccc23	2963
Cc4cn	2964
Cc4ccccn4	2965
Cc2ccccc12	2966
C7C	2967
Cc4cccc5ccccc45	2968
NCC3	2969
Nc1c2	2970
Nc4ccccc24	2971
Nc4cnn	2972
Nc4nnc	2973
Oc5c4	2974
Oc4ccccc24	2975
Oc5ccccc15	2976
Oc3ccc4nc	2977
SCCO	2978
Sc5ccc	2979
SSC	2980
nccc5c4	2981
on2	2982
oc3ccccc23	2983
onc2C	2984
s6	2985
snc1	2986
sc23	2987
sc4C3	2988
CCBr	2989
CCc3cc4	2990
c1S	2991
c1c2nc	2992
c1OCCNC	2993
c2CCN	2994
c2CC1	2995
c2s1	2996
c2O1	2997
c3c1cn	2998
NCc4ccccc4Cl	2999
